[
  {
    "title": "Meredith and Derek's Professional and Personal Entanglement",
    "arc_type": "Soap Arc",
    "description": "Meredith Grey and Derek Shepherd navigate their complex relationship, which begins with a one-night stand and evolves as they work together at Seattle Grace Hospital, balancing personal feelings with professional responsibilities amidst hospital drama.",
    "main_characters": "Meredith Grey; Derek Shepherd",
    "interfering_episode_characters": "Miranda Bailey; Cristina Yang",
    "single_episode_progression_string": "Meredith avoids Derek in the parking lot. Derek confronts Meredith about avoiding him. Meredith admits her involvement with an attending complicates things. Derek asks if she wants him to leave, and she hesitates. Meredith decides to break up with Derek. Meredith asks Derek to stop giving her favors."
  },
  {
    "title": "George's Unrequited Love for Meredith",
    "arc_type": "Soap Arc",
    "description": "George O'Malley harbors unrequited feelings for Meredith Grey, leading to awkward interactions and tension within their group of friends and colleagues as he struggles to express his emotions amidst their professional environment.",
    "main_characters": "George O'Malley; Meredith Grey",
    "interfering_episode_characters": "Izzie Stevens; Alex Karev",
    "single_episode_progression_string": "George spills coffee on himself while trying to bring Meredith coffee. Izzie teases George about liking Meredith, which he denies. George awkwardly tries to flirt with Meredith. George realizes he missed his chance to talk to Meredith when he finds her room empty."
  },
  {
    "title": "Cristina and Burke's Secret Romance",
    "arc_type": "Soap Arc",
    "description": "Cristina Yang and Preston Burke navigate a secret romantic relationship while working at Seattle Grace Hospital, balancing their personal connection with their professional responsibilities and ambitions.",
    "main_characters": "Cristina Yang; Preston Burke",
    "interfering_episode_characters": "Meredith Grey; Annie Connors",
    "single_episode_progression_string": "Cristina encounters Burke and wants to be involved in the case. Burke asks Cristina to find Annie's mother and family history. Cristina rudely discusses the patient's history with Burke. Burke tells Cristina he won't do her any more favors. Burke asks Cristina what their relationship is. Cristina questions if he really needs a label. Burke tells her to lock the door."
  },
  {
    "title": "Cristina's Ambition and Emotional Detachment",
    "arc_type": "Soap Arc",
    "description": "Cristina Yang's relentless ambition in her surgical career often leads to emotional detachment from patients, as she prioritizes her professional goals over personal connections and empathy, highlighting her struggle to balance success with compassion.",
    "main_characters": "Cristina Yang",
    "interfering_episode_characters": "Meredith Grey; Preston Burke",
    "single_episode_progression_string": "Cristina reassures Meredith about her relationship with Derek. Cristina rudely discusses Annie's history with Burke. Cristina tells Burke to be quiet during surgery. Burke asks Cristina about their relationship status."
  },
  {
    "title": "Alex Karev's Professional Growth and Challenges",
    "arc_type": "Genre-Specific Arc",
    "description": "Alex Karev navigates the challenges of maintaining professionalism and proving himself in the competitive environment of surgical training, often facing setbacks due to his behavior and interactions with colleagues and patients.",
    "main_characters": "Alex Karev",
    "interfering_episode_characters": "Annie Connors; Izzie Stevens; Preston Burke; George O'Malley",
    "single_episode_progression_string": "Alex spills coffee on himself. Alex makes a derogatory comment about Annie, which she overhears. Burke removes Alex from Annie's surgery due to unprofessional behavior. Alex misses pages because his pager's battery is dead, causing tension with Izzie. Alex arrives too late with blood for Annie's surgery, witnessing her death."
  },
  {
    "title": "Bailey's Leadership and Ethical Mentorship",
    "arc_type": "Genre-Specific Arc",
    "description": "Miranda Bailey provides leadership and ethical guidance to the interns, helping them navigate the complexities of patient care and professional development at Seattle Grace Hospital, balancing high standards with empathy.",
    "main_characters": "Miranda Bailey",
    "interfering_episode_characters": "Derek Shepherd; Meredith Grey; Alex Karev",
    "single_episode_progression_string": "Bailey instructs the interns to stay composed during Annie's case. Bailey reminds Alex to use respectful language with patients. Bailey questions if Annie truly wants to live. Bailey accuses Derek of favoritism towards Meredith. Bailey warns Derek about the consequences of favoritism. Bailey explains to Meredith the issues with perceived favoritism."
  },
  {
    "title": "Interns' Professional Rivalries and Support",
    "arc_type": "Genre-Specific Arc",
    "description": "The interns at Seattle Grace Hospital, including Meredith, Cristina, George, Izzie, and Alex, experience professional rivalries and growth, forming a strong support network as they compete for opportunities and navigate the challenges of their surgical training.",
    "main_characters": "Meredith; Cristina; George; Izzie; Alex",
    "interfering_episode_characters": "Bailey; Derek; Burke",
    "single_episode_progression_string": "George spills coffee on himself, highlighting his clumsiness. Izzie and George argue about waiting for Meredith, showcasing tension. Bailey warns Derek about favoritism towards Meredith. Alex is removed from surgery due to his comments about Annie. Izzie performs a risky procedure on Jimmy, demonstrating her growth. Alex misses pages due to a dead pager battery, causing tension with Izzie. Annie's surgery fails, impacting the interns emotionally."
  },
  {
    "title": "Meredith's Struggle with Favoritism and Reputation",
    "arc_type": "Genre-Specific Arc",
    "description": "Meredith Grey navigates the challenges of perceived favoritism from Derek Shepherd, impacting her professional relationships and reputation at Seattle Grace Hospital, as she seeks to prove her competence and integrity in the surgical field.",
    "main_characters": "Meredith Grey; Derek Shepherd",
    "interfering_episode_characters": "Miranda Bailey; Preston Burke",
    "single_episode_progression_string": "Derek accuses Meredith of avoiding him. Bailey gives Meredith a harsh look during a procedure. Bailey accuses Derek of favoring Meredith. Bailey warns Derek about the consequences of favoritism. Meredith asks Derek to stop giving her favors."
  },
  {
    "title": "Izzie Stevens' Fight for Respect and Advocacy",
    "arc_type": "Genre-Specific Arc",
    "description": "Izzie Stevens battles stereotypes and seeks respect from her colleagues, advocating for her patients' well-being and demonstrating her competence as a surgical intern, while forming bonds with fellow interns.",
    "main_characters": "Izzie Stevens",
    "interfering_episode_characters": "George O'Malley; Alex Karev; Miranda Bailey; Jimmy's Wife",
    "single_episode_progression_string": "Izzie supports George after he spills coffee. Izzie is assigned to get a CT scan for Annie. Izzie suggests an X-Ray for Jimmy and gets Bailey's approval. Izzie handles an emergency surgery on Jimmy despite feeling unprepared. Izzie successfully revives Jimmy by massaging his heart. Izzie confronts Alex about missing pages and destroys his pager."
  },
  {
    "title": "Navigating Power Dynamics at Seattle Grace",
    "arc_type": "Genre-Specific Arc",
    "description": "The interns and residents at Seattle Grace Hospital navigate complex power dynamics, dealing with attendings' expectations, peer competition, and the hierarchical structure of the hospital.",
    "main_characters": "Meredith; Derek; Bailey",
    "interfering_episode_characters": "Cristina; Alex; Burke",
    "single_episode_progression_string": "Meredith worries about being kicked out for her relationship with Derek. Bailey warns Derek about favoritism towards Meredith. Alex is removed from a surgery due to his behavior. Cristina argues about the fairness of Alex's removal. Burke and Derek discuss different approaches to patient treatment. Bailey questions the worth of a procedure due to its low success rate. Burke warns Alex about potential legal issues. Meredith asks Derek to stop giving her favors."
  }
]