[
  {
    "title": "Meredith and Derek's Complicated Relationship",
    "arc_type": "Soap Arc",
    "description": "Meredith and Derek's relationship begins with a one-night stand and evolves amidst professional challenges and personal revelations.",
    "episodic": false,
    "main_characters": "Meredith; Derek",
    "interfering_episode_characters": "Cristina; Bailey",
    "single_episode_progression_string": "Meredith struggles with her relationship with Derek and its professional implications. Derek accuses Meredith of avoiding him, and she admits the complications due to professional boundaries. Despite the tension, they share a tender moment in the rain before getting into Derek's car."
  },
  {
    "title": "Intern Dynamics at Seattle Grace",
    "arc_type": "Genre-Specific Arc",
    "description": "The interns at Seattle Grace Hospital form friendships and rivalries as they navigate the challenges of their medical training.",
    "episodic": false,
    "main_characters": "George; Izzie; Alex; Meredith",
    "interfering_episode_characters": "Cristina; Bailey",
    "single_episode_progression_string": "George spills coffee on himself and is teased by Izzie about liking Meredith. The interns argue about waiting for Meredith before leaving for work. Izzie and Alex have a confrontation over a missed surgery, leading to Izzie destroying Alex's pager. Alex teases George, and Meredith questions Alex's shallowness. The interns work together on challenging cases, highlighting their dynamics."
  },
  {
    "title": "Izzie's Personal Growth",
    "arc_type": "Genre-Specific Arc",
    "description": "Izzie navigates her relationship with Hank and her commitment to her career, facing personal and professional challenges.",
    "episodic": false,
    "main_characters": "Izzie",
    "interfering_episode_characters": "Alex; Burke",
    "single_episode_progression_string": "Izzie is overwhelmed with requests due to Alex's absence. She performs an emergency procedure on Jimmy, saving his life despite feeling unprepared. Izzie confronts Alex about his irresponsibility, showing her growth in confidence and professionalism."
  },
  {
    "title": "Medical Case: Annie Connors' Tumor",
    "arc_type": "Episodic Arc",
    "description": "The interns and doctors at Seattle Grace work on a challenging case involving Annie Connors, who has a large tumor.",
    "episodic": true,
    "main_characters": "Bailey; Burke; Alex",
    "interfering_episode_characters": "Cristina; George; Annie Connors",
    "single_episode_progression_string": "Bailey introduces Annie Connors, who has a large tumor. The team discusses her treatment plan, and Annie's surgery is complicated by a lack of blood. Despite efforts, Annie passes away, leaving Alex to reflect on his earlier insensitive comments."
  },
  {
    "title": "Medical Case: Edward's Brain Surgery",
    "arc_type": "Episodic Arc",
    "description": "Derek and Meredith perform a challenging brain surgery on Edward, who is hesitant about the procedure.",
    "episodic": true,
    "main_characters": "Derek; Meredith; Edward",
    "interfering_episode_characters": "Bailey",
    "single_episode_progression_string": "Meredith speaks with Edward's daughter about convincing him to have brain surgery. During the surgery, Meredith holds Edward's hands while Derek operates. The procedure is successful, and Edward's hands stop shaking, bringing joy to him and his daughter."
  }
]