{
  "scenes": [
    {
      "scene_number": 1,
      "plot_segment": "A voice narrates about 'the game,' saying some people have what it takes to play and some do not. The narrator's mother was one of the greats, but the narrator feels 'screwed' in comparison.",
      "start_time": "00:00:03,502",
      "end_time": "00:00:17,155",
      "start_seconds": 3.502,
      "end_seconds": 17.155
    },
    {
      "scene_number": 2,
      "plot_segment": "In a house, a woman and a man interact awkwardly after spending the night together. The woman calls the situation humiliating and tells the man he has to leave because she is late for her first day of work. The man asks if she lives there; she says she moved from Boston two weeks ago, it was her mother's house, and she is selling it. The man apologizes, thinking her mother is dead, but she clarifies her mother is not dead. She says they do not need to exchange details or pretend to care. She goes upstairs to shower, telling him to be gone when she returns. They exchange names: Derek and Meredith. They say goodbye.",
      "start_time": "00:00:36,809",
      "end_time": "00:02:05,625",
      "start_seconds": 36.809,
      "end_seconds": 125.625
    },
    {
      "scene_number": 3,
      "plot_segment": "A group of new surgical interns is addressed by a senior doctor, who tells them they are now doctors, not students. The doctor warns them that the next seven years will be the best and worst of their lives, and that many will not make it. The doctor tells them to look at their competition and outlines the statistics of failure. The narrator repeats that she is 'screwed.'",
      "start_time": "00:02:05,625",
      "end_time": "00:02:51,714",
      "start_seconds": 125.625,
      "end_seconds": 171.714
    },
    {
      "scene_number": 4,
      "plot_segment": "Interns gather and discuss the gender ratio and rumors about one being a model. Cristina is identified, and several interns realize they are all assigned to a resident called 'the nazi.' George O'Malley introduces himself and awkwardly references meeting at a mixer. The group jokes about the resident's nickname. Izzie Stevens introduces herself. Dr. Bailey, the resident, gives the interns five rules: don't suck up, answer every page at a run, don't wake her unless a patient is dying, don't let the dying patient be dead when she arrives, and move when she moves. She tells them to get out of her way.",
      "start_time": "00:03:10,321",
      "end_time": "00:05:13,985",
      "start_seconds": 190.321,
      "end_seconds": 313.985
    },
    {
      "scene_number": 5,
      "plot_segment": "A patient, Katie Bryce, a 15-year-old girl with seizures, is brought into the hospital. The team works to stabilize her. Dr. Burke orders a full set of tests. Cristina is assigned labs, George does patient work-ups, and Meredith is told to get Katie a CT scan and is made responsible for her. Izzie is assigned rectal exams.",
      "start_time": "00:05:29,232",
      "end_time": "00:06:21,167",
      "start_seconds": 329.23199999999997,
      "end_seconds": 381.16700000000003
    },
    {
      "scene_number": 6,
      "plot_segment": "Meredith checks on Katie's labs, which are clear. Cristina tells Meredith about a rumor that the best intern gets to perform a procedure during the first shift. Meredith tells Cristina to go away. Meredith reassures a patient about bypass surgery with Dr. Burke. Meredith gets lost in the hospital and talks to Katie, who is upset about missing her pageant. Izzie performs a rectal exam on a patient. Katie complains about her situation and says she will have fun with Meredith.",
      "start_time": "00:06:37,228",
      "end_time": "00:08:25,696",
      "start_seconds": 397.228,
      "end_seconds": 505.696
    },
    {
      "scene_number": 7,
      "plot_segment": "The interns eat together. George complains about performing 17 rectal exams and says Dr. Bailey hates him. The others discuss Meredith's mother, Ellis Grey, a famous surgeon. Cristina wishes for a good case. Meredith and Cristina complain about Katie Bryce. Dr. Burke announces that George O'Malley will scrub in for an appendectomy, surprising the group.",
      "start_time": "00:08:33,597",
      "end_time": "00:09:55,724",
      "start_seconds": 513.597,
      "end_seconds": 595.724
    },
    {
      "scene_number": 8,
      "plot_segment": "Dr. Bailey and Dr. Burke discuss George being chosen for surgery. Bailey says Burke always picks one intern to terrorize. Meredith is asked questions by Katie's parents but defers to Dr. Shepherd, the new attending. Meredith realizes Dr. Shepherd is Derek, the man from earlier. They awkwardly discuss their previous night together and agree to keep things professional.",
      "start_time": "00:09:55,339",
      "end_time": "00:11:17,689",
      "start_seconds": 595.3389999999999,
      "end_seconds": 677.689
    },
    {
      "scene_number": 9,
      "plot_segment": "George prepares for surgery while other interns bet on his performance. In the operating room, George begins the appendectomy and successfully removes the appendix, but then rips the cecum and causes a complication. Dr. Burke takes over and calls George a 'pansy-ass idiot.' The other interns nickname George '007' (license to kill) after his mistake.",
      "start_time": "00:12:14,908",
      "end_time": "00:15:06,673",
      "start_seconds": 734.908,
      "end_seconds": 906.673
    },
    {
      "scene_number": 10,
      "plot_segment": "George realizes the others are calling him '007.' His friends deny it, but he knows the truth. Cristina gets a page about Katie Bryce and leaves.",
      "start_time": "00:15:06,673",
      "end_time": "00:15:39,165",
      "start_seconds": 906.673,
      "end_seconds": 939.165
    },
    {
      "scene_number": 11,
      "plot_segment": "Cristina and Meredith discuss their struggles. Meredith is paged for a 911 on Katie Bryce, but Katie is just bored and wants to watch her pageant on TV. Meredith tells her to go to sleep and stop wasting her time.",
      "start_time": "00:15:06,673",
      "end_time": "00:17:12,039",
      "start_seconds": 906.673,
      "end_seconds": 1032.039
    },
    {
      "scene_number": 12,
      "plot_segment": "Izzie asks George for help with a patient who needs a central line. George admits he has never done one. They consider waking Dr. Bailey, but she angrily tells them not to bother her unless the patient is dying.",
      "start_time": "00:17:12,039",
      "end_time": "00:18:24,241",
      "start_seconds": 1032.039,
      "end_seconds": 1104.241
    },
    {
      "scene_number": 13,
      "plot_segment": "Cristina is given lab samples to take. She diagnoses a patient with post-op pneumonia, but a nurse questions her. Cristina insists on antibiotics and complains about nurses. Alex introduces himself and insults Cristina by calling her a nurse. Cristina is frustrated with Katie's case. Alex asks about Meredith, and George awkwardly claims to be friends with her.",
      "start_time": "00:18:22,413",
      "end_time": "00:19:31,166",
      "start_seconds": 1102.413,
      "end_seconds": 1171.166
    },
    {
      "scene_number": 14,
      "plot_segment": "Katie Bryce has multiple grand mal seizures. Meredith is put on the spot to decide treatment. She orders phenobarbital when other drugs fail. Katie's heart stops, and the team performs a code blue. Meredith leads the resuscitation, and Katie's heart rhythm returns. Dr. Bailey scolds Meredith for not paging her immediately.",
      "start_time": "00:19:45,584",
      "end_time": "00:21:47,713",
      "start_seconds": 1185.584,
      "end_seconds": 1307.713
    },
    {
      "scene_number": 15,
      "plot_segment": "Katie's parents confront Dr. Shepherd about not having answers. Mr. Bryce demands another doctor. Dr. Burke reassures a patient about bypass surgery. Izzie comforts the patient's wife, Gloria, and promises he will be fine. Cristina and George discuss their day. Dr. Shepherd asks the interns for help diagnosing Katie, offering the chance to scrub in on her surgery as a reward.",
      "start_time": "00:22:24,123",
      "end_time": "00:25:02,340",
      "start_seconds": 1344.123,
      "end_seconds": 1502.34
    },
    {
      "scene_number": 16,
      "plot_segment": "Cristina and Meredith agree to work together to solve Katie's case, with Meredith taking the surgery if they succeed. Cristina asks why Meredith does not want to work with Shepherd, and Meredith reveals she slept with him. They rule out various diagnoses but are stumped. Cristina expresses regret about not getting the surgery. Meredith realizes Katie's rhythmic gymnastics injury might be relevant.",
      "start_time": "00:25:30,000",
      "end_time": "00:28:08,000",
      "start_seconds": 1530.0,
      "end_seconds": 1688.0
    },
    {
      "scene_number": 17,
      "plot_segment": "Meredith and Cristina present their theory to Dr. Shepherd: Katie's minor fall during rhythmic gymnastics may have caused a subarachnoid hemorrhage from a burst aneurysm. Dr. Shepherd orders tests, and they confirm the diagnosis. Dr. Shepherd praises Meredith and Cristina but selects Meredith to scrub in on the surgery.",
      "start_time": "00:27:25,134",
      "end_time": "00:29:21,886",
      "start_seconds": 1645.134,
      "end_seconds": 1761.886
    },
    {
      "scene_number": 18,
      "plot_segment": "Cristina is disappointed about not being chosen for surgery. Dr. Burke tells Izzie that the bypass patient, Tony, had too much heart damage and died. Izzie is upset because she promised the patient's wife he would be fine. Dr. Burke scolds her for making promises she cannot keep and tells her to inform the wife of the death.",
      "start_time": "00:30:43,020",
      "end_time": "00:33:06,047",
      "start_seconds": 1843.02,
      "end_seconds": 1986.047
    },
    {
      "scene_number": 19,
      "plot_segment": "Cristina confronts Meredith about getting the surgery. Meredith offers to give it to Cristina, but Cristina refuses and tells Meredith to deal with her actions. Cristina accuses Meredith of getting opportunities because of her connections and not earning them.",
      "start_time": "00:31:49,508",
      "end_time": "00:32:13,885",
      "start_seconds": 1909.508,
      "end_seconds": 1933.885
    },
    {
      "scene_number": 20,
      "plot_segment": "Izzie informs Gloria that Tony died during surgery. Gloria is devastated and asks Izzie to leave.",
      "start_time": "00:32:26,543",
      "end_time": "00:33:09,552",
      "start_seconds": 1946.543,
      "end_seconds": 1989.552
    },
    {
      "scene_number": 21,
      "plot_segment": "Meredith prepares Katie for surgery and jokes about making her look cool. Meredith asks Dr. Shepherd if she was chosen for the surgery because they slept together. He jokes that she was, then says she earned it. Meredith says she will not scrub in and suggests Cristina instead, but Dr. Shepherd insists Meredith earned the right to finish Katie's case.",
      "start_time": "00:33:36,963",
      "end_time": "00:34:12,102",
      "start_seconds": 2016.963,
      "end_seconds": 2052.102
    },
    {
      "scene_number": 22,
      "plot_segment": "George and Izzie talk about their career choices and parental expectations. George reflects on his parents' pride and his own doubts. Izzie shares that her mother doubted her ability to be a surgeon. They agree that being seen as a superhero sounds good and hope they will survive.",
      "start_time": "00:34:26,095",
      "end_time": "00:35:19,426",
      "start_seconds": 2066.095,
      "end_seconds": 2119.426
    },
    {
      "scene_number": 23,
      "plot_segment": "Dr. Burke questions Cristina about a patient with post-op fever. Cristina correctly names the five W's of post-op fever and suggests a pulmonary embolus. Dr. Burke tells the other intern to follow Cristina's instructions and removes him from the case. Dr. Burke recognizes Meredith as Ellis Grey's daughter and welcomes her to the game.",
      "start_time": "00:35:26,814",
      "end_time": "00:37:02,345",
      "start_seconds": 2126.814,
      "end_seconds": 2222.345
    },
    {
      "scene_number": 24,
      "plot_segment": "Dr. Shepherd prepares for surgery, telling the team it's a beautiful night to save lives. Meredith narrates about the difficulty of being a surgeon and the reasons to quit, but also the responsibility of holding lives in their hands. She reflects on the challenge and the love of the work.",
      "start_time": "00:37:02,345",
      "end_time": "00:38:45,611",
      "start_seconds": 2222.345,
      "end_seconds": 2325.611
    },
    {
      "scene_number": 25,
      "plot_segment": "After surgery, Meredith and Cristina avoid an emotional conversation. Cristina tells Meredith to get some sleep. They tease each other about their appearance.",
      "start_time": "00:39:05,589",
      "end_time": "00:39:25,932",
      "start_seconds": 2345.589,
      "end_seconds": 2365.932
    },
    {
      "scene_number": 26,
      "plot_segment": "George and Izzie talk about the thrill of surgery. George describes the high of being in the operating room and says he does not understand why anyone does drugs. They agree and part ways.",
      "start_time": "00:39:43,529",
      "end_time": "00:40:37,930",
      "start_seconds": 2383.529,
      "end_seconds": 2437.93
    },
    {
      "scene_number": 27,
      "plot_segment": "Meredith narrates that she made it through her first shift, as did the other interns. She reflects that she likes her colleagues and decides not to sell her mother's house, planning to get roommates and make it her home.",
      "start_time": "00:40:44,744",
      "end_time": "00:42:16,943",
      "start_seconds": 2444.744,
      "end_seconds": 2536.943
    },
    {
      "scene_number": 28,
      "plot_segment": "Meredith visits her mother, who does not recognize her and asks if Meredith is her doctor. Meredith says she is not her doctor but is a doctor. Meredith tells her mother her name and that she used to be a doctor and a surgeon. Her mother says she thinks she used to be a doctor.",
      "start_time": "00:41:23,579",
      "end_time": "00:42:12,189",
      "start_seconds": 2483.579,
      "end_seconds": 2532.189
    }
  ]
}