[
  {
    "title": "Medical Case: Katie Bryce's Seizures and Aneurysm",
    "arc_type": "Anthology Arc",
    "description": "A group of surgical interns face their first major medical challenge when Katie Bryce, a teenage gymnast, is admitted with unexplained seizures. The interns must work together to stabilize her, investigate the cause, and ultimately diagnose a rare aneurysm, leading to a life-saving surgery. The case tests their clinical skills, teamwork, and ability to perform under pressure.",
    "main_characters": "Meredith Grey; Cristina Yang; Katie Bryce",
    "interfering_episode_characters": "Dr. Derek Shepherd; Dr. Miranda Bailey; Dr. Preston Burke; George O'Malley; Alex Karev; Izzie Stevens; Katie's parents",
    "single_episode_progression_string": "Katie Bryce is admitted with seizures. The interns stabilize her and begin diagnostic tests. Cristina reports Katie's labs are clear. Meredith is assigned responsibility for Katie. Katie has additional seizures and her heart stops; the team revives her. Dr. Shepherd asks the interns to help diagnose Katie. Meredith and Cristina review Katie's case and suspect a rare aneurysm from a minor fall. Meredith and Cristina present their theory to Dr. Shepherd. An angiogram confirms the aneurysm. Meredith is chosen to scrub in on Katie's surgery. Dr. Shepherd operates on Katie."
  },
  {
    "title": "Medical Case: George O'Malley's First Appendectomy",
    "arc_type": "Anthology Arc",
    "description": "George O'Malley is given his first opportunity to perform surgery as a new intern. His experience in the operating room, including a critical mistake and public criticism, establishes his reputation among his peers and sets the tone for his early surgical career.",
    "main_characters": "George O'Malley; Dr. Preston Burke",
    "interfering_episode_characters": "Cristina Yang; Meredith Grey; Izzie Stevens; Alex Karev; Dr. Miranda Bailey; Other Interns",
    "single_episode_progression_string": "Dr. Burke selects George to perform an appendectomy. The other interns react with surprise and skepticism. George prepares for surgery while the interns watch from the gallery. George removes the appendix. George tears the cecum, causing internal bleeding. Dr. Burke intervenes and completes the surgery. Dr. Burke criticizes George in the operating room. The interns nickname George '007' after the incident. George realizes the nickname and confronts the others, who deny it."
  },
  {
    "title": "Medical Case: Tony's Failed Heart Bypass Surgery",
    "arc_type": "Anthology Arc",
    "description": "A patient named Tony is admitted for heart bypass surgery, but despite reassurances from his surgeon, he dies in the operating room due to extensive heart damage. The case highlights the unpredictable outcomes of surgery and the emotional impact of patient loss on both doctors and families.",
    "main_characters": "Tony; Gloria; Dr. Burke",
    "interfering_episode_characters": "Dr. Bailey; Meredith Grey; Cristina Yang",
    "single_episode_progression_string": "Tony is admitted for heart bypass surgery. Dr. Burke explains the procedure and reassures Gloria. Tony undergoes surgery. Dr. Burke discovers Tony's heart is too damaged to save. Tony dies during surgery. Dr. Burke informs Gloria of Tony's death. Gloria is devastated and asks Dr. Burke to leave."
  },
  {
    "title": "Medical Case: Post-Op Patient with Suspected Pulmonary Embolus",
    "arc_type": "Anthology Arc",
    "description": "A post-operative patient develops a fever, and Cristina Yang demonstrates her medical knowledge by correctly diagnosing a suspected pulmonary embolus, highlighting the pressures and expectations faced by surgical interns.",
    "main_characters": "Cristina Yang",
    "interfering_episode_characters": "Senior Doctor; Struggling Intern; Meredith Grey; Other Interns",
    "single_episode_progression_string": "A senior doctor questions an intern about a post-op patient with a fever. The intern cannot answer. Cristina lists the five W's of post-op fever. Cristina suggests pulmonary embolus as the diagnosis. The senior doctor instructs the team to follow Cristina's plan."
  },
  {
    "title": "Meredith Grey and Ellis Grey: Legacy, Identity, and Family Pressure",
    "arc_type": "Soap Arc",
    "description": "Meredith Grey struggles to define herself as a surgeon while living in the shadow of her mother, Ellis Grey, a legendary doctor suffering from memory loss. Meredith faces scrutiny from colleagues and internal pressure to prove her abilities apart from her family name, all while managing the emotional burden of her mother's illness.",
    "main_characters": "Meredith Grey; Ellis Grey",
    "interfering_episode_characters": "Cristina Yang; George O'Malley; Dr. Miranda Bailey; Dr. Richard Webber; Derek Shepherd; Other interns",
    "single_episode_progression_string": "Meredith reflects on her mother's reputation and her own insecurities. Interns gossip about Meredith being Ellis Grey's daughter. Colleagues reference Meredith's family legacy. Cristina accuses Meredith of benefiting from her mother's name. Meredith visits Ellis in the care facility. Ellis fails to recognize Meredith. Meredith reminds Ellis that she was a surgeon."
  },
  {
    "title": "Meredith and Derek: Secret Romance and Professional Boundaries",
    "arc_type": "Soap Arc",
    "description": "After a one-night stand, Meredith discovers her new attending is Derek Shepherd. Their secret relationship develops as they attempt to balance professionalism with growing attraction, facing workplace scrutiny, secrecy, and the ethical dilemmas of romance within the hospital hierarchy.",
    "main_characters": "Meredith Grey; Derek Shepherd",
    "interfering_episode_characters": "Cristina Yang",
    "single_episode_progression_string": "Meredith and Derek meet after a one-night stand without knowing they will work together. Meredith discovers Derek is her new attending at the hospital. Meredith and Derek agree to keep their relationship professional. Cristina learns Meredith slept with Derek. Meredith asks Derek if she was chosen for surgery because of their night together. Derek assures Meredith she earned the opportunity and encourages her."
  },
  {
    "title": "The Interns' First Year: Competition, Friendship, and Becoming Surgeons",
    "arc_type": "Genre-Specific Arc",
    "description": "A new class of surgical interns—Meredith, Cristina, George, Izzie, and Alex—navigate the pressures and rivalries of their first year at Seattle Grace Hospital. The arc follows their journey from uncertain beginners to capable surgeons, highlighting their evolving friendships, fierce competition, and the struggle to earn respect from superiors and each other.",
    "main_characters": "Meredith Grey; Cristina Yang; George O'Malley; Izzie Stevens; Alex Karev",
    "interfering_episode_characters": "Miranda Bailey; Derek Shepherd; Preston Burke; Katie Bryce; Richard Webber; Olivia Harper",
    "single_episode_progression_string": "Meredith, Cristina, George, Izzie, and Alex begin their surgical internships at Seattle Grace. Dr. Bailey introduces strict rules and warns about the high attrition rate. The interns receive their first patient assignments and tasks. George is selected to perform an appendectomy but makes a mistake and is mocked by the others. Meredith is given responsibility for Katie Bryce, a challenging patient. Cristina and Meredith work together to diagnose Katie's rare aneurysm. Meredith is chosen to scrub in on Katie's surgery, disappointing Cristina. The interns discuss their failures and doubts after their first shift. Meredith decides to stay in her mother's house and considers getting roommates."
  },
  {
    "title": "Hospital Hierarchy: Power Struggles, Mentorship, and Work-Life Sacrifice",
    "arc_type": "Genre-Specific Arc",
    "description": "The season explores the rigid hierarchy at Seattle Grace Hospital as new surgical interns contend with the authority of residents and attendings. Power struggles, mentorship, and competition shape their relationships and professional growth. The demands of surgical training force personal sacrifices and test the boundaries between work and personal life.",
    "main_characters": "Meredith Grey; Cristina Yang; George O'Malley; Dr. Miranda Bailey",
    "interfering_episode_characters": "Dr. Richard Webber; Dr. Preston Burke; Dr. Derek Shepherd; Alex Karev; Izzie Stevens; Katie Bryce",
    "single_episode_progression_string": "Dr. Webber addresses the interns and stresses the competitive nature of the program. Dr. Bailey introduces herself to the interns and enforces strict rules. Interns receive task assignments from Dr. Bailey. Dr. Burke selects George to perform the first surgery, demonstrating the hierarchy and competition. Dr. Bailey reprimands interns for mistakes and enforces discipline. Dr. Shepherd offers a surgical opportunity to the intern who solves Katie Bryce's case, increasing rivalry. Meredith and Cristina collaborate to solve the case, but only Meredith is chosen to scrub in, causing tension. Cristina demonstrates medical knowledge and earns recognition from Dr. Webber. Interns discuss the pressures and sacrifices required to survive in the hospital."
  }
]