[
  {
    "title": "Meredith and Derek's Professional and Personal Entanglement",
    "arc_type": "Soap Arc",
    "description": "Meredith Grey and Derek Shepherd navigate their complex relationship, which begins with a one-night stand and evolves as they work together at Seattle Grace Hospital, balancing personal feelings with professional responsibilities amidst hospital drama.",
    "main_characters": "Meredith Grey; Derek Shepherd",
    "interfering_episode_characters": "Cristina Yang; Miranda Bailey; Preston Burke; George O'Malley; Isobel Stevens; Alex Karev",
    "single_episode_progression_string": "Meredith wakes up next to Derek after a one-night stand. Meredith heads to her first day at the hospital. Meredith discovers Derek is her superior at work. Derek suggests continuing their personal relationship. Meredith assists Derek in a critical surgery, showcasing her skills."
  },
  {
    "title": "George O'Malley's Journey to Self-Confidence",
    "arc_type": "Soap Arc",
    "description": "George O'Malley struggles to build his confidence as a surgical intern, facing personal and professional setbacks while striving to meet expectations from peers and mentors.",
    "main_characters": "George O'Malley",
    "interfering_episode_characters": "Preston Burke; Meredith Grey; Cristina Yang; Izzie Stevens; Derek Shepherd",
    "single_episode_progression_string": "George is selected by Burke for an appendectomy. George accidentally breaks the purse strings during the procedure. Burke steps in to complete the surgery. George is nicknamed 007 by his peers. George expresses regret about his career choice to Meredith."
  },
  {
    "title": "Izzie Stevens' Fight for Respect",
    "arc_type": "Soap Arc",
    "description": "Izzie Stevens battles stereotypes and seeks acceptance from her colleagues, proving her competence as a former model turned surgical intern, while advocating for her patients and forming bonds with fellow interns.",
    "main_characters": "Izzie Stevens",
    "interfering_episode_characters": "Miranda Bailey; Alex Karev; Meredith Grey; Cristina Yang; George O'Malley",
    "single_episode_progression_string": "Izzie introduces herself to Bailey, who ignores her. Izzie is assigned to perform rectal exams. Izzie struggles with a central line and seeks Bailey's help. Izzie is dismissed by Alex Karev. Izzie expresses concern about a resident disliking her. Izzie tries to mediate between Meredith and Cristina."
  },
  {
    "title": "Meredith Grey's Legacy and Personal Struggles",
    "arc_type": "Soap Arc",
    "description": "Meredith Grey navigates the challenges of her medical career while dealing with the shadow of her mother, Ellis Grey, a legendary surgeon, and the emotional impact of Ellis's Alzheimer's disease.",
    "main_characters": "Meredith Grey",
    "interfering_episode_characters": "Derek Shepherd; Ellis Grey; Cristina Yang; Miranda Bailey; George O'Malley; Isobel Stevens; Preston Burke",
    "single_episode_progression_string": "Meredith starts her first day as an intern at Seattle Grace Hospital. She is reminded of her mother's legacy by her peers. Meredith discovers her mother, Ellis Grey, has Alzheimer's disease."
  },
  {
    "title": "Interns' Bond and Support Network",
    "arc_type": "Soap Arc",
    "description": "Meredith, Cristina, George, and Izzie form a strong support system, navigating the challenges of their surgical internships together, developing deep friendships, and supporting each other through personal and professional trials.",
    "main_characters": "Meredith Grey; Cristina Yang; George O'Malley; Isobel Stevens",
    "interfering_episode_characters": "Derek Shepherd; Miranda Bailey; Preston Burke",
    "single_episode_progression_string": "Meredith and Cristina connect over their shared resident. George introduces himself to Meredith and the group. The interns support each other during their first shift. Cristina and Meredith team up to solve Katie's medical mystery. Cristina feels betrayed when Meredith is chosen for surgery. Meredith and Cristina reconcile after the surgery. George shares his career doubts with Meredith."
  },
  {
    "title": "Meredith Grey's Professional Growth",
    "arc_type": "Genre-Specific Arc",
    "description": "Meredith Grey's journey as a surgical intern at Seattle Grace Hospital involves overcoming professional challenges, gaining medical expertise, and navigating personal relationships as she establishes herself in a demanding field.",
    "main_characters": "Meredith Grey",
    "interfering_episode_characters": "Derek Shepherd; Cristina Yang; Miranda Bailey; Preston Burke; George O'Malley; Isobel Stevens",
    "single_episode_progression_string": "Meredith wakes up after a one-night stand with Derek. She starts her first day as an intern at Seattle Grace Hospital. Meredith is assigned to Katie Bryce's case. She successfully diagnoses Katie's aneurysm. Meredith assists Derek in surgery, proving her skills."
  },
  {
    "title": "Cristina Yang's Ambition and Rivalry",
    "arc_type": "Genre-Specific Arc",
    "description": "Cristina Yang is determined to excel in her surgical internship, often leading to rivalry with her peers, particularly Meredith Grey, as she competes for prestigious surgeries and recognition throughout the season.",
    "main_characters": "Cristina Yang; Meredith Grey",
    "interfering_episode_characters": "Miranda Bailey; Derek Shepherd",
    "single_episode_progression_string": "Cristina connects with Meredith and learns they share the same resident. Cristina hints to Bailey about wanting a surgery. Cristina and Meredith work together to solve Katie's case. Cristina is upset when Meredith is chosen for the surgery. Cristina and Meredith reconcile after the surgery."
  },
  {
    "title": "Bailey's Mentorship and Leadership",
    "arc_type": "Genre-Specific Arc",
    "description": "Miranda Bailey, known for her tough but fair approach, mentors the new interns, guiding them through their first year with high standards and discipline, shaping their development as future surgeons.",
    "main_characters": "Miranda Bailey",
    "interfering_episode_characters": "Meredith Grey; Cristina Yang; George O'Malley; Isobel Stevens; Alex Karev",
    "single_episode_progression_string": "Bailey introduces herself to the interns and sets her expectations. She assigns tasks to each intern, testing their skills and resilience. Bailey intervenes when Izzie struggles with a central line. She observes the interns' performance and provides guidance."
  },
  {
    "title": "Navigating Power Dynamics at Seattle Grace",
    "arc_type": "Genre-Specific Arc",
    "description": "The interns and residents at Seattle Grace Hospital navigate complex power dynamics, dealing with attendings' expectations, peer competition, and the hierarchical structure of the hospital.",
    "main_characters": "Meredith Grey; George O'Malley; Cristina Yang",
    "interfering_episode_characters": "Miranda Bailey; Derek Shepherd; Preston Burke",
    "single_episode_progression_string": "Meredith and other interns meet their resident, Bailey, and learn about her reputation. Burke selects George for an appendectomy to test him. Meredith impresses the Chief with her medical knowledge. Derek chooses Meredith to assist in surgery after she diagnoses Katie's condition."
  },
  {
    "title": "Medical Case: Katie Bryce's Seizures",
    "arc_type": "Anthology Arc",
    "description": "The interns at Seattle Grace Hospital face their first major challenge as they diagnose and treat Katie Bryce, a patient with unexplained seizures. Meredith Grey demonstrates her medical acumen by reviving Katie and identifying the cause of her condition, leading to a successful surgery.",
    "main_characters": "Meredith Grey; Derek Shepherd",
    "interfering_episode_characters": "Cristina Yang; Miranda Bailey; Preston Burke; Alex Karev; George O'Malley; Isobel Stevens",
    "single_episode_progression_string": "Katie Bryce is brought to the hospital with seizures. Meredith revives Katie during a critical moment. Meredith and Cristina suspect an aneurysm. Derek Shepherd confirms the diagnosis. Meredith assists in the surgery to repair the aneurysm."
  },
  {
    "title": "Medical Case: Tony Savitch's Heart Surgery",
    "arc_type": "Anthology Arc",
    "description": "Preston Burke performs heart surgery on Tony Savitch, but the operation reveals the heart is too damaged, leading to Tony's death. This case highlights the emotional challenges faced by the interns, particularly George O'Malley, who struggles with the outcome and the promise made to Tony's wife, Gloria.",
    "main_characters": "George O'Malley; Preston Burke",
    "interfering_episode_characters": "Gloria Savitch",
    "single_episode_progression_string": "Burke explains the heart surgery to Tony and Gloria. Burke performs the surgery and discovers the heart is too damaged. Tony dies during the operation. Burke informs George of Tony's death. George struggles to tell Gloria about Tony's death."
  },
  {
    "title": "Medical Case: Patient 4B's Pulmonary Embolism",
    "arc_type": "Anthology Arc",
    "description": "Meredith Grey demonstrates her medical acumen by correctly diagnosing a pulmonary embolism in patient 4B. This highlights her ability to think critically under pressure in the competitive environment of Seattle Grace Hospital.",
    "main_characters": "Meredith Grey",
    "interfering_episode_characters": "Alex Karev; The Chief",
    "single_episode_progression_string": "The Chief asks Alex about post-operative fever causes. Alex fails to answer. Meredith correctly identifies the condition as a pulmonary embolism. The Chief instructs Alex to follow Meredith's advice."
  }
]