[
  "Meredith wakes up from the couch. Meredith wraps a towel around herself and starts picking up her clothes. Meredith throws a cushion at a man. Derek wakes up sleepily and hands Meredith her bra. Meredith feels embarrassed and tells Derek to get dressed. They chat while Derek dresses. Meredith mentions she will be late for her first day at a new job. Derek compliments Meredith's house. Meredith says it isn't hers; it was her mother's, and she is selling it. Derek apologizes, thinking Meredith's mother is dead. Meredith quickly clarifies her mother is not dead. Meredith says they don't need to pretend to care. Meredith goes to see Derek off but forgets his name. Derek introduces himself as Derek. Meredith introduces herself as Meredith. Meredith runs upstairs to shower.",
  "Later, Meredith leaves her car. Meredith joins the new interns at Seattle Grace Hospital. The Chief finishes the tour. The Chief says the next seven years will be the best and worst of the interns' lives. In the locker room, Meredith bonds with Cristina Yang. Meredith and Cristina find out they have the same resident, Miranda Bailey, also known as \"The Nazi.\" George O'Malley, another intern, overhears and introduces himself. George talks nervously and tells Meredith they met last night. George describes Meredith's outfit but stops when Meredith and Cristina think he's gay. The three interns, along with Isobel Stevens, are called to see Bailey. They approach Miranda Bailey and are surprised she's a woman and not a Nazi. Isobel thinks the nickname might be due to jealousy. Cristina dismisses this, but Isobel introduces herself as Isobel Stevens, saying everyone calls her Izzie. Miranda Bailey ignores the introduction, shows the interns their equipment, gives a short tour, and explains her rules.",
  "Miranda Bailey gets a page, and she and the interns rush to the roof. A helicopter lands on the roof with details about a patient, Katie Bryce, who is having seizures. In the hospital, the interns and nurses inject Katie Bryce, and Katie stops moving. Dr. Preston Burke enters and compares Katie Bryce to a wet fish on dry land. Dr. Preston Burke orders basic tests. George is assigned workups, Cristina is to do labs, and Meredith is assigned to Katie Bryce and to get her a CT scan. Miranda Bailey tells Izzie Stevens to perform rectal exams with a smile. Izzie Stevens does the rectal exams. Cristina Yang gets the test results and hints to Miranda Bailey about wanting a surgery. George O'Malley tries a simple procedure on a patient. Dr. Preston Burke gets frustrated and takes over. George O'Malley jokes that Dr. Preston Burke probably messed up a lot at first too. Dr. Preston Burke smiles tightly and tells George O'Malley he’ll have fun with him. George O'Malley gulps.",
  "Meredith Grey is lost in the hospital with Katie Bryce. Katie Bryce talks about missing a beauty pageant and how she was great except for falling during rhythmic gymnastics. Katie Bryce occasionally tells Meredith Grey she is lost.",
  "A group of interns sit in the canteen after 7 hours of their first shift. Izzie Stevens says a resident already hates her. George O'Malley sympathizes, saying attendings hate him too. Cristina Yang asks if anyone knew Meredith Grey's mother is Ellis Grey, a famous surgeon who won the Harper Avery Award twice. Meredith Grey quickly says Katie Bryce is unbearable.",
  "Dr. Preston Burke arrives at the table. Dr. Preston Burke says he can choose one intern to assist in a surgery. Dr. Preston Burke picks George O'Malley for an appendectomy and walks away. Miranda Bailey complains to Dr. Preston Burke about his decision. Miranda Bailey says George O'Malley barely made it into the program. Dr. Preston Burke insists that if he pressures George O'Malley, the rest will follow. Miranda Bailey tries to persuade Dr. Preston Burke otherwise.",
  "Katie Bryce's parents enter Katie Bryce's room. Katie Bryce's parents check if Katie Bryce feels okay. Katie Bryce's parents ask Meredith Grey if Katie Bryce might need surgery. Meredith Grey explains she isn't the doctor. Meredith Grey goes to Miranda Bailey to find Dr. Preston Burke. Dr. Preston Burke is off the case, so Miranda Bailey directs Meredith Grey to Dr. Derek Shepherd.",
  "Meredith Grey looks at Dr. Derek Shepherd as Dr. Derek Shepherd looks up. Meredith Grey quickly walks away because Dr. Derek Shepherd is her one-night stand, Derek. Derek catches up with Meredith Grey and pulls her into a stairwell. Meredith Grey decides to pretend it never happened. Derek says Meredith Grey took advantage of him. Meredith Grey starts to disagree. Derek quickly asks if Meredith Grey wants to take advantage of him next Friday. Meredith Grey smiles, says it's inappropriate, and walks away.",
  "George O'Malley is in the operating room. In the gallery, other interns bet against George O'Malley. Meredith Grey defends George O'Malley. George O'Malley starts the procedure well. At the end, George O'Malley pulls the purse strings too hard and breaks them. The patient starts to bleed. George O'Malley can't think of what to do. Dr. Preston Burke pushes George O'Malley aside and finishes the procedure. The interns nickname George O'Malley \"007\" in the gallery.",
  "Afterward, George O'Malley worries about the nickname. Meredith Grey is paged and leaves for Katie Bryce. George O'Malley says he should have gone into geriatrics. Cristina Yang says geriatrics is for losers who never have sex and live with their mothers. George O'Malley quietly tells Izzie Stevens he needs a new place.",
  "Meredith Grey runs through the hospital. Meredith Grey finds Katie Bryce, who faked a seizure and wants Meredith Grey to call someone. Annoyed, Meredith Grey leaves.",
  "Nurse Tyler asks Izzie Stevens what Izzie Stevens needs. Izzie Stevens says Mr. Jones has bad veins and needs antibiotics. Izzie Stevens should start a central line but doesn't know how. Nurse Tyler smiles and tells Izzie Stevens to wake up Miranda Bailey, the on-call resident. Izzie Stevens timidly walks over. Miranda Bailey asks if the patient is dying. When Izzie Stevens says no, Miranda Bailey goes back to sleep. After a few seconds, Miranda Bailey gets up grumpily and starts the central line. Miranda Bailey tells Izzie Stevens that next time Miranda Bailey is woken up, the patient better be near death.",
  "Alex Karev looks at a patient's chart. Alex Karev tells the nurse they have pneumonia and to start antibiotics. The nurse asks if Alex Karev is sure. Alex Karev sarcastically asks if the nurse went through four years of medical school. Alex Karev walks over to Meredith Grey. Alex Karev says he has Jeremy as his resident. Meredith Grey replies that the patient might not have pneumonia; it could be splinting. Alex Karev calls Meredith Grey a nurse. Meredith Grey feels insulted but answers her page. It's another 911 from Katie Bryce.",
  "Alex Karev asks another intern if Meredith Grey is single. George O'Malley says they are friends. Alex Karev tells George O'Malley to stop talking.",
  "Meredith Grey rushes to Katie Bryce's room. Meredith Grey is shocked to see Katie Bryce having severe seizures. The drugs didn't work. Meredith Grey tells a nurse to page Miranda Bailey and Derek Shepherd. The drugs still don't work, so Meredith Grey charges the paddles. On the fourth try, Katie Bryce's heartbeat and blood flow return to normal. Derek Shepherd arrives and tells Meredith Grey to leave. Miranda Bailey walks by and lectures Meredith Grey.",
  "Meredith Grey ignores Miranda Bailey and walks quickly out of the hospital. Cristina Yang follows Meredith Grey and sees Meredith Grey throw up against a tree. Meredith Grey returns to the hospital and tells Cristina Yang to keep it a secret.",
  "Inside the hospital, Derek Shepherd talks to Katie Bryce's parents. Derek Shepherd says it might not be a seizure disorder. Katie Bryce's parents want another doctor because they feel Derek Shepherd isn't trying hard enough.",
  "In another part of the hospital, Preston Burke explains a procedure to a patient named Tony. Preston Burke will put Tony on bypass, fix Tony's heart, and finish. Gloria, Tony's wife, asks if she should worry. Preston Burke assures Gloria he is skilled, but reminds Gloria that surgery has risks. Preston Burke leaves, but Gloria is still worried. George O'Malley comforts Gloria and promises Tony will do well in surgery.",
  "Cristina Yang waits for Derek Shepherd and sutures a banana. Cristina Yang calls George O'Malley \"007\" when George laughs but quickly apologizes, saying Cristina gets mean when tired. Derek Shepherd enters and says Katie Bryce is having seizures without a clear cause. Derek Shepherd calls Katie Bryce a ticking clock. The intern who discovers the cause will assist in the advanced surgery. All the interns take copies of Katie Bryce's chart.",
  "Alex Karev approaches a nurse. The nurse confirms she paged Alex Karev because the patient in 4B isn't responding to antibiotics. Alex Karev dismisses it, saying the patient is old, and asks not to be paged again.",
  "Meredith Grey walks away. Cristina Yang catches up and suggests they work together for a better chance at the surgery. Meredith Grey agrees but says Meredith doesn't want the surgery to avoid spending time with Derek Shepherd.",
  "In the hospital library, Cristina Yang and Meredith Grey try to diagnose Katie Bryce. Cristina Yang asks why Meredith Grey avoids Derek Shepherd. Meredith Grey admits she had sex with Derek Shepherd. They return to discussing Katie Bryce when Meredith Grey realizes something. Meredith Grey tells Cristina Yang to find Derek Shepherd.",
  "Cristina Yang and Meredith Grey confront Derek Shepherd and tell him they suspect Katie Bryce has an aneurysm, even without proof. Katie Bryce had a minor fall, but Katie Bryce's doctor didn't mention it. Derek Shepherd checks and is shocked to find Cristina Yang and Meredith Grey were right. Katie Bryce is bleeding into her brain. Derek Shepherd says Katie Bryce might have lived her whole life without it being a problem. Derek Shepherd congratulates Cristina Yang and Meredith Grey and chooses Meredith Grey to join him in the O.R. After Derek Shepherd leaves, Cristina Yang glares at Meredith Grey and storms off.",
  "Meanwhile, Preston Burke operates on Tony Savitch. After a while, Preston Burke goes to George O'Malley. George O'Malley is shocked at Preston Burke's speed. Preston Burke explains the heart was too damaged and Tony Savitch died. George O'Malley is upset and tells Preston Burke he promised Gloria that Tony Savitch would be okay. Preston Burke is angry. Preston Burke says only God can keep such a promise. Preston Burke tells George O'Malley to inform Gloria Savitch.",
  "Izzie Stevens and Cristina Yang are sitting privately. Izzie Stevens suggests it might not be Meredith Grey's fault. Cristina Yang interrupts Izzie Stevens. Meredith Grey arrives and tries to apologize. Cristina Yang says Meredith Grey can't seek forgiveness from her. Cristina Yang adds that at least Meredith Grey didn't get into med school because of her mother or good surgeries by sleeping with her boss. Meredith Grey leaves upset.",
  "George O'Malley is in the waiting area. George O'Malley tries to tell Gloria Savitch that Tony Savitch died. George O'Malley apologizes, but Gloria Savitch asks him to leave and collapses into a chair.",
  "Derek Shepherd is shaving Katie Bryce's head. Meredith Grey says she doesn't want to assist, but Derek Shepherd insists. Derek Shepherd explains his decision wasn't because they had sex, but because Meredith Grey was Katie Bryce's doctor and helped save her life on her first day.",
  "Meredith Grey and George O'Malley sit on a window ledge outside. Meredith Grey and George O'Malley wish they had chosen different careers. George O'Malley mentions his parents brag about him being a surgeon. Meredith Grey shares that Ellis Grey tried to discourage her from medical school, doubting Meredith Grey's abilities, so George O'Malley shouldn't feel bad.",
  "Richard Webber asks Alex Karev some questions. Alex Karev doesn't reply. Richard Webber asks if anyone knows the common causes of post-op fever. Nobody answers. Meredith Grey answers. Richard Webber asks Meredith Grey what she thinks is wrong with the patient. Meredith Grey says patient 4B might have a pulmonary embolism. Richard Webber asks how Meredith Grey would diagnose it. Meredith Grey answers correctly. Richard Webber tells Alex Karev to follow Meredith Grey's advice and removes Alex Karev from the case. As Richard Webber walks away, he tells Meredith Grey he recognizes her and she looks like Ellis Grey.",
  "Meredith Grey goes to the O.R. where Katie Bryce is being prepped. Meredith Grey watches with admiration. Derek Shepherd tells Meredith Grey to take a look. Meredith Grey looks and is amazed. Meredith Grey realizes it's more than a game. Meredith Grey and Cristina Yang have lives in their hands.",
  "Outside the operating room, after the surgery, Cristina Yang compliments Meredith Grey. A few minutes later, Meredith Grey and Cristina Yang make up. Cristina Yang leaves, and Derek Shepherd arrives. Meredith Grey tells Derek Shepherd the surgery was amazing and more exciting than she expected. Meredith Grey and Derek Shepherd share a moment, and Derek Shepherd says he'll see Meredith Grey around, then leaves.",
  "Meredith Grey later leaves the hospital with Cristina Yang, Izzie Stevens, and George O'Malley.",
  "Later, Meredith Grey walks up the steps of a house in the rain. Meredith Grey tells Ellis Grey she won't sell her house and plans to get roommates. Meredith Grey mentions her fellow interns are great. Ellis Grey asks if Meredith Grey is her doctor. Meredith Grey says no, but she is a doctor. Ellis Grey asks Meredith Grey's name, and Meredith Grey reminds her. Ellis Grey says she thinks she used to be a doctor. Meredith Grey smiles and confirms Ellis Grey was a doctor. Ellis Grey has Alzheimer's disease."
]