[
  {
    "title": "Medical Case: Katie Bryce's Seizures",
    "arc_type": "Anthology Arc",
    "description": "The interns at Seattle Grace Hospital face their first major challenge as they work to diagnose and treat Katie Bryce, a patient with severe seizures. Meredith Grey demonstrates her medical prowess by reviving Katie and identifying a critical brain aneurysm, marking the beginning of her journey as a surgeon.",
    "main_characters": "Meredith Grey; Derek Shepherd",
    "interfering_episode_characters": "Cristina Yang; Miranda Bailey; Preston Burke; Alex Karev; George O'Malley; Isobel Stevens",
    "single_episode_progression_string": "Katie Bryce is brought to the hospital with severe seizures. Meredith revives Katie during a critical moment. Meredith and Cristina deduce that Katie might have an aneurysm. Derek Shepherd confirms the aneurysm diagnosis. Meredith assists Derek in the surgery to repair Katie's aneurysm."
  },
  {
    "title": "Medical Case: Tony Savitch's Heart Surgery",
    "arc_type": "Anthology Arc",
    "description": "The arc follows the emotional and professional challenges faced by the interns as they navigate high-stakes medical cases, exemplified by the heart surgery on Tony Savitch, which ends tragically.",
    "main_characters": "George O'Malley; Preston Burke",
    "interfering_episode_characters": "Gloria Savitch",
    "single_episode_progression_string": "Dr. Burke selects George O'Malley to assist in an appendectomy. Burke reassures Gloria Savitch about Tony's heart surgery. Tony dies during the procedure. George is tasked with informing Gloria about Tony's death."
  },
  {
    "title": "Meredith Grey's Journey: Balancing Legacy and Love",
    "arc_type": "Soap Arc",
    "description": "Meredith Grey navigates her first year as a surgical intern at Seattle Grace Hospital, balancing the challenges of her new job with personal relationships, including a complicated dynamic with Dr. Derek Shepherd. Her journey is marked by her struggle to step out of her mother's shadow, renowned surgeon Ellis Grey, and prove herself in the medical field while dealing with her mother's Alzheimer's diagnosis.",
    "main_characters": "Meredith Grey; Derek Shepherd",
    "interfering_episode_characters": "Cristina Yang; George O'Malley; Ellis Grey; Miranda Bailey; Preston Burke; Alex Karev; Isobel Stevens",
    "single_episode_progression_string": "Meredith wakes up after a one-night stand with Derek. She discovers Derek is her attending at the hospital. Meredith impresses Derek by diagnosing Katie's condition. Derek chooses Meredith to assist in surgery. Meredith decides to keep her mother's house and find roommates."
  },
  {
    "title": "Intern Dynamics: Friendship and Rivalry",
    "arc_type": "Soap Arc",
    "description": "The group of new interns, including Meredith Grey, Cristina Yang, George O'Malley, and Isobel Stevens, form bonds and navigate the competitive and high-pressure environment of Seattle Grace Hospital. Their friendships are tested by professional rivalries, personal secrets, and the demands of their medical training, leading to growth and conflict.",
    "main_characters": "Meredith Grey; Cristina Yang; George O'Malley; Isobel Stevens",
    "interfering_episode_characters": "Miranda Bailey; Preston Burke; Derek Shepherd",
    "single_episode_progression_string": "Meredith and Cristina bond over sharing the same resident. George introduces himself awkwardly, hinting at a past encounter with Meredith. Cristina discovers Meredith's mother is Ellis Grey, causing tension. Burke selects George for surgery, leading to his nickname '007'. Cristina and Meredith collaborate to diagnose Katie Bryce. Meredith is chosen for surgery, straining their friendship. Cristina and Meredith reconcile after the surgery."
  },
  {
    "title": "George O'Malley's Journey of Self-Discovery",
    "arc_type": "Soap Arc",
    "description": "George O'Malley navigates the challenges of being a surgical intern, facing self-doubt and professional setbacks while striving to prove himself, ultimately leading to personal growth and resilience.",
    "main_characters": "George O'Malley",
    "interfering_episode_characters": "Preston Burke; Meredith Grey; Cristina Yang; Izzie Stevens; Gloria Savitch",
    "single_episode_progression_string": "George introduces himself nervously to Meredith and the other interns. George is selected by Burke for an appendectomy. George struggles during the procedure and earns the nickname 007. George expresses regret about his career choice. George is tasked with informing Gloria about her husband's death."
  },
  {
    "title": "Cristina Yang's Ambition and Professional Rivalry",
    "arc_type": "Genre-Specific Arc",
    "description": "Cristina Yang is driven by her ambition to excel in surgery, often clashing with her fellow interns and superiors. Her competitive nature leads to both professional success and personal conflicts, particularly with Meredith Grey, as they vie for opportunities and recognition throughout their residency.",
    "main_characters": "Cristina Yang; Meredith Grey",
    "interfering_episode_characters": "Miranda Bailey; Derek Shepherd",
    "single_episode_progression_string": "Cristina connects with Meredith and learns they share the same resident. Cristina expresses her desire for surgery to Bailey. Cristina and Meredith work together to diagnose Katie Bryce. Cristina is upset when Meredith is chosen for surgery. Cristina reconciles with Meredith after the surgery."
  },
  {
    "title": "Dr. Derek Shepherd: Balancing Leadership and Love",
    "arc_type": "Genre-Specific Arc",
    "description": "Dr. Derek Shepherd, a skilled neurosurgeon, navigates the complexities of his professional responsibilities at Seattle Grace Hospital while dealing with personal entanglements, including his unexpected connection with intern Meredith Grey. His leadership and expertise are tested as he mentors the new interns and faces challenges in his personal life.",
    "main_characters": "Derek Shepherd; Meredith Grey",
    "interfering_episode_characters": "Cristina Yang; Miranda Bailey; Preston Burke",
    "single_episode_progression_string": "Derek wakes up at Meredith's house after a one-night stand. He meets Meredith again at the hospital as her attending. Derek offers Meredith a chance to assist in surgery after she identifies Katie's condition. Derek reassures Meredith that his decision is based on her medical skills, not their personal connection."
  },
  {
    "title": "Bailey's Mentorship: Shaping Future Surgeons",
    "arc_type": "Genre-Specific Arc",
    "description": "Dr. Miranda Bailey, known as 'The Nazi,' establishes her authority as a resident overseeing the new interns. Her strict yet effective mentorship style challenges the interns to rise to the demands of their roles, shaping their development as future surgeons.",
    "main_characters": "Miranda Bailey",
    "interfering_episode_characters": "Meredith Grey; Cristina Yang; George O'Malley; Isobel Stevens; Preston Burke",
    "single_episode_progression_string": "Bailey introduces herself to the interns and sets strict rules. She assigns tasks to each intern, testing their skills and resilience. Bailey intervenes when Izzie struggles with a central line. Bailey observes and critiques George's performance in surgery."
  }
]