{
  "scenes": [
    {
      "scene_number": 1,
      "plot_segment": "A character narrates about 'the game', stating that people either have what it takes to play or they don't. The narrator reveals their mother was one of the greats, but feels personally unprepared.",
      "start_time": "00:00:03,952",
      "end_time": "00:00:17,605",
      "start_seconds": 3.952,
      "end_seconds": 17.605
    },
    {
      "scene_number": 2,
      "plot_segment": "In a house, two people interact after what appears to be a one-night stand. One character expresses embarrassment and insists the other leave because they are late for their first day of work. The two exchange names: Derek and Meredith. Meredith clarifies she recently moved from Boston, is staying in her mother's house, and is selling it. Derek leaves after their awkward conversation.",
      "start_time": "00:00:37,259",
      "end_time": "00:01:45,599",
      "start_seconds": 37.259,
      "end_seconds": 105.59899999999999
    },
    {
      "scene_number": 3,
      "plot_segment": "A group of new surgical interns, including Meredith, gather at a hospital. An unidentified person gives an orientation speech, explaining the challenges of the surgical residency and warning that not all will make it. The speaker tells them to look at their competition and describes the pressures ahead.",
      "start_time": "00:02:06,075",
      "end_time": "00:02:52,164",
      "start_seconds": 126.075,
      "end_seconds": 172.164
    },
    {
      "scene_number": 4,
      "plot_segment": "In a hospital hallway, several interns, including Cristina, George O'Malley, Meredith, and Izzie Stevens, discuss their assignments. They talk about being assigned to a resident called 'the Nazi', speculate about her, and introduce themselves. Izzie clarifies her nickname is 'Izzie'.",
      "start_time": "00:03:03,453",
      "end_time": "00:04:18,995",
      "start_seconds": 183.453,
      "end_seconds": 258.995
    },
    {
      "scene_number": 5,
      "plot_segment": "A resident, later identified as Dr. Bailey, addresses the group of interns (including George, Cristina, Meredith, and Izzie). She lays out five strict rules for their conduct, emphasizing her authority and the demands of the job. She instructs them to follow her and not to wake her unless a patient is dying.",
      "start_time": "00:04:20,844",
      "end_time": "00:05:15,135",
      "start_seconds": 260.844,
      "end_seconds": 315.135
    },
    {
      "scene_number": 6,
      "plot_segment": "In the emergency room, a team including Dr. Bailey, Dr. Burke, and the interns receive a patient: Katie Bryce, a 15-year-old girl with seizures. Dr. Bailey assigns tasks to the interns: Cristina on labs, George on patient work-ups, Meredith to take Katie for a CT scan, and Izzie to perform rectal exams.",
      "start_time": "00:05:30,382",
      "end_time": "00:06:22,317",
      "start_seconds": 330.382,
      "end_seconds": 382.317
    },
    {
      "scene_number": 7,
      "plot_segment": "Cristina reports to Dr. Bailey that Katie Bryce's labs are clear and wonders about a rumored opportunity for the best intern to perform a procedure. Dr. Bailey dismisses her. In another area, a patient jokes about not being able to eat bacon after surgery, and an intern reassures him. Meredith checks on Katie, who is upset about missing a beauty pageant. George awkwardly prepares to perform a rectal exam on a patient.",
      "start_time": "00:06:38,378",
      "end_time": "00:08:26,841",
      "start_seconds": 398.378,
      "end_seconds": 506.841
    },
    {
      "scene_number": 8,
      "plot_segment": "In the hospital cafeteria, George, Cristina, and Izzie discuss their difficult first shift. They gossip about Meredith's mother, Ellis Grey, and her reputation. Meredith arrives, and the group discusses their cases. An attending announces that George O'Malley has been chosen to perform an appendectomy, surprising the group.",
      "start_time": "00:08:34,747",
      "end_time": "00:09:12,640",
      "start_seconds": 514.747,
      "end_seconds": 552.64
    },
    {
      "scene_number": 9,
      "plot_segment": "Two doctors discuss George's selection for surgery, with one expressing skepticism about his abilities. Katie Bryce's parents ask an intern about her condition, but the intern defers to Dr. Shepherd, who is now in charge of Katie's case.",
      "start_time": "00:09:14,157",
      "end_time": "00:11:16,685",
      "start_seconds": 554.157,
      "end_seconds": 676.685
    },
    {
      "scene_number": 10,
      "plot_segment": "Meredith approaches Dr. Shepherd, who is revealed to be Derek from the earlier scene. They awkwardly discuss their previous night together and agree to keep it professional. Meredith insists their personal relationship cannot continue.",
      "start_time": "00:11:15,404",
      "end_time": "00:12:14,399",
      "start_seconds": 675.404,
      "end_seconds": 734.399
    },
    {
      "scene_number": 11,
      "plot_segment": "In an observation area, several interns watch as George prepares for his appendectomy. They place bets on his performance. In the operating room, George begins the surgery under Dr. Burke's supervision. He successfully removes the appendix but then makes a mistake, causing a complication. Dr. Burke takes over, and George is removed from the surgery. Other interns nickname him '007' (license to kill).",
      "start_time": "00:12:19,408",
      "end_time": "00:15:01,031",
      "start_seconds": 739.408,
      "end_seconds": 901.031
    },
    {
      "scene_number": 12,
      "plot_segment": "George is upset about being called '007' by the other interns. Cristina and Izzie try to reassure him, but he remains insecure. Suddenly, there is an emergency with Katie Bryce, and Meredith rushes to respond.",
      "start_time": "00:15:11,173",
      "end_time": "00:19:51,388",
      "start_seconds": 911.173,
      "end_seconds": 1191.388
    },
    {
      "scene_number": 13,
      "plot_segment": "Meredith finds Katie Bryce having another seizure. Nurses and other staff urge her to make decisions, but Meredith hesitates. The team attempts to treat Katie, but her heart stops. They perform resuscitation and eventually restore her heartbeat. Dr. Bailey scolds Meredith for not paging her immediately.",
      "start_time": "00:19:50,084",
      "end_time": "00:22:20,674",
      "start_seconds": 1190.084,
      "end_seconds": 1340.674
    },
    {
      "scene_number": 14,
      "plot_segment": "Dr. Shepherd and Dr. Bailey discuss Katie's unclear diagnosis with her parents. Katie's father becomes angry at the lack of answers and demands another doctor.",
      "start_time": "00:22:31,873",
      "end_time": "00:23:05,792",
      "start_seconds": 1351.873,
      "end_seconds": 1385.792
    },
    {
      "scene_number": 15,
      "plot_segment": "Elsewhere in the hospital, Dr. Burke discusses an upcoming bypass surgery with a patient named Mr. Savitch and his wife, Gloria. An intern reassures Gloria that her husband will be fine, despite the risks.",
      "start_time": "00:23:09,805",
      "end_time": "00:23:53,443",
      "start_seconds": 1389.805,
      "end_seconds": 1433.443
    },
    {
      "scene_number": 16,
      "plot_segment": "Cristina practices suturing on a banana. She and George discuss their difficult day. Dr. Shepherd gathers the interns and asks for their help in diagnosing Katie Bryce, offering the chance to assist in surgery as a reward. Dr. Bailey distributes Katie's chart to the interns.",
      "start_time": "00:23:54,421",
      "end_time": "00:18:36,565",
      "start_seconds": 1434.421,
      "end_seconds": 1116.565
    },
    {
      "scene_number": 17,
      "plot_segment": "Izzie pages Alex Karev about a patient, 4-B, who is still short of breath. Alex dismisses her concerns, preferring to focus on a more exciting case. Alex makes a sexist remark, mistaking Izzie for a nurse, which she confronts him about.",
      "start_time": "00:18:34,405",
      "end_time": "00:25:43,342",
      "start_seconds": 1114.405,
      "end_seconds": 1543.342
    },
    {
      "scene_number": 18,
      "plot_segment": "Cristina and Meredith agree to work together to solve Katie's case, with Meredith declining the chance to assist in surgery if they succeed. Cristina presses Meredith about her reluctance to work with Dr. Shepherd, and Meredith confesses that she slept with him. They continue to brainstorm possible diagnoses for Katie.",
      "start_time": "00:25:41,450",
      "end_time": "00:27:32,948",
      "start_seconds": 1541.45,
      "end_seconds": 1652.948
    },
    {
      "scene_number": 19,
      "plot_segment": "Cristina and Meredith realize that Katie's minor fall during rhythmic gymnastics practice could have caused a rare aneurysm. They present their theory to Dr. Shepherd, who orders an angiogram. The test reveals a subarachnoid hemorrhage, confirming their diagnosis.",
      "start_time": "00:27:33,900",
      "end_time": "00:29:32,536",
      "start_seconds": 1653.9,
      "end_seconds": 1772.536
    },
    {
      "scene_number": 20,
      "plot_segment": "Dr. Shepherd praises Meredith and Cristina for their work but selects Meredith to scrub in for Katie's surgery. Cristina is disappointed.",
      "start_time": "00:29:31,057",
      "end_time": "00:29:51,481",
      "start_seconds": 1771.057,
      "end_seconds": 1791.481
    },
    {
      "scene_number": 21,
      "plot_segment": "Dr. Burke informs an intern that Mr. Savitch's heart was too damaged for bypass surgery and that he died. The intern is distraught, having promised Gloria Savitch that her husband would be fine. Dr. Burke admonishes the intern for making promises to patients' families.",
      "start_time": "00:30:54,070",
      "end_time": "00:31:37,207",
      "start_seconds": 1854.07,
      "end_seconds": 1897.207
    },
    {
      "scene_number": 22,
      "plot_segment": "Cristina confronts Meredith about being chosen for the surgery, accusing her of benefiting from her relationship with Dr. Shepherd and her famous mother. Meredith tries to apologize, but Cristina rebuffs her.",
      "start_time": "00:31:49,340",
      "end_time": "00:32:24,535",
      "start_seconds": 1909.34,
      "end_seconds": 1944.535
    },
    {
      "scene_number": 23,
      "plot_segment": "An intern informs Gloria Savitch that her husband, Tony, died during surgery. Gloria is devastated and asks the intern to leave.",
      "start_time": "00:32:37,193",
      "end_time": "00:33:20,202",
      "start_seconds": 1957.193,
      "end_seconds": 2000.202
    },
    {
      "scene_number": 24,
      "plot_segment": "Izzie prepares Katie Bryce for surgery, trying to make her feel better about losing her hair. Meredith asks Dr. Shepherd if she was chosen for the surgery because of their personal relationship. He jokes but then assures her she earned the opportunity.",
      "start_time": "00:33:50,263",
      "end_time": "00:34:25,502",
      "start_seconds": 2030.263,
      "end_seconds": 2065.502
    },
    {
      "scene_number": 25,
      "plot_segment": "George and another intern reflect on their career choices and the pressures of being a surgeon. George reveals his parents are proud of him, while the other intern shares that her mother doubted her abilities.",
      "start_time": "00:34:39,495",
      "end_time": "00:35:32,826",
      "start_seconds": 2079.495,
      "end_seconds": 2132.826
    },
    {
      "scene_number": 26,
      "plot_segment": "Dr. Burke quizzes Izzie about a patient with post-op fever. Izzie correctly identifies the five W's of post-op fever and suggests a pulmonary embolus as the diagnosis. Dr. Burke instructs her to follow up and notes her resemblance to her mother, welcoming her to the profession.",
      "start_time": "00:35:40,214",
      "end_time": "00:36:57,604",
      "start_seconds": 2140.214,
      "end_seconds": 2217.604
    },
    {
      "scene_number": 27,
      "plot_segment": "Dr. Shepherd prepares for Katie Bryce's surgery, telling the team it's a beautiful night to save lives. Meredith narrates about the challenges and responsibilities of being a surgeon.",
      "start_time": "00:37:15,745",
      "end_time": "00:39:09,527",
      "start_seconds": 2235.745,
      "end_seconds": 2349.527
    },
    {
      "scene_number": 28,
      "plot_segment": "After the surgery, Meredith and Cristina have a brief, non-emotional exchange, agreeing not to have a dramatic moment. They joke about each other's appearance and suggest getting some sleep.",
      "start_time": "00:39:18,989",
      "end_time": "00:39:39,332",
      "start_seconds": 2358.989,
      "end_seconds": 2379.332
    },
    {
      "scene_number": 29,
      "plot_segment": "George and another intern express excitement after participating in surgery, describing the experience as exhilarating and better than drugs. They part ways, satisfied with their work.",
      "start_time": "00:39:56,929",
      "end_time": "00:40:51,330",
      "start_seconds": 2396.929,
      "end_seconds": 2451.33
    },
    {
      "scene_number": 30,
      "plot_segment": "Meredith narrates about surviving the first shift. She decides not to sell her mother's house and plans to get roommates. She visits her mother, who is in a care facility and does not recognize her. Meredith reminds her mother that she was a surgeon.",
      "start_time": "00:40:56,645",
      "end_time": "00:42:25,589",
      "start_seconds": 2456.645,
      "end_seconds": 2545.589
    }
  ]
}