{
  "scenes": [
    {
      "scene_number": 1,
      "plot_segment": "A speaker reflects on 'the game,' stating that some people have what it takes to play, while others do not. The speaker mentions that their mother was one of the greats, but feels inadequate in comparison."
    },
    {
      "scene_number": 2,
      "plot_segment": "In a house, a woman and a man wake up together. The woman finds the situation humiliating and tells the man he has to leave because she is late for her first day of work. They discuss the house, which belonged to her mother and is being sold. The woman clarifies her mother is not dead. They agree not to exchange personal details. She goes upstairs to shower, telling him to be gone when she returns. Before parting, they confirm each other's names: Derek and Meredith."
    },
    {
      "scene_number": 3,
      "plot_segment": "At a hospital, a senior doctor addresses a group of new interns, telling them they are now doctors and warning them about the challenges ahead. He explains the competitive nature of the program and the high likelihood of failure. The speaker internally repeats that they feel 'screwed.'"
    },
    {
      "scene_number": 4,
      "plot_segment": "The interns gather and discuss the gender imbalance and rumors about one intern being a model. Cristina, George O'Malley, and others talk about being assigned to a resident called 'the Nazi.' George introduces himself to Meredith, referencing a previous meeting. The group discusses Ellis Grey's reputation as a famous surgeon. They locate Dr. Bailey, who is revealed to be 'the Nazi.'"
    },
    {
      "scene_number": 5,
      "plot_segment": "Dr. Bailey introduces herself and lays out five strict rules for the interns, emphasizing discipline, hierarchy, and not waking her unless a patient is dying. She assigns tasks: Cristina to labs, George to patient work-ups, Meredith to take Katie for a CT scan, making her responsible for the patient. Another intern is assigned rectal exams."
    },
    {
      "scene_number": 6,
      "plot_segment": "A 15-year-old patient, Katie Bryce, is brought in with seizures. The team works to stabilize her. Dr. Burke instructs Dr. Bailey to order a full battery of tests. Cristina reports that Katie's labs are clear and mentions a rumor about the best intern getting to perform a procedure. Dr. Bailey dismisses her."
    },
    {
      "scene_number": 7,
      "plot_segment": "Izzie reassures a patient about upcoming bypass surgery. Meredith, lost in the hospital, checks on Katie, who is upset about missing her beauty pageant. They discuss the pageant and Katie's talent, rhythmic gymnastics. Katie is sarcastic and difficult."
    },
    {
      "scene_number": 8,
      "plot_segment": "The interns gather in the break room. Alex complains about performing seventeen rectal exams and feeling disliked by Dr. Bailey. The group discusses Meredith's famous mother and the pressure of living up to her reputation. Meredith complains about Katie. Dr. Burke announces that George will perform the first surgery, an appendectomy. The other interns are skeptical about George's abilities."
    },
    {
      "scene_number": 9,
      "plot_segment": "Dr. Burke and Dr. Webber discuss George, noting that he barely made it into the program and is being set up to fail as an example. Meredith checks on Katie and her parents, who have questions about her condition. Meredith defers to the attending, Dr. Shepherd, who is revealed to be Derek from earlier. Meredith and Derek awkwardly discuss their prior encounter and agree to keep it secret. Meredith insists their personal history cannot affect their professional relationship. Derek jokes and asks her out again, but she refuses."
    },
    {
      "scene_number": 10,
      "plot_segment": "The interns watch as George prepares to perform the appendectomy under Dr. Burke's supervision. They bet on whether he will succeed or fail. George begins the surgery and initially performs well, but then makes a mistake, causing complications. Dr. Burke takes over and calls George a 'pansy-ass idiot.' The other interns nickname George '007,' meaning 'license to kill.'"
    },
    {
      "scene_number": 11,
      "plot_segment": "George is upset about the nickname '007.' His peers deny it, but he knows it is spreading. Cristina receives a page about Katie and leaves. George laments his failure and considers switching specialties. Meredith expresses frustration about living with her mother."
    },
    {
      "scene_number": 12,
      "plot_segment": "Meredith is paged to Katie's room, where Katie has faked an emergency out of boredom. Meredith scolds her and tells her to sleep. Cristina asks Izzie for help starting a central line on a patient. They consider waking Dr. Bailey, but when they do, Dr. Bailey is angry and warns them not to wake her again unless the patient is near death. Cristina is given samples to take to the lab."
    },
    {
      "scene_number": 13,
      "plot_segment": "Alex discusses a post-op patient with possible pneumonia and insists on antibiotics despite a nurse's questions. Alex introduces himself and makes a sexist remark, mistaking Izzie for a nurse. George awkwardly tries to befriend Meredith. Suddenly, Katie begins having multiple grand mal seizures. The team tries various medications, but nothing works. Meredith is pressured to make decisions. Katie's heart stops, and the team performs a code blue. After several attempts, they revive her. Dr. Bailey scolds Meredith for not paging her immediately."
    },
    {
      "scene_number": 14,
      "plot_segment": "Katie's parents confront Dr. Shepherd about the lack of a diagnosis, and Mr. Bryce demands a more competent doctor. Meanwhile, Mr. Savitch is prepared for bypass surgery. His wife, Gloria Savitch, is reassured by Izzie, who promises a good outcome. Dr. Burke admonishes Izzie for making promises to patients' families."
    },
    {
      "scene_number": 15,
      "plot_segment": "Dr. Shepherd gathers the interns and asks for their help diagnosing Katie, offering the incentive of assisting in surgery to whoever finds the answer. Dr. Bailey distributes Katie's chart, and the interns begin working on the case. Cristina and Meredith agree to work together, with Meredith declining the opportunity to assist in surgery if they succeed. They review possible diagnoses and eliminate several options. Meredith confides in Cristina that she had slept with Dr. Shepherd. They continue brainstorming but run out of ideas."
    },
    {
      "scene_number": 16,
      "plot_segment": "Meredith realizes that Katie's minor fall during rhythmic gymnastics practice could have caused a rare aneurysm. Meredith and Cristina present their theory to Dr. Shepherd, who is initially skeptical. Meredith explains that Katie's minor fall could have ruptured an undetected aneurysm. They perform an angiogram and discover a small subarachnoid hemorrhage. Dr. Shepherd praises their work and tells Meredith she will assist in the surgery."
    },
    {
      "scene_number": 17,
      "plot_segment": "Dr. Burke informs Izzie that Mr. Savitch's heart was too damaged for bypass surgery and he died. Izzie is upset, having promised the patient's wife a good outcome. Dr. Burke reprimands her for making promises and instructs her to deliver the bad news. Izzie delivers the news to Gloria Savitch, who is devastated and asks Izzie to leave."
    },
    {
      "scene_number": 18,
      "plot_segment": "Izzie helps Katie prepare for surgery, fulfilling a promise to make her look 'cool.' Meredith asks Dr. Shepherd if she was chosen for the surgery because they had slept together. He jokes, then assures her she earned it by helping save Katie's life. He encourages her not to let their personal history interfere with her career."
    },
    {
      "scene_number": 19,
      "plot_segment": "George and Izzie reflect on their career choices and the expectations of their families. George feels inadequate, while Izzie recalls being discouraged by her mother. They agree that being seen as a 'superhero' is not so bad and wonder if they will survive the internship."
    },
    {
      "scene_number": 20,
      "plot_segment": "Dr. Webber questions Alex about a post-op patient with shortness of breath. Alex is unable to answer, but Meredith correctly identifies the five common causes of post-op fever and suggests the patient might have a pulmonary embolus. Dr. Webber instructs Alex to follow Meredith's recommendations and recognizes her as Ellis Grey's daughter, welcoming her to the profession."
    },
    {
      "scene_number": 21,
      "plot_segment": "Dr. Shepherd prepares for Katie's surgery, telling the team it is a beautiful night to save lives. Meredith reflects on the challenges of being a surgeon and the reasons to quit, but admits to loving the work despite its difficulties."
    },
    {
      "scene_number": 22,
      "plot_segment": "After surgery, Meredith and Dr. Shepherd agree not to have an emotional conversation. Meredith and Cristina exchange banter about their appearance and exhaustion. George expresses excitement after assisting in surgery, describing the experience as a high. He and Izzie agree that surgery is exhilarating."
    },
    {
      "scene_number": 23,
      "plot_segment": "Meredith reflects on surviving the first shift along with the other interns. She decides to keep her mother's house and considers getting roommates. Finally, Meredith visits her mother, Ellis Grey, who is in a care facility and does not recognize her. Meredith gently reminds her mother that she was a surgeon."
    }
  ]
}