[
  {
    "title": "Meredith and Derek's Complicated Romance",
    "arc_type": "Soap Arc",
    "description": "Meredith and Derek's relationship begins with a one-night stand and evolves into a complicated romance, affecting their professional lives and friendships.",
    "episodic": false,
    "main_characters": "Meredith Grey; Derek Shepherd",
    "interfering_episode_characters": "Miranda Bailey; George O'Malley; Cristina Yang",
    "single_episode_progression_string": "Meredith wakes up after a one-night stand with Derek and later discovers he is her boss, creating a complex dynamic as they navigate their personal and professional boundaries. Derek jokes about their encounter, and Meredith is chosen to assist him in surgery, causing tension with Cristina."
  },
  {
    "title": "Interns' Professional Challenges at Seattle Grace",
    "arc_type": "Genre-Specific Arc",
    "description": "The interns face various medical and ethical challenges, learning the harsh realities of being surgeons and navigating complex cases.",
    "episodic": false,
    "main_characters": "Meredith Grey; Cristina Yang; Izzie Stevens; George O'Malley",
    "interfering_episode_characters": "Miranda Bailey; Preston Burke",
    "single_episode_progression_string": "Meredith starts her first day as an intern at Seattle Grace Hospital, meeting her resident Miranda Bailey. The interns handle their first cases, including Katie Bryce's seizures, and George struggles with an appendectomy, highlighting their personal and professional dilemmas."
  },
  {
    "title": "Meredith's Struggle with Her Mother's Secret",
    "arc_type": "Genre-Specific Arc",
    "description": "Meredith grapples with the secret of her mother's past, affecting her emotionally and professionally.",
    "episodic": false,
    "main_characters": "Meredith Grey",
    "interfering_episode_characters": "Cristina Yang; Derek Shepherd",
    "single_episode_progression_string": "Meredith decides not to sell her mother's house and reveals Ellis Grey's Alzheimer's, dealing with the emotional impact of her mother's condition while starting her new role as an intern."
  },
  {
    "title": "Medical Case: Katie Bryce's Seizures",
    "arc_type": "Episodic Arc",
    "description": "The interns work together to diagnose and treat Katie Bryce, a patient experiencing unexplained seizures.",
    "episodic": true,
    "main_characters": "Meredith Grey; Cristina Yang; Derek Shepherd",
    "interfering_episode_characters": "Katie Bryce; Miranda Bailey",
    "single_episode_progression_string": "Katie Bryce is admitted with seizures, and the interns are tasked with her care. Meredith is responsible for her CT scan and later discovers the cause of her seizures, an aneurysm, with Cristina's help. Meredith assists in the surgery to fix the aneurysm."
  },
  {
    "title": "Intern Dynamics and Challenges",
    "arc_type": "Genre-Specific Arc",
    "description": "The new interns at Seattle Grace Hospital face various challenges as they adjust to their roles, navigate relationships, and compete for opportunities.",
    "episodic": false,
    "main_characters": "Meredith Grey; Cristina Yang; George O'Malley; Isobel Stevens",
    "interfering_episode_characters": "Miranda Bailey; Preston Burke",
    "single_episode_progression_string": "Meredith, Cristina, George, and Izzie start their first day as interns. They meet their resident, Bailey, and face challenges like performing procedures and dealing with difficult cases. George struggles in surgery, earning the nickname '007,' while Meredith and Cristina work together to diagnose Katie."
  },
  {
    "title": "Meredith's Family Legacy and Personal Struggles",
    "arc_type": "Soap Arc",
    "description": "Meredith grapples with her mother's legacy as a renowned surgeon and her own personal struggles, including her mother's Alzheimer's diagnosis.",
    "episodic": false,
    "main_characters": "Meredith Grey",
    "interfering_episode_characters": "Ellis Grey; Cristina Yang",
    "single_episode_progression_string": "Meredith is revealed to be the daughter of Ellis Grey, a famous surgeon. She deals with the pressure of her mother's reputation and visits her mother, who has Alzheimer's, deciding not to sell the family house."
  },
  {
    "title": "George's Struggles and Growth",
    "arc_type": "Genre-Specific Arc",
    "description": "George O'Malley faces challenges as an intern, dealing with self-doubt and striving to prove himself in a competitive environment.",
    "episodic": false,
    "main_characters": "George O'Malley",
    "interfering_episode_characters": "Preston Burke; Meredith Grey",
    "single_episode_progression_string": "George is chosen for an appendectomy but struggles and earns the nickname '007.' He feels insecure about his abilities and contemplates his career choice after a patient's death."
  }
]