[
  {
    "title": "Meredith and Derek's Complicated Romance",
    "arc_type": "Soap Arc",
    "description": "Meredith and Derek's relationship begins with a one-night stand, complicated by Derek being her boss. Their romance faces challenges, including workplace gossip and Meredith's struggle to keep it professional.",
    "episodic": false,
    "main_characters": "Meredith Grey; Derek Shepherd",
    "interfering_episode_characters": "Miranda Bailey; George O'Malley; Cristina Yang",
    "single_episode_progression_string": "Meredith wakes up after a one-night stand with Derek, only to discover he is her new attending at the hospital. They have an awkward encounter, and Derek jokes about their night together. Despite the tension, Derek chooses Meredith to assist in surgery, acknowledging her skills."
  },
  {
    "title": "Interns' Journey at Seattle Grace",
    "arc_type": "Genre-Specific Arc",
    "description": "The interns face the harsh realities of surgical life, learning through various medical cases and personal trials. They navigate professional growth and ethical dilemmas.",
    "episodic": false,
    "main_characters": "Meredith Grey; Cristina Yang; Isobel Stevens; George O'Malley",
    "interfering_episode_characters": "Miranda Bailey; Preston Burke",
    "single_episode_progression_string": "Interns start their journey. Face challenging cases. Learn from mistakes. Grow professionally and personally."
  },
  {
    "title": "Medical Case: Katie Bryce's Seizures",
    "arc_type": "Episodic Arc",
    "description": "Meredith and Cristina work together to diagnose Katie Bryce's rare condition, leading to Meredith assisting in surgery.",
    "episodic": true,
    "main_characters": "Meredith Grey; Cristina Yang; Derek Shepherd",
    "interfering_episode_characters": "Miranda Bailey; Katie Bryce",
    "single_episode_progression_string": "Katie Bryce is brought in with seizures, and Meredith is assigned to her case. After several attempts to stabilize her, Meredith and Cristina suspect an aneurysm. Their diagnosis is confirmed, and Meredith assists in the surgery, successfully treating Katie."
  },
  {
    "title": "Meredith's Legacy and Family Ties",
    "arc_type": "Soap Arc",
    "description": "Meredith grapples with her mother's legacy as a renowned surgeon and her own path in medicine, while dealing with her mother's Alzheimer's.",
    "episodic": false,
    "main_characters": "Meredith Grey; Ellis Grey",
    "interfering_episode_characters": "Cristina Yang; George O'Malley",
    "single_episode_progression_string": "Meredith is introduced as the daughter of Ellis Grey, a famous surgeon. She struggles with her mother's expectations and later visits her mother, who has Alzheimer's, deciding not to sell the family house."
  },
  {
    "title": "Intern Dynamics and Rivalries",
    "arc_type": "Genre-Specific Arc",
    "description": "The new interns at Seattle Grace Hospital navigate their roles, forming alliances and rivalries as they begin their medical careers.",
    "episodic": false,
    "main_characters": "Meredith Grey; Cristina Yang; George O'Malley; Isobel Stevens",
    "interfering_episode_characters": "Miranda Bailey; Preston Burke",
    "single_episode_progression_string": "Meredith, Cristina, George, and Izzie start their internships, meeting their resident Bailey. They face challenges, including George's failed surgery attempt and Meredith's success with Katie's case, leading to tensions and alliances forming among them."
  },
  {
    "title": "George's Struggles and Nickname '007'",
    "arc_type": "Episodic Arc",
    "description": "George faces challenges in the operating room, earning the nickname '007' after a failed procedure.",
    "episodic": true,
    "main_characters": "George O'Malley",
    "interfering_episode_characters": "Preston Burke; Meredith Grey; Cristina Yang",
    "single_episode_progression_string": "George is chosen for an appendectomy but struggles and fails, leading to the patient bleeding. Burke steps in to finish the procedure, and the interns nickname George '007' for his perceived incompetence."
  }
]