{
  "scenes": [
    {
      "scene_number": 1,
      "plot_segment": "Meredith Grey narrates about the game of surgery, stating that some people have what it takes to play, and some do not. She reflects on her mother being one of the greats, but feels she herself is at a disadvantage. Meredith wakes up after a one-night stand, feeling awkward and embarrassed. She tells the man, Derek, that he has to leave because she is late for her first day of work. They have a brief, awkward conversation about Meredith's living situation. Meredith reveals she moved from Boston two weeks ago and is selling her mother's house. She clarifies her mother is not dead, but avoids further personal conversation. Meredith goes upstairs to shower, telling Derek to be gone when she returns. They exchange names before he leaves.",
      "start_time": "00:00:03,502",
      "end_time": "00:01:43,076",
      "start_seconds": 3.502,
      "end_seconds": 103.076
    },
    {
      "scene_number": 2,
      "plot_segment": "At the hospital, a group of new surgical interns, including Meredith, gather for orientation. The chief of surgery addresses them, telling them that they are now doctors, not students. He warns them that the next seven years will be the best and worst of their lives, pushing them to their limits. He tells them to look around at their competition, as some will switch specialties, some will crack, and some will be asked to leave. Meredith internally repeats that she is screwed.",
      "start_time": "00:02:05,625",
      "end_time": "00:02:51,714",
      "start_seconds": 125.625,
      "end_seconds": 171.714
    },
    {
      "scene_number": 3,
      "plot_segment": "The interns are assigned to residents. Cristina Yang and George O'Malley discuss the small number of women and rumors about one being a model. They discover they are all assigned to Dr. Bailey, known as 'the Nazi.' Izzie Stevens introduces herself as the model. Dr. Bailey arrives and lays out five strict rules for the interns, including not sucking up, answering every page at a run, not waking her unless a patient is dying, not letting a dying patient be dead when she arrives, and moving when she moves. She orders them out of her way.",
      "start_time": "00:03:10,321",
      "end_time": "00:05:13,985",
      "start_seconds": 190.321,
      "end_seconds": 313.985
    },
    {
      "scene_number": 4,
      "plot_segment": "The interns respond to their first emergency. A 15-year-old girl, Katie Bryce, is brought in with seizures. Dr. Bailey and Dr. Burke direct the team. Cristina is assigned labs, George does patient work-ups, and Meredith is told to take Katie for a CT scan and is given responsibility for her. Izzie is assigned to do rectal exams on multiple patients.",
      "start_time": "00:05:29,232",
      "end_time": "00:06:21,167",
      "start_seconds": 329.23199999999997,
      "end_seconds": 381.16700000000003
    },
    {
      "scene_number": 5,
      "plot_segment": "Cristina finds Dr. Bailey to report that Katie's labs are clear, with nothing explaining her seizures. Cristina mentions a rumor that the best intern gets to perform a procedure during the first shift. Bailey dismisses her. Izzie tries to reassure a patient about upcoming bypass surgery. Meredith interacts with Katie, who is upset about missing her pageant. George awkwardly performs a rectal exam on a patient. Katie complains about her situation and talks about her talent for rhythmic gymnastics.",
      "start_time": "00:06:37,228",
      "end_time": "00:08:25,696",
      "start_seconds": 397.228,
      "end_seconds": 505.696
    },
    {
      "scene_number": 6,
      "plot_segment": "The interns take a break. George complains about the number of rectal exams he has performed and feels hated by Dr. Bailey. Cristina and Izzie discuss Meredith's famous mother, Ellis Grey, a legendary surgeon. They talk about the pressure Meredith must feel. Cristina expresses her desire for a good case. Meredith complains about Katie being a difficult patient.",
      "start_time": "00:08:33,597",
      "end_time": "00:09:22,559",
      "start_seconds": 513.597,
      "end_seconds": 562.559
    },
    {
      "scene_number": 7,
      "plot_segment": "Dr. Burke announces that George O'Malley has been chosen to perform the first surgery, an appendectomy. The other interns are surprised, as George barely made it into the program. Burke and another doctor discuss how Burke always picks one intern to terrorize, so the others fall in line. George is nervous but prepares for surgery.",
      "start_time": "00:09:22,559",
      "end_time": "00:10:18,818",
      "start_seconds": 562.559,
      "end_seconds": 618.818
    },
    {
      "scene_number": 8,
      "plot_segment": "George begins the appendectomy under Dr. Burke's supervision. The other interns bet on whether he will succeed or fail. George successfully removes the appendix but then tears the cecum, causing a bleed. He hesitates, and Burke takes over, calling George a 'pansy-ass idiot' and removing him from the OR. The other interns nickname George '007,' meaning 'license to kill.'",
      "start_time": "00:12:14,908",
      "end_time": "00:15:06,673",
      "start_seconds": 734.908,
      "end_seconds": 906.673
    },
    {
      "scene_number": 9,
      "plot_segment": "George is upset about being called '007.' Cristina and Izzie try to reassure him, but he is convinced everyone is talking about him. Cristina gets paged for an emergency with Katie Bryce. Meredith reflects on the difficulty of surgery and considers switching to geriatrics. She realizes she needs to find her own place to live.",
      "start_time": "00:15:06,673",
      "end_time": "00:16:04,679",
      "start_seconds": 906.673,
      "end_seconds": 964.679
    },
    {
      "scene_number": 10,
      "plot_segment": "Meredith rushes to Katie's room after a '911' page, only to find Katie is bored and wants to watch her pageant on TV. Meredith is frustrated and tells Katie to go to sleep. Cristina and Izzie discuss starting a central line for a patient but are unsure how to do it. They consider waking Dr. Bailey, who angrily tells them not to wake her unless the patient is dying. Cristina is given more lab work. Izzie argues with a nurse about a diagnosis and is insulted by Alex Karev, who calls her a nurse.",
      "start_time": "00:15:33,623",
      "end_time": "00:19:21,017",
      "start_seconds": 933.623,
      "end_seconds": 1161.017
    },
    {
      "scene_number": 11,
      "plot_segment": "Katie has another seizure. Meredith is put in charge and must decide how to proceed. She orders more medication, but nothing works. Katie's heart stops, and a code blue is called. Meredith leads the team in resuscitating Katie, eventually restoring her heartbeat. Dr. Bailey scolds Meredith for not paging her immediately. Meredith is visibly shaken.",
      "start_time": "00:19:45,584",
      "end_time": "00:22:11,362",
      "start_seconds": 1185.584,
      "end_seconds": 1331.362
    },
    {
      "scene_number": 12,
      "plot_segment": "Katie's parents confront Dr. Shepherd about their daughter's condition. He admits he does not know what is causing the seizures. Katie's father demands another doctor. Meanwhile, Izzie reassures a patient about his upcoming surgery. Meredith practices suturing on a banana, and George reflects on his day. Dr. Shepherd gathers the interns and asks for their help diagnosing Katie. He offers the incentive that whoever finds the answer will assist in surgery.",
      "start_time": "00:22:24,123",
      "end_time": "00:25:02,340",
      "start_seconds": 1344.123,
      "end_seconds": 1502.34
    },
    {
      "scene_number": 13,
      "plot_segment": "Cristina asks Meredith to work together on Katie's case, offering her the surgery if they succeed. Meredith agrees. They rule out various diagnoses and discuss Meredith's relationship with Dr. Shepherd, revealing they had sex. They worry about Katie's fate if no one finds the answer. Meredith realizes that Katie's minor fall during rhythmic gymnastics could have caused a brain aneurysm. They present their theory to Dr. Shepherd, who orders an angiogram.",
      "start_time": "00:25:32,692",
      "end_time": "00:29:21,886",
      "start_seconds": 1532.692,
      "end_seconds": 1761.886
    },
    {
      "scene_number": 14,
      "plot_segment": "The angiogram reveals a small subarachnoid hemorrhage in Katie's brain. Dr. Shepherd confirms that a minor fall caused an aneurysm to burst. He praises Meredith and Cristina for their work. Dr. Shepherd tells Meredith she will assist in the surgery. Cristina is disappointed not to be chosen.",
      "start_time": "00:28:37,615",
      "end_time": "00:29:20,407",
      "start_seconds": 1717.615,
      "end_seconds": 1760.407
    },
    {
      "scene_number": 15,
      "plot_segment": "Dr. Burke informs Izzie that a patient's heart was too damaged for bypass surgery, and he died. Izzie is upset because she promised the man's wife he would be fine. Dr. Burke scolds her for making promises she cannot keep and tells her to inform the widow. Izzie delivers the news to the man's wife, who is devastated and asks Izzie to leave.",
      "start_time": "00:30:43,020",
      "end_time": "00:33:09,552",
      "start_seconds": 1843.02,
      "end_seconds": 1989.552
    },
    {
      "scene_number": 16,
      "plot_segment": "Cristina confronts Meredith about getting the surgery. Meredith offers to let Cristina take her place, but Cristina refuses, accusing Meredith of benefiting from her relationship with Dr. Shepherd and her famous mother. Cristina tells Meredith to deal with her actions and not seek absolution.",
      "start_time": "00:31:49,508",
      "end_time": "00:32:13,885",
      "start_seconds": 1909.508,
      "end_seconds": 1933.885
    },
    {
      "scene_number": 17,
      "plot_segment": "Meredith prepares Katie for surgery, shaving her head and trying to make her look cool. Meredith asks Dr. Shepherd if she was chosen because they slept together. He jokes that she was, then assures her she earned it by helping save Katie's life. He encourages her not to let their personal history interfere with her opportunity.",
      "start_time": "00:33:36,963",
      "end_time": "00:34:12,102",
      "start_seconds": 2016.963,
      "end_seconds": 2052.102
    },
    {
      "scene_number": 18,
      "plot_segment": "George and Izzie reflect on their experiences. George wishes he had chosen a different career, feeling the pressure of being a surgeon. Izzie shares that her mother doubted her abilities. They both agree that being seen as a superhero is not so bad. They wonder if they will survive the program.",
      "start_time": "00:34:26,095",
      "end_time": "00:35:19,426",
      "start_seconds": 2066.095,
      "end_seconds": 2119.426
    },
    {
      "scene_number": 19,
      "plot_segment": "The next morning, Dr. Webber questions the interns about a patient with post-op fever. George cannot answer, but Meredith correctly lists the five W's of post-op fever and suggests a pulmonary embolus. Dr. Webber tells the team to follow Meredith's plan and removes George from the case. He recognizes Meredith as Ellis Grey's daughter and welcomes her to the game.",
      "start_time": "00:35:26,814",
      "end_time": "00:37:02,345",
      "start_seconds": 2126.814,
      "end_seconds": 2222.345
    },
    {
      "scene_number": 20,
      "plot_segment": "Dr. Shepherd prepares for Katie's surgery, telling the team it is a beautiful night to save lives. Meredith narrates about the difficulty of being a surgeon and the reasons to quit. She reflects on the responsibility of holding lives in their hands and the moment when it becomes more than a game. She decides she loves the challenge.",
      "start_time": "00:37:02,345",
      "end_time": "00:38:45,611",
      "start_seconds": 2222.345,
      "end_seconds": 2325.611
    },
    {
      "scene_number": 21,
      "plot_segment": "After the surgery, Meredith and Cristina avoid an emotional conversation, agreeing not to have a moment. They joke about each other's appearance and suggest getting some sleep. Meredith and Dr. Shepherd share a moment, reflecting on the high of surgery. Meredith leaves, and they say goodbye.",
      "start_time": "00:39:05,589",
      "end_time": "00:40:37,930",
      "start_seconds": 2345.589,
      "end_seconds": 2437.93
    },
    {
      "scene_number": 22,
      "plot_segment": "Meredith narrates that she and the other interns survived their first shift. She considers her feelings about her colleagues and decides she likes them. She changes her mind about selling her mother's house and decides to keep it, planning to get roommates. Meredith visits her mother, who is in a care facility and does not recognize her. Meredith tells her mother that she was a surgeon. The episode ends with Meredith's quiet affirmation of her mother's legacy.",
      "start_time": "00:40:43,245",
      "end_time": "00:42:21,565",
      "start_seconds": 2443.245,
      "end_seconds": 2541.565
    }
  ]
}