{
  "scenes": [
    {
      "scene_number": 1,
      "plot_segment": "A voice reflects on life in the surgical unit, describing the long hours and close proximity among the residents. The scene shifts to a discussion between several characters about room assignments in Meredith's house. They debate who should have the bigger room, referencing Meredith's mother's boxes and suggesting making the house more homey. Someone mentions finding tapes of Meredith's mother performing medical procedures and proposes watching them. Meredith is asked if she wants privacy.",
      "is_recap": false,
      "start_time": "00:00:04,131",
      "end_time": "00:01:21,986",
      "start_seconds": 4.131,
      "end_seconds": 81.986,
      "start_subtitle_index": 0,
      "end_subtitle_index": 29
    },
    {
      "scene_number": 2,
      "plot_segment": "A group of residents arrive at the hospital and greet Dr. Bailey, who curtly tells them to be quiet. Dr. Bailey reminds a resident that she is an attending and they work for her. The resident seems to have forgotten something important happening that day. After a brief exchange, Dr. Bailey moves on.",
      "is_recap": false,
      "start_time": "00:01:27,992",
      "end_time": "00:01:50,453",
      "start_seconds": 87.992,
      "end_seconds": 110.453,
      "start_subtitle_index": 30,
      "end_subtitle_index": 38
    },
    {
      "scene_number": 3,
      "plot_segment": "A commotion occurs in the hospital as someone is wheeled in. There is mention of a dangerous underground bike race called the 'dead baby bike race.' Characters discuss the race's lack of rules and the type of people who participate. Dr. Bailey gives instructions to the residents about trauma protocol, warning them not to fight over patients and to avoid mingling with ER interns.",
      "is_recap": false,
      "start_time": "00:01:52,316",
      "end_time": "00:03:34,375",
      "start_seconds": 112.316,
      "end_seconds": 214.375,
      "start_subtitle_index": 39,
      "end_subtitle_index": 78
    },
    {
      "scene_number": 4,
      "plot_segment": "Residents compete to claim trauma cases, expressing excitement about the influx of patients from the bike race. Two residents argue over who gets a particular patient, flipping a coin to decide. One patient requests to have his injuries treated quickly so he can return to the race. Another patient, an unidentified John Doe, is brought in after being hit by a motorist avoiding a bike. His condition is critical, and Dr. Shepherd instructs the team to perform tests to confirm brain death.",
      "is_recap": false,
      "start_time": "00:03:38,359",
      "end_time": "00:05:52,502",
      "start_seconds": 218.359,
      "end_seconds": 352.502,
      "start_subtitle_index": 79,
      "end_subtitle_index": 131
    },
    {
      "scene_number": 5,
      "plot_segment": "A resident is sent by Dr. Bailey to assist Dr. Burke, but is told not to scrub in and instead to monitor pre- and post-op patients. Dr. Burke asks the resident to look after his friend, Lloyd Mackey, and provide whatever he needs.",
      "is_recap": false,
      "start_time": "00:06:06,791",
      "end_time": "00:06:27,517",
      "start_seconds": 366.791,
      "end_seconds": 387.517,
      "start_subtitle_index": 132,
      "end_subtitle_index": 141
    },
    {
      "scene_number": 6,
      "plot_segment": "George checks on Mr. Mackey, who is smoking in his hospital room. George tells him smoking is not allowed and tries to convince him that there is hope since he is at the top of the liver donor list. Mr. Mackey is skeptical, referencing his long wait and using a baseball metaphor. He mentions that Chief Richard Webber has been his doctor for 30 years.",
      "is_recap": false,
      "start_time": "00:06:45,908",
      "end_time": "00:07:55,555",
      "start_seconds": 405.908,
      "end_seconds": 475.555,
      "start_subtitle_index": 142,
      "end_subtitle_index": 166
    },
    {
      "scene_number": 7,
      "plot_segment": "A group of residents monitor the John Doe patient, noting absent corneal reflexes and discussing the process for declaring brain death. One resident, Izzy, hopes for a miracle, but another explains the medical reality and the importance of following protocol to confirm death. They reflect on the difficulty of watching a patient die without intervening.",
      "is_recap": false,
      "start_time": "00:08:03,488",
      "end_time": "00:09:23,857",
      "start_seconds": 483.488,
      "end_seconds": 563.857,
      "start_subtitle_index": 167,
      "end_subtitle_index": 195
    },
    {
      "scene_number": 8,
      "plot_segment": "Residents observe the John Doe, noting personal details like his new sneakers and a sewn shirt, and speculate that he has a family. They discuss the potential for organ donation and the importance of finding his family before declaring him dead.",
      "is_recap": false,
      "start_time": "00:09:29,847",
      "end_time": "00:16:57,250",
      "start_seconds": 569.847,
      "end_seconds": 1017.25,
      "start_subtitle_index": 196,
      "end_subtitle_index": 352
    },
    {
      "scene_number": 9,
      "plot_segment": "A patient flirts with a resident during his examination, insisting on leaving to finish the bike race despite medical advice. The resident tries to persuade him to stay for tests, but he refuses and signs an AMA (Against Medical Advice) form. The patient kisses the resident for good luck before leaving.",
      "is_recap": false,
      "start_time": "00:16:58,390",
      "end_time": "00:31:52,478",
      "start_seconds": 1018.39,
      "end_seconds": 1912.478,
      "start_subtitle_index": 353,
      "end_subtitle_index": 617
    },
    {
      "scene_number": 10,
      "plot_segment": "Two characters discuss jealousy and their past romantic encounters, including a kiss in an elevator. One character tries to convince the other to go out with him, arguing that life is short. The other insists she is not interested and says she still has something to prove.",
      "is_recap": false,
      "start_time": "00:32:11,813",
      "end_time": "00:32:23,320",
      "start_seconds": 1931.813,
      "end_seconds": 1943.32,
      "start_subtitle_index": 618,
      "end_subtitle_index": 623
    },
    {
      "scene_number": 11,
      "plot_segment": "A resident approaches Dr. Burke in the middle of surgery to request an aortic repair for the John Doe patient. Burke questions the legality and ethics of operating on a brain-dead patient. The resident argues that the surgery could make the patient a viable organ donor. Burke refuses, telling the resident to leave the men's room.",
      "is_recap": false,
      "start_time": "00:32:25,526",
      "end_time": "00:35:08,094",
      "start_seconds": 1945.526,
      "end_seconds": 2108.094,
      "start_subtitle_index": 624,
      "end_subtitle_index": 673
    },
    {
      "scene_number": 12,
      "plot_segment": "A resident seeks advice from another about how to get the chief involved in the John Doe case. They discuss the potential for a liver transplant for Mackey and the importance of getting the chief's attention. George approaches Chief Webber to report that Mackey may have a liver match.",
      "is_recap": false,
      "start_time": "00:35:08,114",
      "end_time": "00:35:54,077",
      "start_seconds": 2108.114,
      "end_seconds": 2154.077,
      "start_subtitle_index": 674,
      "end_subtitle_index": 683
    },
    {
      "scene_number": 13,
      "plot_segment": "Dr. Burke performs surgery on the John Doe patient. Residents observe and comment on Burke's skill, noting that if the patient were not brain dead, he would recover quickly. The police call to report that the John Doe has been identified and his wife is on the way.",
      "is_recap": false,
      "start_time": "00:37:04,088",
      "end_time": "00:37:48,809",
      "start_seconds": 2224.088,
      "end_seconds": 2268.809,
      "start_subtitle_index": 684,
      "end_subtitle_index": 689
    },
    {
      "scene_number": 14,
      "plot_segment": "Mrs. Stevenson arrives at the hospital and is informed by Dr. Stevens about her husband's condition. She is told that they can wait until morning before making decisions about organ donation if there is no change.",
      "is_recap": false,
      "start_time": "00:38:18,253",
      "end_time": "00:40:38,590",
      "start_seconds": 2298.253,
      "end_seconds": 2438.59,
      "start_subtitle_index": 690,
      "end_subtitle_index": 730
    },
    {
      "scene_number": 15,
      "plot_segment": "Chief Webber visits Mackey, who jokes about George not letting him smoke. Webber tells Mackey that George may have found him a liver, and Mackey is pleased.",
      "is_recap": false,
      "start_time": "00:40:53,588",
      "end_time": "00:42:08,016",
      "start_seconds": 2453.588,
      "end_seconds": 2528.016,
      "start_subtitle_index": 731,
      "end_subtitle_index": 745
    },
    {
      "scene_number": 16,
      "plot_segment": "A group of residents celebrate after surgery, joking about the smell of open-heart surgery. Meredith expresses frustration with Alex, telling him to stay out of her face. Alex claims Meredith attacked him, and another character warns Alex to leave before Meredith gets angry.",
      "is_recap": false,
      "start_time": "00:42:08,657",
      "end_time": "00:42:09,759",
      "start_seconds": 2528.657,
      "end_seconds": 2529.759,
      "start_subtitle_index": 746,
      "end_subtitle_index": 746
    },
    {
      "scene_number": 17,
      "plot_segment": "Residents gather at Meredith's house, watching tapes of her mother's surgeries. Someone unpacks Ellis Grey's belongings, explaining that nesting helps when upset. Meredith refuses to watch the tapes or unpack boxes, insisting on boundaries and expressing dislike for Chinese food.",
      "is_recap": false,
      "start_time": "00:42:10,539",
      "end_time": "00:42:11,480",
      "start_seconds": 2530.539,
      "end_seconds": 2531.48,
      "start_subtitle_index": 747,
      "end_subtitle_index": 747
    },
    {
      "scene_number": 18,
      "plot_segment": "Meredith confides in Cristina about her difficulties living with Izzy and George, who are cheerful and considerate. Cristina suggests kicking them out, but Meredith says she can't. They joke about repressing feelings and discuss being assigned to the pit again. The residents express frustration that others got to participate in the organ harvest surgery.",
      "is_recap": false,
      "start_time": "00:42:11,661",
      "end_time": "00:42:16,085",
      "start_seconds": 2531.661,
      "end_seconds": 2536.085,
      "start_subtitle_index": 748,
      "end_subtitle_index": 748
    },
    {
      "scene_number": 19,
      "plot_segment": "Mrs. Davidson is asked to consent to organ donation for her husband, including corneas and skin. She is hesitant about donating his skin, worried about the funeral and how her daughter will see her father. The emotional difficulty of the decision is evident.",
      "is_recap": false,
      "start_time": "00:42:16,105",
      "end_time": "00:42:18,847",
      "start_seconds": 2536.105,
      "end_seconds": 2538.847,
      "start_subtitle_index": 749,
      "end_subtitle_index": 749
    },
    {
      "scene_number": 20,
      "plot_segment": "A resident admits she is not good at talking to families and apologizes. She is reminded to refer to the patient by his name, Kevin Davidson, and not as John Doe or by his condition. The importance of seeing patients as people is emphasized.",
      "is_recap": false,
      "start_time": "00:42:18,867",
      "end_time": "00:42:20,268",
      "start_seconds": 2538.867,
      "end_seconds": 2540.268,
      "start_subtitle_index": 750,
      "end_subtitle_index": 750
    },
    {
      "scene_number": 21,
      "plot_segment": "Mackey thanks George for finding him a liver and proposes celebrating together after his recovery. George clarifies that he is not interested in Mackey romantically. Mackey explains that he flirts because dying gives him freedom, and asks George if he has ever been attracted to someone he couldn't have. George awkwardly admits his feelings for Meredith.",
      "is_recap": false,
      "start_time": "00:42:20,289",
      "end_time": "00:42:21,309",
      "start_seconds": 2540.289,
      "end_seconds": 2541.309,
      "start_subtitle_index": 751,
      "end_subtitle_index": 751
    },
    {
      "scene_number": 22,
      "plot_segment": "Dr. Burke discusses organ harvesting, expressing discomfort with the process and reiterating that he prefers saving lives as a surgeon. Another character acknowledges the effort made and says goodbye to the donor patient.",
      "is_recap": false,
      "start_time": "00:42:21,329",
      "end_time": "00:42:21,510",
      "start_seconds": 2541.329,
      "end_seconds": 2541.51,
      "start_subtitle_index": 752,
      "end_subtitle_index": 752
    },
    {
      "scene_number": 23,
      "plot_segment": "Viper, a participant from the bike race, is found waiting in the hospital. A resident checks on him and prepares to take him to surgery. Alex is instructed to help move Viper, and Dr. Bailey takes charge as they rush him to the OR.",
      "is_recap": false,
      "start_time": null,
      "end_time": null,
      "start_seconds": null,
      "end_seconds": null,
      "start_subtitle_index": null,
      "end_subtitle_index": null
    },
    {
      "scene_number": 24,
      "plot_segment": "Dr. Bailey prepares for surgery and instructs Meredith and Alex to return to their duties. Alex is reprimanded for showing off. Bailey adjusts the operating table and prepares Mackey for anesthesia, telling him to count backwards.",
      "is_recap": false,
      "start_time": null,
      "end_time": null,
      "start_seconds": null,
      "end_seconds": null,
      "start_subtitle_index": null,
      "end_subtitle_index": null
    },
    {
      "scene_number": 25,
      "plot_segment": "Two residents discuss the difficulty of watching Kevin Davidson's organs being harvested. One resident decides not to stay, feeling unable to witness the procedure. The other is reminded that every organ represents a life saved. They prepare for the surgery.",
      "is_recap": false,
      "start_time": null,
      "end_time": null,
      "start_seconds": null,
      "end_seconds": null,
      "start_subtitle_index": null,
      "end_subtitle_index": null
    },
    {
      "scene_number": 26,
      "plot_segment": "The organ harvest surgery begins. A resident tells Izzy she will sew up Kevin Davidson for his family. Izzy is asked to do it herself.",
      "is_recap": false,
      "start_time": null,
      "end_time": null,
      "start_seconds": null,
      "end_seconds": null,
      "start_subtitle_index": null,
      "end_subtitle_index": null
    },
    {
      "scene_number": 27,
      "plot_segment": "Mrs. Davidson is informed that her husband is ready if she would like to see him. She is given the opportunity to say goodbye.",
      "is_recap": false,
      "start_time": null,
      "end_time": null,
      "start_seconds": null,
      "end_seconds": null,
      "start_subtitle_index": null,
      "end_subtitle_index": null
    },
    {
      "scene_number": 28,
      "plot_segment": "A group of Viper's friends arrive at the hospital, asking about his condition. A resident lectures them about the dangers of the bike race and the consequences for others. Dr. Bailey interrupts, and another resident reassures the group that Viper will survive.",
      "is_recap": false,
      "start_time": null,
      "end_time": null,
      "start_seconds": null,
      "end_seconds": null,
      "start_subtitle_index": null,
      "end_subtitle_index": null
    },
    {
      "scene_number": 29,
      "plot_segment": "A character tells another that their relationship is not about the thrill of the chase, but about genuine feelings, mentioning her hair and bossiness. She insists she is still not going out with him.",
      "is_recap": false,
      "start_time": null,
      "end_time": null,
      "start_seconds": null,
      "end_seconds": null,
      "start_subtitle_index": null,
      "end_subtitle_index": null
    },
    {
      "scene_number": 30,
      "plot_segment": "Mackey's surgery goes smoothly, and he jokes that he will have to quit smoking. Another character comments that the pretty ones always come back.",
      "is_recap": false,
      "start_time": null,
      "end_time": null,
      "start_seconds": null,
      "end_seconds": null,
      "start_subtitle_index": null,
      "end_subtitle_index": null
    },
    {
      "scene_number": 31,
      "plot_segment": "A voice reflects on the true nature of competition in residency, stating that victories are measured by lives saved, not by winning or losing. Residents watch Ellis Grey's surgical tapes together, celebrating a remarkable procedure. Meredith notes that sometimes the life you save is your own.",
      "is_recap": false,
      "start_time": null,
      "end_time": null,
      "start_seconds": null,
      "end_seconds": null,
      "start_subtitle_index": null,
      "end_subtitle_index": null
    }
  ]
}