{
  "scenes": [
    {
      "scene_number": 1,
      "plot_segment": "A character reflects on life as a surgical resident, describing the long hours and close quarters with colleagues. In Meredith's house, George and Izzie argue about who should get the bigger room, citing reasons like closet space and who arrived first. Meredith is present but does not intervene. The conversation shifts to Meredith's mother's belongings, with Izzie suggesting they unpack boxes and watch tapes of Meredith's mother performing surgeries. Meredith is asked if she wants privacy.",
      "is_recap": false,
      "start_time": "00:00:04,131",
      "end_time": "00:01:21,986",
      "start_seconds": 4.131,
      "end_seconds": 81.986,
      "start_subtitle_index": 0,
      "end_subtitle_index": 29
    },
    {
      "scene_number": 2,
      "plot_segment": "At the hospital, a character greets Dr. Bailey, who curtly tells them to be quiet. Dr. Bailey is reminded by another character that she is an attending and they are a resident. Dr. Bailey seems distracted, trying to remember something important about the day. The other character leaves, and Dr. Bailey continues to try to recall what she is forgetting.",
      "is_recap": false,
      "start_time": "00:01:27,992",
      "end_time": "00:01:50,453",
      "start_seconds": 87.992,
      "end_seconds": 110.453,
      "start_subtitle_index": 30,
      "end_subtitle_index": 38
    },
    {
      "scene_number": 3,
      "plot_segment": "In the emergency department, staff prepare for an influx of trauma cases due to the annual 'dead baby bike race,' an illegal and dangerous event involving bike messengers. Several characters discuss the nature of the race and its lack of rules, except for 'no eye gouging.' Bailey instructs the interns not to fight over patients and to avoid mingling with ER interns. The interns express frustration about being stuck in the pit instead of getting surgical opportunities.",
      "is_recap": false,
      "start_time": "00:01:52,316",
      "end_time": "00:04:18,610",
      "start_seconds": 112.316,
      "end_seconds": 258.61,
      "start_subtitle_index": 39,
      "end_subtitle_index": 87
    },
    {
      "scene_number": 4,
      "plot_segment": "Two interns flip a coin to decide who gets a trauma case. They argue over who gets to be 'heads' and who gets to be 'tails.' A patient with superficial wounds from the bike race asks to be discharged so he can return to the race. The interns debate the seriousness of his injuries. Another trauma patient, an unidentified John Doe, is brought in after being hit by a car. Medical staff discuss his critical condition and the likelihood that he is brain dead. Dr. Shepherd instructs them to perform tests to confirm brain death.",
      "is_recap": false,
      "start_time": "00:04:22,807",
      "end_time": "00:05:52,502",
      "start_seconds": 262.807,
      "end_seconds": 352.502,
      "start_subtitle_index": 88,
      "end_subtitle_index": 131
    },
    {
      "scene_number": 5,
      "plot_segment": "George is assigned by Dr. Bailey to assist Dr. Burke, but Burke tells him to monitor pre- and post-op patients instead of scrubbing in. Burke asks George to look after his friend, Lloyd Mackey, and give him anything he needs.",
      "is_recap": false,
      "start_time": "00:06:06,791",
      "end_time": "00:06:27,517",
      "start_seconds": 366.791,
      "end_seconds": 387.517,
      "start_subtitle_index": 132,
      "end_subtitle_index": 141
    },
    {
      "scene_number": 6,
      "plot_segment": "George finds Mr. Mackey smoking in his hospital room. George tells him smoking is not allowed and tries to convince him to stop, mentioning that Mackey is at the top of the liver transplant list. Mackey is pessimistic about his chances, saying he has been waiting for eight months. George promises to help with anything Mackey needs.",
      "is_recap": false,
      "start_time": "00:06:45,908",
      "end_time": "00:07:55,555",
      "start_seconds": 405.908,
      "end_seconds": 475.555,
      "start_subtitle_index": 142,
      "end_subtitle_index": 166
    },
    {
      "scene_number": 7,
      "plot_segment": "A group of interns monitor the John Doe patient, noting absent corneal reflexes and no higher brain function. Izzie expresses hope for a miracle, but another intern explains that the tests are to ensure there is no chance of recovery before declaring death. The group discusses the difficulty of waiting for a patient to die and the meaning of 'do no harm.' They notice personal details about the patient, such as new sneakers and a sewn shirt, and speculate that he has a family. The conversation shifts to the potential for organ donation.",
      "is_recap": false,
      "start_time": "00:08:03,488",
      "end_time": "00:09:49,457",
      "start_seconds": 483.488,
      "end_seconds": 589.457,
      "start_subtitle_index": 167,
      "end_subtitle_index": 205
    },
    {
      "scene_number": 8,
      "plot_segment": "An intern flirts with a patient from the bike race who refuses further tests and wants to leave against medical advice. The intern insists on a CT scan, but the patient declines, saying he wants to finish the race. The patient kisses the intern for good luck before leaving.",
      "is_recap": false,
      "start_time": "00:09:58,287",
      "end_time": "00:11:24,289",
      "start_seconds": 598.287,
      "end_seconds": 684.289,
      "start_subtitle_index": 206,
      "end_subtitle_index": 237
    },
    {
      "scene_number": 9,
      "plot_segment": "Two characters have a tense conversation about their past romantic encounters. One asks the other out, but is rejected. The conversation turns to the idea of 'the thrill of the chase.' The rejected character insists that pursuing the other is not just a game, but the other disagrees, saying they have something to prove.",
      "is_recap": false,
      "start_time": "00:11:38,971",
      "end_time": "00:12:37,384",
      "start_seconds": 698.971,
      "end_seconds": 757.384,
      "start_subtitle_index": 238,
      "end_subtitle_index": 264
    },
    {
      "scene_number": 10,
      "plot_segment": "A group of interns approach Dr. Burke to request surgery for the John Doe patient, arguing that he is a good candidate for organ donation. Burke refuses, saying the patient is already dead. The interns discuss going over Burke's head to the chief of surgery. George is encouraged to talk to the chief about a liver match for Mackey.",
      "is_recap": false,
      "start_time": "00:12:40,840",
      "end_time": "00:20:14,317",
      "start_seconds": 760.84,
      "end_seconds": 1214.317,
      "start_subtitle_index": 265,
      "end_subtitle_index": 438
    },
    {
      "scene_number": 11,
      "plot_segment": "George tells the chief that he and the other interns have found a liver for Mackey. The interns are nervous about going against Dr. Burke's wishes. Later, Dr. Burke performs surgery on the John Doe patient. The interns observe, and one expresses frustration that Alex is taking credit for the surgery. The police call to say they have identified the John Doe, and his wife is on the way.",
      "is_recap": false,
      "start_time": "00:20:15,700",
      "end_time": "00:21:31,865",
      "start_seconds": 1215.7,
      "end_seconds": 1291.865,
      "start_subtitle_index": 439,
      "end_subtitle_index": 464
    },
    {
      "scene_number": 12,
      "plot_segment": "The wife of the John Doe, now identified as Kevin Davidson, arrives at the hospital and is informed of his condition. She is told that if there is no change by morning, the hospital will discuss organ donation with her.",
      "is_recap": false,
      "start_time": "00:21:44,079",
      "end_time": "00:29:01,405",
      "start_seconds": 1304.079,
      "end_seconds": 1741.405,
      "start_subtitle_index": 465,
      "end_subtitle_index": 584
    },
    {
      "scene_number": 13,
      "plot_segment": "The chief visits Mackey, who jokes about being reprimanded for smoking. The chief tells Mackey that George may have found him a liver.",
      "is_recap": false,
      "start_time": "00:29:01,885",
      "end_time": "00:40:38,590",
      "start_seconds": 1741.885,
      "end_seconds": 2438.59,
      "start_subtitle_index": 585,
      "end_subtitle_index": 730
    },
    {
      "scene_number": 14,
      "plot_segment": "In a break area, one intern boasts about the thrill of open-heart surgery, while another is annoyed by the behavior. The annoyed intern confronts the boastful one, expressing frustration about personal and professional issues. The confrontation ends with the annoyed intern telling the other to stay out of her face.",
      "is_recap": false,
      "start_time": "00:40:53,588",
      "end_time": "00:41:36,887",
      "start_seconds": 2453.588,
      "end_seconds": 2496.887,
      "start_subtitle_index": 731,
      "end_subtitle_index": 738
    },
    {
      "scene_number": 15,
      "plot_segment": "In Meredith's house, Izzie and George watch surgical tapes belonging to Meredith's mother. Meredith finds that Izzie has unpacked some of her mother's things and is upset. She insists they not watch the tapes or unpack boxes, and tells them to use a coaster. Izzie says she ordered Chinese food, which Meredith says she hates.",
      "is_recap": false,
      "start_time": "00:41:36,907",
      "end_time": "00:41:44,778",
      "start_seconds": 2496.907,
      "end_seconds": 2504.778,
      "start_subtitle_index": 739,
      "end_subtitle_index": 739
    },
    {
      "scene_number": 16,
      "plot_segment": "Meredith vents to Cristina about her frustration with her roommates, Izzie and George, who are always around and happy. Cristina suggests Meredith could kick them out, but Meredith says she can't. They discuss being assigned to the pit again and missing out on surgical opportunities. The conversation turns to gender and competition among interns.",
      "is_recap": false,
      "start_time": "00:41:44,798",
      "end_time": "00:42:08,016",
      "start_seconds": 2504.798,
      "end_seconds": 2528.016,
      "start_subtitle_index": 740,
      "end_subtitle_index": 745
    },
    {
      "scene_number": 17,
      "plot_segment": "Mrs. Davidson is asked to consent to organ donation for her husband, including his corneas and skin. She is upset at the idea of donating his skin, worrying about the funeral and how their daughter will see her father. Another character, struggling with the emotional difficulty of talking to families, is reminded by a colleague to refer to the patient by name, Kevin Davidson, rather than as a John Doe or by his condition.",
      "is_recap": false,
      "start_time": "00:42:08,657",
      "end_time": "00:42:09,759",
      "start_seconds": 2528.657,
      "end_seconds": 2529.759,
      "start_subtitle_index": 746,
      "end_subtitle_index": 746
    },
    {
      "scene_number": 18,
      "plot_segment": "Mackey thanks George for finding him a liver and jokes about taking George out when he recovers. George clarifies that he is not gay, and Mackey says he never thought George was. Mackey explains that being terminally ill gives him the freedom to flirt. He asks George if he has ever been attracted to someone he can't have, and George awkwardly admits he likes Meredith.",
      "is_recap": false,
      "start_time": "00:42:10,539",
      "end_time": "00:42:11,480",
      "start_seconds": 2530.539,
      "end_seconds": 2531.48,
      "start_subtitle_index": 747,
      "end_subtitle_index": 747
    },
    {
      "scene_number": 19,
      "plot_segment": "A group of doctors prepare for the organ harvest surgery. One expresses discomfort with the process, saying they prefer to save lives rather than harvest organs. Another reassures them, and the team prepares to proceed. The surgery begins, and one doctor tells another to sew up the patient for the family.",
      "is_recap": false,
      "start_time": "00:42:11,661",
      "end_time": "00:42:16,085",
      "start_seconds": 2531.661,
      "end_seconds": 2536.085,
      "start_subtitle_index": 748,
      "end_subtitle_index": 748
    },
    {
      "scene_number": 20,
      "plot_segment": "Mrs. Davidson is told that her husband is ready if she would like to see him. She is accompanied by a doctor.",
      "is_recap": false,
      "start_time": "00:42:16,105",
      "end_time": "00:42:18,847",
      "start_seconds": 2536.105,
      "end_seconds": 2538.847,
      "start_subtitle_index": 749,
      "end_subtitle_index": 749
    },
    {
      "scene_number": 21,
      "plot_segment": "A group of friends of a patient named Viper arrive at the hospital and ask about his condition. A doctor lectures them about the dangers of the bike race and the consequences for others. Another doctor reassures the group that Viper will survive.",
      "is_recap": false,
      "start_time": "00:42:18,867",
      "end_time": "00:42:20,268",
      "start_seconds": 2538.867,
      "end_seconds": 2540.268,
      "start_subtitle_index": 750,
      "end_subtitle_index": 750
    },
    {
      "scene_number": 22,
      "plot_segment": "Two characters discuss their relationship. One insists that their interest is not about the thrill of the chase, but about genuine feelings. The other remains unconvinced and says she is still not going out with him.",
      "is_recap": false,
      "start_time": "00:42:20,289",
      "end_time": "00:42:21,309",
      "start_seconds": 2540.289,
      "end_seconds": 2541.309,
      "start_subtitle_index": 751,
      "end_subtitle_index": 751
    },
    {
      "scene_number": 23,
      "plot_segment": "The chief tells Mackey that the surgery went smoothly, and Mackey jokes that he will have to quit smoking. Another character, possibly Meredith, reflects on the lessons of competition and the importance of saving lives rather than winning. In Meredith's house, the roommates watch a surgical tape together, and Meredith joins them. The episode ends with a reflection on the value of saving lives and the possibility of saving one's own.",
      "is_recap": false,
      "start_time": "00:42:21,329",
      "end_time": "00:42:21,510",
      "start_seconds": 2541.329,
      "end_seconds": 2541.51,
      "start_subtitle_index": 752,
      "end_subtitle_index": 752
    }
  ]
}