[
  {
    "title": "Meredith and Derek's Complicated Relationship",
    "arc_type": "Soap Arc",
    "description": "Meredith and Derek's relationship begins with a one-night stand and evolves amidst professional challenges and personal revelations.",
    "episodic": false,
    "main_characters": "Meredith; Derek",
    "interfering_episode_characters": "Viper; Bailey",
    "single_episode_progression_string": "Meredith and Derek have a tense interaction after Derek almost gets hit by a bike. Meredith accuses Derek of being interested only in the chase. Derek later tells Meredith it's not about the chase but about her hair, hinting at his genuine interest."
  },
  {
    "title": "Meredith's Struggle with Her Mother's Alzheimer's",
    "arc_type": "Soap Arc",
    "description": "Meredith grapples with her mother's Alzheimer's diagnosis while trying to establish herself as a competent intern.",
    "episodic": false,
    "main_characters": "Meredith",
    "interfering_episode_characters": "Izzie; George",
    "single_episode_progression_string": "Meredith is reminded of her mother's legacy when Izzie and George watch her mother's surgical tapes, causing her to react angrily."
  },
  {
    "title": "Intern Dynamics at Seattle Grace",
    "arc_type": "Genre-Specific Arc",
    "description": "The interns at Seattle Grace Hospital form friendships and rivalries as they navigate the challenges of their medical training.",
    "episodic": false,
    "main_characters": "Meredith; Izzie; George; Cristina; Alex",
    "interfering_episode_characters": "Bailey; Burke",
    "single_episode_progression_string": "Izzie and George argue over room space, showcasing their living dynamics. The interns compete for cases during the bike race chaos. Cristina and Izzie work together on an organ donor case, while Alex and Meredith clash over a patient."
  },
  {
    "title": "George's Professional Embarrassment and Growth",
    "arc_type": "Genre-Specific Arc",
    "description": "George O'Malley faces professional challenges and personal growth as he navigates his internship.",
    "episodic": false,
    "main_characters": "George",
    "interfering_episode_characters": "Mackie; Webber; Alex",
    "single_episode_progression_string": "George is tasked with monitoring patients and faces awkwardness with Mackie, who flirts with him. He successfully finds a liver for Mackie, showing his growth and competence."
  },
  {
    "title": "Medical Case: Viper's Treatment",
    "arc_type": "Episodic Arc",
    "description": "The interns deal with a patient named Viper, who is injured in a bike race.",
    "episodic": true,
    "main_characters": "Meredith; Alex",
    "interfering_episode_characters": "Bailey; Viper",
    "single_episode_progression_string": "Meredith and Alex argue over the treatment of Viper, a patient injured in the bike race. Bailey and Meredith address Viper's friends, managing the situation."
  },
  {
    "title": "Medical Case: Unidentified Patient and Organ Donation",
    "arc_type": "Episodic Arc",
    "description": "Cristina and Izzie handle an unidentified patient and explore the possibility of organ donation.",
    "episodic": true,
    "main_characters": "Cristina; Izzie",
    "interfering_episode_characters": "Unidentified Patient",
    "single_episode_progression_string": "Cristina and Izzie deal with an unidentified patient, focusing on the potential for organ donation. An organ harvest surgery takes place, highlighting Cristina's ambition."
  }
]