[
  "Here is the analysis and correction of the segments according to your guidelines: **Segment 1:**",
  "Meredith is in bed at 4:37am while it is raining. Izzie stands next to Meredith's bed, holding coffee. Izzie mentions that George's bedroom is bigger than Izzie's bedroom. Meredith gets out of bed but trips and falls on Meredith's face. Meredith limps away from the room. Izzie follows Meredith and says Izzie needs more space because Izzie has more clothes. George interrupts and says George got George's room first, but Izzie insists that Meredith should decide. George tells Izzie that George's room is only two inches bigger, but Izzie points out that George has a bigger closet. George suggests Izzie put Izzie's clothes somewhere else, but Izzie says all the spaces are filled with boxes belonging to Meredith's mother. Izzie and George ask Meredith if Izzie and George can put the boxes in storage or unpack some items like lamps, paintings, or pillows to make the house feel more comfortable. Izzie and George quickly ask if Izzie and George can watch the tapes of surgical procedures from one of the boxes. Meredith responds by slamming a door in Izzie and George's faces. A moment later, Meredith opens the door, takes Izzie's coffee, and shuts the door again. Meredith sits against the other side of the door, holding the coffee. **Analysis:** This is a continuous scene in Meredith's house, with a single narrative focus (the roommates' argument and Meredith's reaction). No corrections needed. --- **Segment 2:**",
  "Bailey stands on a street corner and looks confused. Shepherd joins Bailey and greets Bailey. Bailey tells Shepherd to be quiet because something important is supposed to happen today, but Bailey cannot remember what it is. Derek walks forward to cross the road. Bailey gasps and grabs Derek as several bike riders speed past and two of the bike riders crash. **Analysis:** Single event, same location, continuous action. No corrections needed. --- **Segment 3:**",
  "At the hospital, Bailey complains to the interns about the bike riders, saying the bike riders are just fools killing themselves. Alex asks George if Bailey is off Bailey's medication. George is surprised that Alex has never heard of the race. Webber, Burke, and Shepherd stand in front of the O.R. schedule board. Webber, Burke, and Shepherd notice the schedule is well done and think Webber, Burke, and Shepherd might get an early night. Bailey tells Webber, Burke, and Shepherd that \"Dead baby bike race day\" started 20 minutes ago. George and Meredith explain that every year a bar holds an illegal underground bike race. Bailey complains again about bike messengers racing against traffic for free tequila shots. Bailey says Bailey needs someone to go up to the OR floor because the Chief needs help. Everyone except Meredith raises a hand, and Bailey chooses George. Bailey warns the others not to mingle with the E.R. interns, who Bailey says are inexperienced. Bailey tells the interns to sew quickly, discharge patients quickly, and take bodies to the OR immediately. Bailey warns the interns not to fight over patients. The interns run and push for position and see many injured bike riders. Izzie and Cristina rush to grab a patient. Meredith sees a man with bicycle spokes in his side. Alex and Meredith both run to help the man with bicycle spokes in his side. Behind a curtain, Alex and Meredith argue about who will take the patient. The patient, named Viper, pulls back the curtain and asks Alex and Meredith to remove the spokes so Viper can continue Viper's race. Meredith tells Alex that Meredith and Alex need to run some tests first. Alex ignores Meredith and removes the spokes from Viper, saying the wound is superficial and does not need surgery. Alex leaves Meredith to stitch up the wound. **Analysis:** This segment contains multiple scene shifts: - The first part is Bailey talking to the interns at the hospital about the bike riders. - The second part is Webber, Burke, and Shepherd at the O.R. schedule board (still at the hospital, but a different narrative focus). - Then, Bailey returns to the group and gives instructions. - The interns run to the ER and start treating patients (shift to the ER, new narrative focus). - The focus narrows to Alex and Meredith with Viper behind a curtain (new scene). **Correction:** Split into three scenes:",
  "At the hospital, Bailey complains to the interns about the bike riders, saying the bike riders are just fools killing themselves. Alex asks George if Bailey is off Bailey's medication. George is surprised that Alex has never heard of the race.",
  "Webber, Burke, and Shepherd stand in front of the O.R. schedule board. Webber, Burke, and Shepherd notice the schedule is well done and think Webber, Burke, and Shepherd might get an early night. Bailey tells Webber, Burke, and Shepherd that \"Dead baby bike race day\" started 20 minutes ago. George and Meredith explain that every year a bar holds an illegal underground bike race. Bailey complains again about bike messengers racing against traffic for free tequila shots. Bailey says Bailey needs someone to go up to the OR floor because the Chief needs help. Everyone except Meredith raises a hand, and Bailey chooses George. Bailey warns the others not to mingle with the E.R. interns, who Bailey says are inexperienced. Bailey tells the interns to sew quickly, discharge patients quickly, and take bodies to the OR immediately. Bailey warns the interns not to fight over patients.",
  "The interns run and push for position and see many injured bike riders. Izzie and Cristina rush to grab a patient. Meredith sees a man with bicycle spokes in his side. Alex and Meredith both run to help the man with bicycle spokes in his side. Behind a curtain, Alex and Meredith argue about who will take the patient. The patient, named Viper, pulls back the curtain and asks Alex and Meredith to remove the spokes so Viper can continue Viper's race. Meredith tells Alex that Meredith and Alex need to run some tests first. Alex ignores Meredith and removes the spokes from Viper, saying the wound is superficial and does not need surgery. Alex leaves Meredith to stitch up the wound. --- **Segment 4:**",
  "Cristina, Izzie, and Derek stand by a patient. Cristina explains to Derek that the patient is an unidentified man in his mid-thirties. The unidentified man was a pedestrian hit by a car that swerved to avoid a bike. Cristina says the unidentified man's Glasgow Coma Scale score is 3, the unidentified man's pupils are fixed and dilated, and the unidentified man was given atropine because the unidentified man's pulse was in the forties. Cristina continues to assess the unidentified man. Burke comments that the bike race has claimed its first victim. Izzie asks Derek if the unidentified man will go to the operating room. Derek tells Izzie to do confirmatory tests. Derek says if the unidentified man does not respond in six hours, Cristina, Izzie, and Derek should declare the unidentified man brain dead. **Analysis:** Single scene, continuous focus. No corrections needed. --- **Segment 5:**",
  "Webber is in surgery. George comes in and asks Webber if George should scrub in. Webber tells George not to scrub in because Webber will be in the operating room all day. Webber instructs George to monitor George's pre-op and post-op patients. Webber tells George to pay special attention to a friend in room 4451 named Lloyd Mackie. **Analysis:** Single scene, continuous focus. No corrections needed. --- **Segment 6:**",
  "Lloyd Mackie is in Lloyd Mackie's hospital bed. Lloyd Mackie lights a cigarette. George tells Lloyd Mackie to put it out and warns Lloyd Mackie that smoking is dangerous. Lloyd replies that liver cancer will kill Lloyd and the cigarettes only make it happen faster. George insists there is hope because Lloyd is at the top of the donor list. Lloyd says Lloyd has been at the top of the list for eight months. **Analysis:** Single scene, continuous focus. No corrections needed. --- **Segment 7:**",
  "Izzie and Cristina are with the unidentified man. Izzie worries that the unidentified man will not respond and says Cristina and Izzie only have five hours left. Cristina tells Izzie that if the unidentified man does not respond to the tests, the unidentified man is already dead. Cristina says Cristina wants the unidentified man to die soon so Cristina can get another case. Izzie is shocked and says it is a waste of the unidentified man's life. Cristina replies that it is also a waste of good organs. Izzie realizes Cristina wants the unidentified man's organs for transplant. **Analysis:** Single scene, continuous focus. No corrections needed. --- **Segment 8:**",
  "Meredith is sewing up Viper. While Meredith works, Viper flirts with Meredith. Meredith ignores Viper and asks Viper to let Meredith do some tests, promising Viper could leave in an hour. Viper refuses because Viper wants to finish the race. Meredith asks Viper to sign an AMA form before Viper leaves. Viper signs the form, gets up, and kisses Meredith before leaving. Meredith shakes Meredith's head and starts to strip the bed. **Analysis:** Single scene, continuous focus. No corrections needed. --- **Segment 9:**",
  "Meredith sees Derek standing outside. Derek comes in. Meredith asks Derek if Derek is jealous. Derek says Derek is not, but mentions Derek almost died today and asks how Meredith would feel if Meredith never got to go out with Derek. Meredith tells Derek to get over himself and asks if Derek just likes the chase. Derek is surprised. Meredith says it is just a game for Derek and storms out angrily. **Analysis:** Single scene, continuous focus. No corrections needed. --- **Segment 10:**",
  "Bailey is performing surgery. Izzie and Cristina enter the room. Izzie and Cristina ask Bailey if Izzie and Cristina can harvest organs from the unidentified man. Bailey is surprised. Bailey tells Izzie and Cristina they need to identify the unidentified man, contact the unidentified man's family, and get consent forms. Izzie and Cristina leave quickly to do this. **Analysis:** Single scene, continuous focus. No corrections needed. --- **Segment 11:**",
  "Alex goes to a desk where George is sitting. George tells Alex that George is hiding from Lloyd because George thinks Lloyd might be attracted to George. Alex jokes that George should go for it, but then Alex realizes George is not gay. George is shocked as Alex walks away. **Analysis:** Single scene, continuous focus. No corrections needed. --- **Segment 12:**",
  "Izzie and Cristina arrive at another desk. George asks Cristina if Cristina or Meredith think George is gay. Cristina asks George if George is gay, and when George says no, Cristina is surprised. **Analysis:** Single scene, continuous focus. No corrections needed. --- **Segment 13:**",
  "A woman approaches Izzie and Cristina. Izzie gives the woman a hotel key card and asks the woman to give it to the police. **Analysis:** Single scene, continuous focus. No corrections needed. --- **Segment 14:**",
  "After the woman leaves, George asks Izzie and Cristina if Izzie and Cristina really have a possible organ donor. George asks about the blood type and compares the blood type with George's chart. **Analysis:** Single scene, continuous focus. No corrections needed. --- **Segment 15:**",
  "Izzie goes to Izzie's John Doe patient. Izzie talks to John Doe, saying Izzie knows John Doe probably cannot hear Izzie. Izzie tells John Doe that Izzie feels John Doe has a family and asks John Doe to try to get better and live. Suddenly, an alarm sounds. John Doe starts to crash and John Doe's pulse drops. Meredith runs in. Izzie and Meredith decide to get dopamine and blood for a transfusion. **Analysis:** Single scene, continuous focus. No corrections needed. --- **Final Corrected Segments:**",
  "Meredith is in bed at 4:37am while it is raining. Izzie stands next to Meredith's bed, holding coffee. Izzie mentions that George's bedroom is bigger than Izzie's bedroom. Meredith gets out of bed but trips and falls on Meredith's face. Meredith limps away from the room. Izzie follows Meredith and says Izzie needs more space because Izzie has more clothes. George interrupts and says George got George's room first, but Izzie insists that Meredith should decide. George tells Izzie that George's room is only two inches bigger, but Izzie points out that George has a bigger closet. George suggests Izzie put Izzie's clothes somewhere else, but Izzie says all the spaces are filled with boxes belonging to Meredith's mother. Izzie and George ask Meredith if Izzie and George can put the boxes in storage or unpack some items like lamps, paintings, or pillows to make the house feel more comfortable. Izzie and George quickly ask if Izzie and George can watch the tapes of surgical procedures from one of the boxes. Meredith responds by slamming a door in Izzie and George's faces. A moment later, Meredith opens the door, takes Izzie's coffee, and shuts the door again. Meredith sits against the other side of the door, holding the coffee.",
  "Bailey stands on a street corner and looks confused. Shepherd joins Bailey and greets Bailey. Bailey tells Shepherd to be quiet because something important is supposed to happen today, but Bailey cannot remember what it is. Derek walks forward to cross the road. Bailey gasps and grabs Derek as several bike riders speed past and two of the bike riders crash.",
  "At the hospital, Bailey complains to the interns about the bike riders, saying the bike riders are just fools killing themselves. Alex asks George if Bailey is off Bailey's medication. George is surprised that Alex has never heard of the race.",
  "Webber, Burke, and Shepherd stand in front of the O.R. schedule board. Webber, Burke, and Shepherd notice the schedule is well done and think Webber, Burke, and Shepherd might get an early night. Bailey tells Webber, Burke, and Shepherd that \"Dead baby bike race day\" started 20 minutes ago. George and Meredith explain that every year a bar holds an illegal underground bike race. Bailey complains again about bike messengers racing against traffic for free tequila shots. Bailey says Bailey needs someone to go up to the OR floor because the Chief needs help. Everyone except Meredith raises a hand, and Bailey chooses George. Bailey warns the others not to mingle with the E.R. interns, who Bailey says are inexperienced. Bailey tells the interns to sew quickly, discharge patients quickly, and take bodies to the OR immediately. Bailey warns the interns not to fight over patients.",
  "The interns run and push for position and see many injured bike riders. Izzie and Cristina rush to grab a patient. Meredith sees a man with bicycle spokes in his side. Alex and Meredith both run to help the man with bicycle spokes in his side. Behind a curtain, Alex and Meredith argue about who will take the patient. The patient, named Viper, pulls back the curtain and asks Alex and Meredith to remove the spokes so Viper can continue Viper's race. Meredith tells Alex that Meredith and Alex need to run some tests first. Alex ignores Meredith and removes the spokes from Viper, saying the wound is superficial and does not need surgery. Alex leaves Meredith to stitch up the wound.",
  "Cristina, Izzie, and Derek stand by a patient. Cristina explains to Derek that the patient is an unidentified man in his mid-thirties. The unidentified man was a pedestrian hit by a car that swerved to avoid a bike. Cristina says the unidentified man's Glasgow Coma Scale score is 3, the unidentified man's pupils are fixed and dilated, and the unidentified man was given atropine because the unidentified man's pulse was in the forties. Cristina continues to assess the unidentified man. Burke comments that the bike race has claimed its first victim. Izzie asks Derek if the unidentified man will go to the operating room. Derek tells Izzie to do confirmatory tests. Derek says if the unidentified man does not respond in six hours, Cristina, Izzie, and Derek should declare the unidentified man brain dead.",
  "Webber is in surgery. George comes in and asks Webber if George should scrub in. Webber tells George not to scrub in because Webber will be in the operating room all day. Webber instructs George to monitor George's pre-op and post-op patients. Webber tells George to pay special attention to a friend in room 4451 named Lloyd Mackie.",
  "Lloyd Mackie is in Lloyd Mackie's hospital bed. Lloyd Mackie lights a cigarette. George tells Lloyd Mackie to put it out and warns Lloyd Mackie that smoking is dangerous. Lloyd replies that liver cancer will kill Lloyd and the cigarettes only make it happen faster. George insists there is hope because Lloyd is at the top of the donor list. Lloyd says Lloyd has been at the top of the list for eight months.",
  "Izzie and Cristina are with the unidentified man. Izzie worries that the unidentified man will not respond and says Cristina and Izzie only have five hours left. Cristina tells Izzie that if the unidentified man does not respond to the tests, the unidentified man is already dead. Cristina says Cristina wants the unidentified man to die soon so Cristina can get another case. Izzie is shocked and says it is a waste of the unidentified man's life. Cristina replies that it is also a waste of good organs. Izzie realizes Cristina wants the unidentified man's organs for transplant.",
  "Meredith is sewing up Viper. While Meredith works, Viper flirts with Meredith. Meredith ignores Viper and asks Viper to let Meredith do some tests, promising Viper could leave in an hour. Viper refuses because Viper wants to finish the race. Meredith asks Viper to sign an AMA form before Viper leaves. Viper signs the form, gets up, and kisses Meredith before leaving. Meredith shakes Meredith's head and starts to strip the bed.",
  "Meredith sees Derek standing outside. Derek comes in. Meredith asks Derek if Derek is jealous. Derek says Derek is not, but mentions Derek almost died today and asks how Meredith would feel if Meredith never got to go out with Derek. Meredith tells Derek to get over himself and asks if Derek just likes the chase. Derek is surprised. Meredith says it is just a game for Derek and storms out angrily.",
  "Bailey is performing surgery. Izzie and Cristina enter the room. Izzie and Cristina ask Bailey if Izzie and Cristina can harvest organs from the unidentified man. Bailey is surprised. Bailey tells Izzie and Cristina they need to identify the unidentified man, contact the unidentified man's family, and get consent forms. Izzie and Cristina leave quickly to do this.",
  "Alex goes to a desk where George is sitting. George tells Alex that George is hiding from Lloyd because George thinks Lloyd might be attracted to George. Alex jokes that George should go for it, but then Alex realizes George is not gay. George is shocked as Alex walks away.",
  "Izzie and Cristina arrive at another desk. George asks Cristina if Cristina or Meredith think George is gay. Cristina asks George if George is gay, and when George says no, Cristina is surprised.",
  "A woman approaches Izzie and Cristina. Izzie gives the woman a hotel key card and asks the woman to give it to the police.",
  "After the woman leaves, George asks Izzie and Cristina if Izzie and Cristina really have a possible organ donor. George asks about the blood type and compares the blood type with George's chart.",
  "Izzie goes to Izzie's John Doe patient. Izzie talks to John Doe, saying Izzie knows John Doe probably cannot hear Izzie. Izzie tells John Doe that Izzie feels John Doe has a family and asks John Doe to try to get better and live. Suddenly, an alarm sounds. John Doe starts to crash and John Doe's pulse drops. Meredith runs in. Izzie and Meredith decide to get dopamine and blood for a transfusion.",
  "Here is the analysis and correction according to your guidelines: **Segment 1:**",
  "George examines Mackie. Mackie flirts with George. - Valid: Yes. One location, one event/focus. --- **Segment 2:**",
  "Meanwhile, Izzie and Meredith go up some stairs. Cristina meets Izzie and Meredith and is excited about the possibility of John Doe becoming an organ donor. Izzie insists John Doe should get surgery to survive. Cristina tells Meredith that Cristina and Meredith need to go to someone higher than Bailey for Cristina and Meredith's plan. - Valid: Yes. All actions are continuous, same thematic focus. --- **Segment 3:**",
  "Meredith and Cristina go to the men's bathroom and see Burke. Meredith and Cristina ask Burke to repair John Doe's heart. Burke comments that Meredith and Cristina like to cross the line and tells Meredith and Cristina to either expose themselves or leave. - Valid: Yes. One location, one event. --- **Segment 4:**",
  "Meredith asks Derek for advice. Derek hesitantly tells Meredith to go over Burke's head and talk to the Chief. - Valid: Yes. One conversation, one focus. --- **Segment 5:**",
  "Izzie, Meredith, and Cristina ask George if George wants to join a transplant surgery. Webber asks George about Mackie's condition. George tells Webber that George and the others might have a liver for Mackie. Webber listens carefully. Alex notices Izzie, Meredith, and Cristina watching George and Webber. Burke walks by, and Webber stops Burke to tell Burke about the surgery. Burke looks at Izzie, Meredith, Cristina, and Alex. Izzie, Meredith, and Cristina quickly leave. Alex stays behind. When Burke starts to leave, Alex follows Burke. - Valid: Yes. All actions are in the same location, continuous narrative, no major thematic or location shift. --- **Segment 6:**",
  "During the open heart surgery, Alex helps Burke. Izzie, Meredith, and Cristina watch from the gallery and glare at Alex. Izzie is happy because Izzie's patient is getting the surgery. - Valid: Yes. One event, one location. --- **Segment 7:**",
  "A nurse comes in and tells Izzie that John Doe has been identified. The nurse says John Doe's wife is coming. Derek brings Shelley Davidson to Izzie. Derek leaves and tells Izzie and Shelley to page Derek if Izzie and Shelley need help. Izzie explains to Shelley that Kevin might wake up, but if Kevin does not improve by morning, Izzie and the others want to know if Shelley has thought about organ donation for Kevin. - Valid: Yes. One location, one continuous event. --- **Segment 8:**",
  "Webber gently shakes Mackie's shoulder. Webber tells Mackie that George found Mackie a liver. Mackie looks at Webber and then at George. Mackie starts to cry and looks away. Webber pats Mackie's shoulder. George leaves the room. - Valid: Yes. One event, one location. --- **Segment 9:**",
  "Alex rushes into the locker room and finds Meredith. Alex tells Meredith that Alex smells like open-heart surgery and nuzzles Meredith's hair. Meredith turns around, grabs Alex, and pushes Alex against the lockers by Alex's shirt. Meredith tells Alex to stay away from Meredith and says Alex smells bad. Meredith turns and sees Derek. Meredith goes back to Meredith's locker. Meredith then tries to attack Alex again, but Derek tells Alex to leave. Derek pushes Alex out and closes the door. Alex makes a face at Meredith. Meredith closes Meredith's locker and gets ready to leave. Derek opens the door for Meredith. Meredith looks at Derek for a few seconds, then walks away. - Valid: Yes. All in the locker room, continuous action. --- **Segment 10:**",
  "Meredith goes home. Izzie and George are watching video tapes. Meredith is angry and asks why Izzie and George touched Ellis's surgical tapes. Meredith storms upstairs. Izzie and George look at each other and laugh. - Valid: Yes. One location, one event. --- **Segment 11:**",
  "Outside the hospital, Meredith talks to Cristina. Meredith complains about Izzie and George being too cheerful and helpful. Cristina suggests that Meredith should kick Izzie and George out, but Meredith says Meredith cannot do that. Alex joins Meredith and Cristina as they enter the hospital. Alex complains about being assigned to the pit again and says Cristina gets the harvest surgery. Meredith and Cristina are annoyed with Alex and joke about becoming lesbians. The elevator arrives, but Meredith, Cristina, and Alex choose to take the stairs. - Valid: Yes. Continuous action, same location, no major thematic shift. --- **Segment 12:**",
  "Cristina talks to Shelley and Shelley's daughter. Cristina goes over the organ donation form with Shelley. When Shelley starts to cry, Cristina leaves the room and tells Bailey that Cristina is not good with people and finds it too hard. Bailey tells Cristina that it is not supposed to be easy and reminds Cristina that Kevin is a person, not just someone to take organs from. Cristina remembers this and goes back to talk to Shelley again. - Valid: Yes. Continuous narrative, same thematic focus. --- **Segment 13:**",
  "Mackie starts to flirt with George again. George awkwardly tries to tell Mackie that George is not gay. Mackie smiles and says Mackie never thought George was gay. Mackie also says Mackie is not gay himself. Mackie tells George that dying gives Mackie freedom to act boldly, because no one can criticize Mackie anymore. Mackie asks George if there was ever someone George liked but could not have. After some time, George admits that George was attracted to Meredith. - Valid: Yes. One conversation, one location. --- **Segment 14:**",
  "During the organ harvest preparation, Burke talks about how Burke dislikes harvesting organs. Burke says Burke prefers saving lives, but harvesting ends one. Izzie quietly tells Kevin that Kevin did Kevin's best. Izzie says goodbye to Kevin. - Valid: Yes. One event, one location. --- **Segment 15:**",
  "Meredith and Alex are working in Trauma. Meredith notices Viper sitting in a chair. Meredith asks Alex why Viper is there and how long Viper has been waiting. Alex says Alex does not know because Alex was busy with other patients. Viper starts coughing. Meredith walks towards Viper, worried. Viper tries to stand up, but Viper collapses and blood comes out of Viper's mouth. Meredith lifts Viper's shirt and sees that Viper's stitches have opened. The area around Viper's wound is swollen, about the size of a small melon. Meredith puts Viper on a gurney. Meredith climbs on top of Viper and tries to hold Viper's wound closed. Meredith tells a nurse to inform the OR that Meredith is coming and to page Bailey. - Valid: Yes. One location, one continuous event. --- **Conclusion:** **No corrections are needed.** All segments are valid semantic scenes according to your guidelines. **Final Output:** Return the original segments as provided.",
  "Here is the analysis and correction according to your guidelines: **Analysis:** 1. **Segment 1:**",
  "Meredith and Viper arrive at the OR and go inside. Bailey tells Meredith to scrub in. Bailey tells Alex to go back downstairs as punishment for only focusing on the interesting cases. - All actions occur in the same location (OR) and are part of the same narrative focus (arrival and assignments). **Valid scene.** 2. **Segment 2:**",
  "Mackie is on the OR table, ready for anesthesia. The Chief tells Mackie to count backwards. Mackie counts and quickly falls asleep. - New focus: Mackie's surgery prep. **Valid scene.** 3. **Segment 3:**",
  "Izzie and Cristina scrub in for surgery. Webber and Burke enter the room. Webber says Webber will be next door when the team is ready. The team begins the operation. The team places the organs in plastic bags and sealed containers. The liver is put on ice. George takes the liver and gives it to Webber, who places it in Mackie. - There is a shift from prepping for surgery to the actual organ harvest and then to the transplant. The sentence \"George takes the liver and gives it to Webber, who places it in Mackie.\" is a resolution of a different event (the transplant), which is a major event and should be a new scene. **Correction needed: Split after \"The liver is put on ice.\"** 4. **Segment 4:**",
  "Back at the harvest, an alarm starts beeping as the heart is removed. The team prepares to leave, but Izzie stays behind. Cristina looks back at Izzie. Izzie says Izzie wants to sew up the body for the family. Cristina returns to help Izzie. - All actions are part of the same narrative focus (finishing up the harvest and Izzie's emotional moment). **Valid scene.** 5. **Segment 5:**",
  "Later, Cristina and Izzie meet Shelley and tell Shelley that Shelley's loved one is ready. Cristina looks thoughtful at Viper's friends, who are waiting. Bailey and Meredith come out to see Viper's friends. Viper's friends ask if Viper is okay. Bailey begins shouting, asking if Viper is okay. Viper is not okay. Viper threw Viper's self down a concrete hill at high speed for no real reason. Bailey is upset because people act recklessly with their bodies. Bailey mentions that some people want to harm themselves by speeding down the hill. Bailey is also worried about others who use the hill, like walkers and drivers. Bailey says that today, someone got seriously hurt because of this reckless behavior. Meredith interrupts Bailey, so Bailey calms down and says again that Viper is not fine. Bailey then leaves the room angrily. - There is a shift from Cristina and Izzie talking to Shelley to Bailey and Meredith with Viper's friends. The sentence \"Cristina looks thoughtful at Viper's friends, who are waiting.\" is a transition, but the main focus shifts to the conversation with Viper's friends and Bailey's outburst. **Correction needed: Split after \"tell Shelley that Shelley's loved one is ready.\"** 6. **Segment 6:**",
  "After Bailey leaves, Meredith tells Viper's friends that Bailey is just tired. Meredith also says that Viper will survive. - This is a direct continuation of the previous conversation, but Bailey has left and the focus is now on Meredith reassuring Viper's friends. **Valid scene.** 7. **Segment 7:**",
  "Later, Meredith is in the locker room packing Meredith's things. Derek enters, closes the door, and talks to Meredith. Derek tells Meredith that Derek is interested in Meredith because of Meredith's hair, not because of a game or a chase. Meredith looks surprised, so Derek explains that Meredith's hair smells good. Derek also says Derek likes Meredith's bossy attitude. Meredith tells Derek Meredith still will not go out with Derek. Derek leaves and says Meredith will change Meredith's mind. - All actions are in the locker room, focused on Meredith and Derek's conversation. **Valid scene.** 8. **Segment 8:**",
  "Meanwhile, George tells Mackie that Mackie's surgery went well. Mackie sighs and says Mackie needs to stop smoking. Mackie smiles and holds George's hand. - New location, new characters, new focus. **Valid scene.** 9. **Segment 9:**",
  "Meredith goes home and opens Meredith's front door. Izzie, Cristina, and George are inside. Izzie, Cristina, and George are eating pizza, drinking beer, and watching a surgical video. When Meredith enters, Izzie, Cristina, and George all look at Meredith. George quickly says that Cristina made Izzie, George, and Cristina watch the tapes. Cristina looks annoyed at George. Meredith asks what Izzie, Cristina, and George are watching, sits down, and takes some popcorn. Izzie, Cristina, George, and Meredith all watch the video for a few seconds. - All actions are in the same location, same narrative focus. **Valid scene.** 10. **Segment 10:**",
  "Suddenly, Izzie, Cristina, George, and Meredith all jump back, screaming and laughing in shock at what Izzie, Cristina, George, and Meredith see on the tape. - This is a direct continuation, but the \"suddenly\" marks a new event (the reaction to the video). **Valid scene.** --- **Corrected Segments:**",
  "Meredith and Viper arrive at the OR and go inside. Bailey tells Meredith to scrub in. Bailey tells Alex to go back downstairs as punishment for only focusing on the interesting cases.",
  "Mackie is on the OR table, ready for anesthesia. The Chief tells Mackie to count backwards. Mackie counts and quickly falls asleep.",
  "Izzie and Cristina scrub in for surgery. Webber and Burke enter the room. Webber says Webber will be next door when the team is ready. The team begins the operation. The team places the organs in plastic bags and sealed containers. The liver is put on ice.",
  "George takes the liver and gives it to Webber, who places it in Mackie.",
  "Back at the harvest, an alarm starts beeping as the heart is removed. The team prepares to leave, but Izzie stays behind. Cristina looks back at Izzie. Izzie says Izzie wants to sew up the body for the family. Cristina returns to help Izzie.",
  "Later, Cristina and Izzie meet Shelley and tell Shelley that Shelley's loved one is ready.",
  "Cristina looks thoughtful at Viper's friends, who are waiting. Bailey and Meredith come out to see Viper's friends. Viper's friends ask if Viper is okay. Bailey begins shouting, asking if Viper is okay. Viper is not okay. Viper threw Viper's self down a concrete hill at high speed for no real reason. Bailey is upset because people act recklessly with their bodies. Bailey mentions that some people want to harm themselves by speeding down the hill. Bailey is also worried about others who use the hill, like walkers and drivers. Bailey says that today, someone got seriously hurt because of this reckless behavior. Meredith interrupts Bailey, so Bailey calms down and says again that Viper is not fine. Bailey then leaves the room angrily.",
  "After Bailey leaves, Meredith tells Viper's friends that Bailey is just tired. Meredith also says that Viper will survive.",
  "Later, Meredith is in the locker room packing Meredith's things. Derek enters, closes the door, and talks to Meredith. Derek tells Meredith that Derek is interested in Meredith because of Meredith's hair, not because of a game or a chase. Meredith looks surprised, so Derek explains that Meredith's hair smells good. Derek also says Derek likes Meredith's bossy attitude. Meredith tells Derek Meredith still will not go out with Derek. Derek leaves and says Meredith will change Meredith's mind.",
  "Meanwhile, George tells Mackie that Mackie's surgery went well. Mackie sighs and says Mackie needs to stop smoking. Mackie smiles and holds George's hand.",
  "Meredith goes home and opens Meredith's front door. Izzie, Cristina, and George are inside. Izzie, Cristina, and George are eating pizza, drinking beer, and watching a surgical video. When Meredith enters, Izzie, Cristina, and George all look at Meredith. George quickly says that Cristina made Izzie, George, and Cristina watch the tapes. Cristina looks annoyed at George. Meredith asks what Izzie, Cristina, and George are watching, sits down, and takes some popcorn. Izzie, Cristina, George, and Meredith all watch the video for a few seconds.",
  "Suddenly, Izzie, Cristina, George, and Meredith all jump back, screaming and laughing in shock at what Izzie, Cristina, George, and Meredith see on the tape."
]