[
  "Near a large forest, a poor woodcutter lived with his wife and two children. The boy was named Hansel, and the girl was named Gretel. The family had very little to eat. When a severe famine struck the land, the woodcutter couldn't even provide daily bread. One evening, while in bed, the woodcutter worried about their situation. The woodcutter asked his wife how they could feed Hansel and Gretel when they had nothing for themselves. The wife suggested taking Hansel and Gretel into the thickest part of the woods the next morning. She planned to make a fire, give Hansel and Gretel a small piece of bread each, and leave them there while she and the woodcutter went to work. She believed Hansel and Gretel wouldn't find their way back home, solving their problem. The woodcutter disagreed with his wife's plan. He refused to leave Hansel and Gretel alone in the woods, fearing wild animals would harm them. The wife insisted that if they didn't, all four would starve, and pressured the woodcutter until he agreed. The woodcutter felt sorry for Hansel and Gretel. Hansel and Gretel, unable to sleep due to hunger, overheard the conversation. Gretel cried and told Hansel they were doomed. Hansel reassured Gretel not to worry. He knew what to do. Once the adults were asleep, Hansel got up, put on his jacket, and quietly went outside. The moon was bright, and the white pebbles looked like silver coins. Hansel filled Hansel's jacket pockets with as many pebbles as possible. Hansel returned to the house and reassured Gretel, telling Gretel to sleep well and that they would not be abandoned. Then Hansel went back to bed.",
  "At daybreak, before sunrise, the wife woke Hansel and Gretel, calling them lazy. The family was going into the woods to gather wood. The wife gave each child a small piece of bread, telling them it was for midday and not to eat it early since there wouldn't be more. Gretel hid Gretel's bread under Gretel's apron because Hansel's pockets were full of stones. They all started walking into the woods together.",
  "After a short distance, Hansel kept stopping and looking back at the house. The woodcutter asked Hansel why Hansel was stopping and reminded Hansel to keep moving. Hansel replied that Hansel was looking at Hansel's white cat on the roof, which seemed to want to say goodbye. The wife told Hansel he was foolish, saying it wasn't Hansel's cat. Hansel was dropping shiny pebbles onto the path instead of looking at Hansel's cat.",
  "When they reached the middle of the woods, the woodcutter asked Hansel and Gretel to gather wood so the woodcutter could make a fire. Hansel and Gretel collected a large pile of twigs. The twigs were set on fire, and the flames grew strong. The wife told Hansel and Gretel to rest by the fire while she and the woodcutter went to cut wood. The wife promised Hansel and Gretel they would return later. Hansel and Gretel sat by the fire and ate their small pieces of bread at midday. Hansel and Gretel heard the sound of an ax and thought the woodcutter was nearby, but it wasn't an ax. The woodcutter had tied a branch to a dead tree, and the wind moved it back and forth. Hansel and Gretel sat for a long time until their eyes closed, and they fell asleep.",
  "When Hansel and Gretel woke up, it was dark. Gretel cried, worried about finding their way out of the woods. Hansel reassured Gretel to wait for the moon to rise. Once the full moon appeared, Hansel took Gretel's hand. Hansel and Gretel followed the pebbles that shone like coins, guiding them. Hansel and Gretel walked all night and reached the woodcutter's house at dawn.",
  "Hansel and Gretel knocked, and when the wife opened the door and saw them, she accused them of being wicked for staying in the woods so long, thinking they didn't want to return. The woodcutter was very happy to see Hansel and Gretel again because he didn't want to leave them alone.",
  "Soon after, there was a severe shortage of food everywhere. One evening, Hansel and Gretel heard the wife telling the woodcutter that they had eaten almost everything. The wife mentioned they only had half a loaf of bread left and insisted they must abandon Hansel and Gretel deeper in the woods so they couldn't return. The woodcutter felt very sad and thought it would be better to share the remaining food with Hansel and Gretel. However, the wife refused to listen and criticized the woodcutter. The wife insisted that since the woodcutter agreed the first time, the woodcutter must agree again. Hansel and Gretel were still awake and heard everything.",
  "When the adults were asleep, Hansel tried to gather pebbles again. However, the wife had locked the door, so Hansel couldn't go outside. Hansel reassured Gretel, telling Gretel not to cry and to sleep well, believing that help would come.",
  "Early the next morning, the wife woke Hansel and Gretel and took them from their beds. Hansel and Gretel received smaller pieces of bread than before. As they walked to the woods, Hansel crumbled his bread in his pocket. Hansel often stopped to drop crumbs on the ground. The woodcutter noticed and asked why Hansel kept stopping and looking around, telling Hansel to keep walking straight. Hansel thought he saw his pigeon on the roof, wanting to say goodbye. The wife told Hansel it was just the morning sun on the chimney. Hansel slowly dropped crumbs along the path. The wife led Hansel and Gretel deeper into the woods than ever before. The wife and the woodcutter made a large fire. The wife told Hansel and Gretel to sit and rest if tired. The wife said they were going to cut wood and would return in the evening.",
  "At midday, Gretel shared her bread with Hansel. Hansel had scattered his bread along the path. Hansel and Gretel fell asleep, and evening passed without anyone coming for them.",
  "When Hansel and Gretel woke up at night, Hansel comforted Gretel. Hansel said they should wait for the moon to find the bread crumbs he had left to guide them home. When the moon appeared, Hansel and Gretel got up but couldn't find any crumbs. Birds had eaten them. Hansel reassured Gretel they would find their way, but they couldn't.",
  "Hansel and Gretel walked all night and the next day until evening without finding a way out of the woods. Hansel and Gretel were very hungry, having only eaten a few berries. Exhausted, Hansel and Gretel lay down under a tree and fell asleep. It was the third morning since they left their father's house. Hansel and Gretel started walking again but only went deeper into the woods. If help didn't arrive soon, Hansel and Gretel would die.",
  "Around midday, Hansel and Gretel noticed a small white bird on a branch. The bird sang so beautifully that Hansel and Gretel paused to listen. After singing, the bird spread its wings and flew ahead of them. Hansel and Gretel followed it to a small house. The bird perched on the roof.",
  "As Hansel and Gretel got closer, they saw the house was made of bread, with a cake roof and sugar windows. Hansel suggested they eat, saying he would try the roof while Gretel could eat the window. Hansel broke off a piece of the roof to taste it. Gretel stood by the windows, nibbling on them. A gentle voice from inside asked who was nibbling at the house. Hansel and Gretel replied that it was the wind. They kept eating without stopping. Hansel enjoyed the roof and took another big piece. Gretel removed an entire round windowpane.",
  "Suddenly, the door opened. An old woman, leaning on a crutch, came out. Hansel and Gretel were so scared they dropped what they were holding. The old woman shook her head and asked who brought them there. The old woman invited them inside, assuring them no harm would come. The old woman took Hansel and Gretel's hands and led them into her house. She served them a meal of milk, pancakes with sugar, apples, and nuts. Then she prepared two nice beds with white sheets. Hansel and Gretel went to sleep, feeling like they were in heaven. However, the old woman was pretending to be kind.",
  "The old woman was actually a wicked witch waiting for children. The witch built her house of bread to attract them. If the witch caught a child, she would kill, cook, and eat the child, which she considered a celebration. Witches have red eyes and can't see far, but they can smell like animals and know when people are near. When Hansel and Gretel approached, the witch laughed wickedly and thought Hansel and Gretel wouldn't escape.",
  "Early the next morning, before Hansel and Gretel woke up, the witch went to their beds and looked at Hansel and Gretel sleeping peacefully with their rosy cheeks. The witch thought Hansel and Gretel would be a good meal.",
  "The witch grabbed Hansel with her old hand and locked Hansel in a small cage. Hansel cried, but no one could help Hansel. The witch then shook Gretel and told Gretel to get up and fetch water. Gretel was ordered to cook something good for Hansel, who was locked outside to be fattened up. The witch planned to eat Hansel once he was fat. Gretel cried, but Gretel had to obey. Hansel was given the best food every day, while Gretel only got crayfish shells. Each morning, the old woman went to the stall. The witch asked Hansel to stick out his finger to check if he was fat. Hansel showed a small bone instead. The witch, with poor eyesight, thought it was Hansel's finger. The witch wondered why Hansel wasn't getting fat. After four weeks, Hansel was still thin. The witch became impatient and decided not to wait any longer. The witch called Gretel and told Gretel to fetch water. The witch said that whether Hansel was fat or thin, she would slaughter and boil Hansel the next day. Gretel cried as Gretel carried the water. Tears ran down Gretel's cheeks. Gretel prayed for help, wishing Hansel and Gretel had been eaten by wild animals in the woods so they could have died together. The witch told Gretel to stop crying.",
  "The next morning, Gretel woke up early. Gretel hung up the kettle with water and started a fire. The witch told Gretel they would bake first. The witch mentioned she had already made a fire in the oven and prepared the dough. The witch pushed Gretel outside to the oven, where flames were leaping. The witch instructed Gretel to climb in and check if it was hot enough for the bread. The witch planned to close the oven and bake Gretel to eat her. Gretel realized this and said Gretel didn't know how to get inside. The witch called Gretel a stupid goose. The opening was big enough for the witch to crawl in. The witch stuck her head into the oven. Gretel pushed the witch, making her fall inside. Gretel closed the iron door and secured it with a bar. The witch began to howl loudly. Gretel ran away, and the witch burned up.",
  "Gretel went to Hansel, unlocked his stall, and told Hansel they were saved because the witch was dead. Hansel jumped out like a bird from a cage when its door is opened. Hansel and Gretel were very happy. They hugged, jumped with joy, and kissed each other.",
  "Feeling safe, Hansel and Gretel entered the witch's house. They found chests of pearls and precious stones in every corner. Hansel thought these were better than pebbles and filled his pockets. Gretel decided to take some too and filled her apron. Hansel said they must leave the witch's woods.",
  "After walking for a few hours, Hansel and Gretel reached a large body of water. Hansel noted they couldn't cross because there was no walkway or bridge. Gretel noticed there were no boats but saw a white duck swimming. Gretel thought the duck could help Hansel and her cross. Gretel called to the duck, asking it to carry them on its back. The duck came, and Hansel climbed on first. Hansel asked Gretel to join him. Gretel said it would be too heavy for the duck and suggested they go one at a time. The duck agreed and took them across separately.",
  "Once on the other side, Hansel and Gretel walked until the woods became familiar. They eventually saw their father's house in the distance. Hansel and Gretel ran inside and hugged their father. The father felt unhappy since leaving Hansel and Gretel in the woods. The stepmother had passed away. Gretel emptied her apron, spreading pearls and precious stones in the room. Hansel added more by tossing handfuls from his pockets. Their worries were over, and they lived happily together.",
  "The story ends with a mouse running, suggesting whoever catches it can make a big fur cap."
]