[
  {
    "title": "Meredith and Derek's Complicated Romance",
    "arc_type": "Soap Arc",
    "description": "Meredith and Derek's relationship begins with a one-night stand and evolves into a complicated romance, affecting their professional lives and friendships.",
    "episodic": false,
    "main_characters": "Meredith Grey; Derek Shepherd",
    "interfering_episode_characters": "Miranda Bailey; George O'Malley; Izzie Stevens",
    "single_episode_progression_string": "Meredith and Derek share a tense elevator ride where Meredith sets boundaries, accusing Derek of sexual harassment. Despite this, they share a passionate kiss. Later, Derek expresses interest in ferry boats, hinting at his continued interest in Meredith."
  },
  {
    "title": "Intern Dynamics and Challenges",
    "arc_type": "Genre-Specific Arc",
    "description": "The new interns at Seattle Grace Hospital face various challenges as they adjust to their roles, navigate relationships, and compete for opportunities.",
    "episodic": false,
    "main_characters": "Meredith Grey; Cristina Yang; Izzie Stevens; George O'Malley; Alex Karev",
    "interfering_episode_characters": "Miranda Bailey",
    "single_episode_progression_string": "The interns struggle with their tasks and compete for Bailey's approval. Meredith deals with the responsibility of handling a sensitive case involving a rape victim. Cristina is frustrated with constant hugs from patients. Izzie faces language barriers with a patient and secretly helps an undocumented worker."
  },
  {
    "title": "George's Struggles and Growth",
    "arc_type": "Genre-Specific Arc",
    "description": "George O'Malley faces challenges as an intern, dealing with self-doubt and striving to prove himself in a competitive environment.",
    "episodic": false,
    "main_characters": "George O'Malley",
    "interfering_episode_characters": "Meredith Grey; Cristina Yang",
    "single_episode_progression_string": "George forgets his badge and faces embarrassment. He is part of the code team but struggles with the pressure of calling time of death. He expresses a desire to be Meredith's roommate but is rejected."
  },
  {
    "title": "Medical Case: Allison's Assault and Recovery",
    "arc_type": "Episodic Arc",
    "description": "The episode focuses on the case of Allison, a rape victim found with severe injuries, and the medical team's efforts to treat her.",
    "episodic": true,
    "main_characters": "Meredith Grey; Derek Shepherd; Preston Burke",
    "interfering_episode_characters": "Miranda Bailey; Richard Webber",
    "single_episode_progression_string": "Meredith is emotionally affected by Allison's case due to their shared taste in shoes. The medical team discovers the rapist's penis was the cause of Allison's injury. Derek and Burke discuss Allison's recovery, and Derek performs an emergency craniotomy."
  },
  {
    "title": "Professional Rivalry: Burke and Derek",
    "arc_type": "Genre-Specific Arc",
    "description": "Burke and Derek's professional rivalry intensifies as they vie for the position of Chief of Surgery.",
    "episodic": false,
    "main_characters": "Preston Burke; Derek Shepherd",
    "interfering_episode_characters": "Richard Webber",
    "single_episode_progression_string": "Burke questions Richard about Derek's presence at Seattle Grace, suspecting competition for Chief of Surgery. Burke declines Derek's offer for a drink, acknowledging the rivalry."
  },
  {
    "title": "Izzie's Compassionate Care",
    "arc_type": "Episodic Arc",
    "description": "Izzie goes beyond her duties to provide care for patients, showing her compassionate nature.",
    "episodic": true,
    "main_characters": "Izzie Stevens",
    "interfering_episode_characters": "Ms. Lu; Ahn",
    "single_episode_progression_string": "Izzie struggles with a language barrier while treating Ms. Lu and secretly helps her daughter, Ahn, who is injured and undocumented. She provides medical care outside the hospital's regulations."
  }
]