[
  "Meredith Grey goes into the locker room and posts a notice about needing a roommate. George O'Malley parks his car at the hospital but forgets his badge, so George O'Malley goes back to get it and accidentally honks the horn. Isobel Stevens calls an elevator, and when it opens, it's full of men staring at Isobel Stevens, making her feel uneasy. Cristina Yang arrives at the hospital on her motorcycle and nearly hits George O'Malley. Cristina Yang quickly parks and runs inside. The interns start putting on their scrubs. Meredith Grey places her leopard print shoes in her locker. Meredith Grey talks to an intern interested in being her roommate but decides the intern isn't suitable and declines. Isobel Stevens questions Meredith Grey about why Meredith Grey posts roommate notices if she seems uninterested in having one. Meredith Grey confirms she has a coffee for Miranda Bailey. Cristina Yang notices and accuses Meredith Grey of bribing. George O'Malley mentions his mom irons his scrubs and hints he wants to be Meredith Grey's roommate, but Meredith Grey disagrees. Isobel Stevens also tries to ask, but Meredith Grey refuses. Meredith Grey explains she wants two strangers as roommates so she doesn't have to interact with them.",
  "Miranda Bailey arrives and gives the interns their tasks. As Miranda Bailey goes upstairs, Meredith Grey asks to assist in the OR and offers a mocha latte. The interns crowd Miranda Bailey, insisting if Meredith Grey gets to assist, they should too. Miranda Bailey tells them their job is to make their resident happy, which Miranda Bailey isn't. Miranda Bailey takes the mocha latte and says the interns won't use a scalpel until Miranda Bailey is as happy as Mary Poppins.",
  "Meredith Grey then heads to an elevator where Derek Shepherd is waiting. Derek Shepherd recently discovered that Seattle has ferry boats because Derek Shepherd has only lived there for six weeks. As the elevator doors open, Derek Shepherd mentions he's from New York. When the doors close, Meredith Grey tells Derek Shepherd she won't date him. Derek Shepherd responds that he never asked, but inquires if Meredith Grey would like to. Meredith Grey declines and adds she won't sleep with Derek Shepherd because he is her boss. Derek Shepherd dismisses Meredith Grey's comment, and Meredith Grey accuses Derek Shepherd of sexual harassment. Meredith Grey insists she's setting boundaries, and Derek Shepherd jokingly asks if Meredith Grey needs a marker. Meredith Grey glares at Derek Shepherd, drops her folders, and they kiss until the doors open. Meredith Grey then picks up her folders and leaves.",
  "Meredith Grey goes to a trauma room where a nurse informs her about a rape victim found in the park with severe injuries. Meredith Grey notices the victim's shoes are like hers and starts to zone out. A nurse calls Meredith Grey, and she quickly begins giving orders.",
  "The rape victim is in surgery. Derek Shepherd mentions the victim will need a lot of recovery and rehab time. Derek Shepherd is surprised the victim survived the attack. Preston Burke observes the victim tried to fight back. Derek Shepherd comments that Allison fought hard since the rape kit was negative. Preston Burke calls Allison a warrior, but Meredith Grey says her name is Allison. Preston Burke identifies the cause of the rupture but doesn't know what it is. Meredith Grey explains it's the rapist's penis, and the doctors react with disgust. As Derek Shepherd and Preston Burke finish up, they talk about Allison's recovery. Preston Burke suggests getting a drink later and asks Derek Shepherd why Derek Shepherd left New York for Seattle. Derek Shepherd says there's nothing to tell; Webber made Derek Shepherd an offer Derek Shepherd couldn't refuse and leaves.",
  "George O'Malley boasts to Cristina Yang about being on the code team, but Cristina Yang tells George O'Malley to stop talking. Cristina Yang claims she has a B.A. from Smith, a PhD from Berkeley, and an M.D. from Stanford. Cristina Yang is delivering labs and says it will take her all day. Miranda Bailey overhears and tells Cristina Yang to get started. Cristina Yang tries to explain she wasn't complaining, but Miranda Bailey insists. Miranda Bailey mentions she has reassigned an intern to Cristina Yang. Cristina Yang should show the intern how Miranda Bailey operates. The intern introduces himself as Alex Karev. Cristina Yang recalls Alex Karev called Meredith Grey a nurse and tells Alex Karev she dislikes him on principle. Alex Karev responds that he feels the same as Alex Karev and Cristina Yang walk away.",
  "George O'Malley's pager beeps, and George O'Malley leaves. George O'Malley runs down a corridor with the code team following. The patient is crashing and has no heartbeat. George O'Malley starts giving orders and instructs a nurse to charge the paddles.",
  "Isobel Stevens tells Ms. Lu, a Chinese woman, that Ms. Lu needs six stitches and asks about any medication allergies. Ms. Lu speaks in Cantonese, asking if Isobel Stevens understands Cantonese and can help her. Isobel Stevens then asks if Ms. Lu knows any English. Ms. Lu replies in Cantonese, saying her daughter outside has worse injuries, while Ms. Lu only hurt her arm. Isobel Stevens asks if anyone in the room speaks Chinese, but no one responds.",
  "Meredith Grey goes to the Chief's office. Patricia is there and realizes the box contains the rapist's penis. Patricia asks to see it but quickly changes her mind. Richard enters and mentions hearing that Meredith Grey's mother is leaving Mayo. Meredith Grey explains her mother is just taking a break. Meredith Grey tells Richard she was instructed to bring the \"penis box\" to him. Richard corrects Meredith Grey, saying the police need it, and she must keep it until it is handed over to them, as all medical evidence must stay with the collector until police custody.",
  "Cristina Yang and Alex Karev give lab results to a family. Cristina Yang and Alex Karev inform the patient about a disorder called multinucleate cell angiohistiocytoma. It's not cancerous, just a rare and minor disease. The patient will be discharged that day. The family feels relieved, and one member hugs Cristina Yang. Cristina Yang glares at Alex Karev, who smiles at her.",
  "Meredith Grey places a box on a counter where George O'Malley is working. George O'Malley asks about it, and Meredith Grey says he doesn't want to know. George O'Malley insists, so Meredith Grey tells him. George O'Malley regrets asking. Cristina Yang and Alex Karev walk by, and Cristina Yang complains about being hugged often. Alex Karev says it's because Cristina Yang is an ovarian sister, which insults her. George O'Malley mentions Meredith Grey is carrying a penis in a jar. Cristina Yang looks, jokes about it, and leaves. George O'Malley asks Meredith Grey if she's okay. Meredith Grey explains that Allison has the same shoes she wore that day. Meredith Grey finds them uncomfortable and rarely wears them. Meredith Grey thinks the situation is foolish. George O'Malley believes he knows what Meredith Grey needs, but Meredith Grey disagrees. George O'Malley insists Meredith Grey can join him or remain unhappy.",
  "George O'Malley and Meredith Grey are outside the nursery, observing the babies. George O'Malley's pager goes off, indicating a code, so George O'Malley leaves Meredith Grey.",
  "While Meredith Grey watches, one baby's face turns blue. Meredith Grey enters to check on the baby. A pediatrics intern arrives and questions Meredith Grey's actions. Meredith Grey explains the baby has a murmur. The intern acknowledges this, but Meredith Grey is surprised and mentions the baby turned blue. The intern informs Meredith Grey she isn't authorized to be there. Meredith Grey asks about tests, but the intern says it's a benign condition that resolves with age. Meredith Grey is told to leave, and she does.",
  "Isobel Stevens brings Cristina Yang to help translate for Ms. Lu, thinking Cristina Yang knows Chinese. Ms. Lu repeatedly says her daughter is outside with a head injury and wants to help stitch it up but can't. Cristina Yang explains she is from Beverly Hills and only knows Chinese from a menu. Cristina Yang also mentions she is Korean and then leaves.",
  "Preston Burke asks Richard why Derek Shepherd was invited to Seattle Grace. Richard explains Derek Shepherd is a former student. Preston Burke suspects another reason and claims the Chief of Surgery position is his. Richard responds he won't be leaving soon, and Preston Burke leaves angrily.",
  "Cristina Yang talks to Alex Karev. Alex Karev asked how they would get OR time. Cristina Yang grabbed her files, handed some to Alex Karev, and told him to hurry. Cristina Yang and Alex Karev left together.",
  "Cristina Yang and Alex Karev delivered lab results to several patients. Cristina Yang got annoyed when one patient hugged her.",
  "George O'Malley rushed into a patient room with the code team. The patient flatlined, and George O'Malley had to call the time of death.",
  "Meredith Grey asked some interns about their favorite 80s group. The interns answered incorrectly, so Meredith Grey left.",
  "While Meredith Grey was looking at Allison, Derek Shepherd approached her. Derek Shepherd mentioned that the rapist would eventually need medical attention and that Meredith Grey had evidence to catch him. Meredith Grey inquired about Allison's family. Derek Shepherd explained Allison had none, as her parents were deceased and she had no siblings. Derek Shepherd asked Meredith Grey if she was okay, and Meredith Grey replied that she was fine.",
  "Meredith Grey then asked Preston Burke about a baby she saw turning blue in pediatrics. Preston Burke mentioned he can't proceed without a pediatric consultation.",
  "Isobel Stevens finishes bandaging a man's hand. The man tries to flirt with Isobel Stevens, but she realizes he is drunk. The man thinks he recognizes Isobel Stevens from a magazine. Isobel Stevens acknowledges this and tells the man to leave.",
  "Ms. Lu sits down, and Isobel Stevens starts stitching Ms. Lu's arm. Ms. Lu speaks in Chinese, but Isobel Stevens remains silent.",
  "Meredith Grey talks to Cristina Yang in the lobby. Meredith Grey and Cristina Yang notice a truck swerving into the parking lot. They go outside and see a man with blood-soaked clothes, especially around his crotch. The man collapses, and doctors and nurses gather around him. Meredith Grey realizes the man is the rapist.",
  "Inside, Meredith Grey calls security and shows Miranda Bailey the rapist. Miranda Bailey instructs Meredith Grey to take the rapist to OR 1 and inform the Chief.",
  "During the surgery, Cristina Yang and Meredith Grey discuss Allison and the rapist. Miranda Bailey asks why they can't reattach the penis. Meredith Grey explains they need a clean cut, and Allison's digestive juices damaged it. Meredith Grey mentions the rapist will use a bag to pee for a long time. Cristina Yang notes the rapist won't have sex again, calling it a shame. Miranda Bailey sarcastically suggests they mourn, then the team continues operating.",
  "Richard finishes in an OR and tells Preston Burke they have the rapist. The conversation shifts when Preston Burke asks Richard why he can't be Chief. Richard responds that Preston Burke only does what is necessary and nothing more, then walks away.",
  "Derek Shepherd is worried about Allison's recovery.",
  "Isobel Stevens finishes Ms. Lu's stitches and hears Ms. Lu speak in Chinese again. Isobel Stevens tells Ms. Lu she can't understand and has other patients, so Ms. Lu leaves.",
  "Alex Karev complains about a headache. Cristina Yang sarcastically hopes it's a brain tumor, saying she'd rip Alex Karev's face off if she could assist in surgery. Isobel Stevens joins them and mentions she's been suturing all day. George O'Malley points out Isobel Stevens is helping people, and Alex Karev adds she's practicing medicine. Isobel Stevens talks about Ms. Lu, but Cristina Yang ignores her.",
  "Meredith Grey arrives and says the police can't pick up the penis, so she has to keep it overnight. They all express frustration about being interns.",
  "Miranda Bailey enters, looking hopeful, and the interns leave. Meredith Grey sees the baby's parents and shares her worries. The pediatric intern tells Meredith Grey she's overstepping because she mentioned the murmur might not be harmless. The intern brings her resident, Dr. Kay. Dr. Kay asks what's happening, and Mr. and Mrs. Johnson say they want treatment if their child is sick. Dr. Kay inquires who informed them, and the intern points to Meredith Grey. Dr. Kay asks if Meredith Grey is allowed there, and Preston Burke says he authorized it. Preston Burke questions the intern's certainty about the murmur being harmless. When the intern says 75%, Preston Burke takes over the case and introduces himself to Mr. and Mrs. Johnson. The intern asks Dr. Kay if Preston Burke can take patients, and Dr. Kay confirms he can because he's an attending. Preston Burke introduces himself to Mr. and Mrs. Johnson again and gives Meredith Grey instructions.",
  "After Isobel Stevens finishes suturing, Isobel Stevens meets Ms. Lu. Ms. Lu is with a girl named Ahn, who has a large cut on her forehead. Isobel Stevens offers to help and examines the injury. Ahn explains that a machine broke at the factory and hurt her. Isobel Stevens suggests they go inside, but Ahn refuses because she doesn't have a green card and fears jail. Isobel Stevens tells them to wait while she gets supplies.",
  "Meanwhile, Meredith Grey talks to Preston Burke about a baby with a birth defect. Meredith Grey thanks Preston Burke for his help, but he warns her not to repeat her actions or he will make her residency very difficult.",
  "George O'Malley is trying to revive a patient.",
  "Cristina Yang delivers lab results to a patient and gets hugged repeatedly.",
  "Isobel Stevens gathers supplies to stitch Ahn's forehead. Derek Shepherd sits by Allison's bedside. George O'Malley announces the time of death for a patient who flatlined. Isobel Stevens stitches Ahn's forehead and mentions she could have done better with more light. Ahn reassures Isobel Stevens it's fine. Isobel Stevens instructs Ahn to return in five days to remove the stitches and gives Ahn her pager number. Isobel Stevens warns Ahn not to tell anyone she helped, as she could lose her job. As Ahn leaves, Ms. Lu returns to thank Isobel Stevens in her own language, then departs.",
  "Preston Burke asks Miranda Bailey if Preston Burke is too confident. Miranda Bailey says no, but Preston Burke feels Miranda Bailey is lying and tells Miranda Bailey she can speak freely for the next thirty seconds. Miranda Bailey starts listing negative things about Preston Burke. Preston Burke tries to interrupt, but Miranda Bailey insists she's not finished.",
  "In the locker room, Cristina Yang complains she needs a drink, a man, and a massage. George O'Malley mentions he lost five patients. Cristina Yang tells George O'Malley most code patients are already dead before George O'Malley arrives, then Cristina Yang leaves.",
  "Meredith Grey sits in a rocking chair in the nursery. The peds intern thought Meredith Grey was right, but Meredith Grey says interns are almost never right. The intern asks Meredith Grey if Meredith Grey feels terrified. Meredith Grey says yes, and the intern feels relieved it's not just her.",
  "Meredith Grey asks Derek Shepherd about Allison, and Derek Shepherd says there's no change. Derek Shepherd mentions he has four sisters, and if Derek Shepherd were in a coma, they'd all be there. Derek Shepherd talks about their relationship, but the focus shifts to Allison, who feels alone. As they talk, Allison's condition worsens. Derek Shepherd tells the team to prepare the OR for an emergency craniotomy.",
  "After the surgery, Derek Shepherd updates Meredith Grey about Allison. Meredith Grey asks if Allison will survive, and Derek Shepherd says she will if she wakes up.",
  "Derek Shepherd asks Preston Burke about a drink they mentioned earlier. Preston Burke now declines, saying Derek Shepherd is just competition for Chief of Surgery, and Preston Burke walks away.",
  "Meredith Grey signs a paper about the penis box with Patricia's help. Richard tries to say \"penis,\" noting it shouldn't be awkward since Richard is a doctor, but he used to change Meredith Grey's diapers. Richard then gives the penis box to the police, and Meredith Grey leaves.",
  "The Johnson baby is in surgery. Preston Burke explains the procedure to the team. Preston Burke starts to open the baby's chest and tells Meredith Grey to scrub in because Preston Burke will let her hold the clamp. Meredith Grey quickly goes to the scrub room.",
  "Derek Shepherd enters the rapist's room angrily and hits the bed to wake him. Derek Shepherd informs the rapist that Miranda Bailey stopped his bleeding but his penis was given to the police, then Derek Shepherd leaves. The rapist notices the rapist is handcuffed to the bed.",
  "Cristina Yang and Alex Karev deliver more test results. Cristina Yang tells a patient their tumor is benign, so the patient can go home. The patient hugs the patient's husband, who then tries to hug Cristina Yang. Cristina Yang quickly pushes Alex Karev in the way, so Alex Karev receives the hug instead. Cristina Yang leaves, satisfied.",
  "Preston Burke operates on the Johnson baby while Meredith Grey holds the clamp.",
  "The interns watch the babies in the nursery. Meredith Grey tells Isobel Stevens and George O'Malley they can move in. Isobel Stevens and George O'Malley get excited and hug each other.",
  "Allison starts waking up, and Derek Shepherd welcomes Allison back.",
  "Meredith Grey goes to an elevator where Derek Shepherd is waiting. Derek Shepherd mentions Derek Shepherd really likes ferry boats. After looking at Derek Shepherd, Meredith Grey decides to take the stairs. Derek Shepherd feels sorry for Meredith Grey's \"lack of self-control.\"",
  "Meredith Grey leaves the hospital to join George O'Malley, Isobel Stevens, and Cristina Yang."
]