[
  {
    "title": "Meredith and Derek's Complicated Relationship",
    "arc_type": "Soap Arc",
    "description": "Meredith and Derek's relationship begins with a one-night stand and evolves amidst professional challenges and personal revelations.",
    "episodic": false,
    "main_characters": "Meredith; Derek",
    "interfering_episode_characters": "Bailey",
    "single_episode_progression_string": "Meredith and Derek share a tense elevator ride where Meredith sets boundaries, accusing Derek of sexual harassment. Despite this, they share a passionate kiss. Later, Derek expresses interest in ferry boats, hinting at his desire to connect with Meredith, but she chooses to take the stairs, indicating her struggle with self-control."
  },
  {
    "title": "Intern Dynamics at Seattle Grace",
    "arc_type": "Genre-Specific Arc",
    "description": "The interns at Seattle Grace Hospital form friendships and rivalries as they navigate the challenges of their medical training.",
    "episodic": false,
    "main_characters": "Meredith; George; Cristina; Izzie",
    "interfering_episode_characters": "Alex; Bailey",
    "single_episode_progression_string": "Meredith, George, Cristina, and Izzie navigate their roles as interns, dealing with professional challenges and personal interactions. Meredith refuses to have any of them as roommates initially but later agrees. Cristina's competitive nature is highlighted in her interactions with Alex. George faces professional embarrassment but continues to grow."
  },
  {
    "title": "Cristina's Competitive Nature",
    "arc_type": "Genre-Specific Arc",
    "description": "Cristina Yang's ambition and competitive drive often put her at odds with her peers, particularly Meredith.",
    "episodic": false,
    "main_characters": "Cristina",
    "interfering_episode_characters": "Alex; Meredith",
    "single_episode_progression_string": "Cristina's competitive nature is evident as she interacts with Alex, whom she dislikes for calling Meredith a nurse. She is also frustrated by constant hugs from patients and is focused on getting OR time."
  },
  {
    "title": "Izzie's Compassionate Care",
    "arc_type": "Episodic Arc",
    "description": "Izzie Stevens demonstrates her compassionate nature by going above and beyond to help patients, even when it risks her job.",
    "episodic": true,
    "main_characters": "Izzie",
    "interfering_episode_characters": "Ms. Lu; Ahn",
    "single_episode_progression_string": "Izzie struggles with a language barrier while treating Ms. Lu and her daughter Ahn, who is injured and undocumented. She secretly provides medical care to Ahn, showing her dedication and compassion."
  },
  {
    "title": "George's Professional Embarrassment and Growth",
    "arc_type": "Genre-Specific Arc",
    "description": "George O'Malley faces professional challenges and personal growth as he navigates his internship.",
    "episodic": false,
    "main_characters": "George",
    "interfering_episode_characters": "Cristina; Meredith",
    "single_episode_progression_string": "George forgets his badge, faces embarrassment, and struggles with his role on the code team. Despite losing patients, he continues to learn and grow, showing resilience."
  },
  {
    "title": "Medical Case: Allison's Assault and Recovery",
    "arc_type": "Episodic Arc",
    "description": "The episode focuses on the medical case of Allison, a rape victim found in the park, and her subsequent recovery.",
    "episodic": true,
    "main_characters": "Meredith; Derek; Burke",
    "interfering_episode_characters": "Bailey; Allison",
    "single_episode_progression_string": "Meredith becomes emotionally involved with Allison's case due to their shared shoes. The medical team works to save Allison, who is in critical condition. Derek and Burke discuss her recovery, and Meredith is deeply affected by the case. The rapist is later brought in, and the team decides not to reattach his penis due to the damage."
  },
  {
    "title": "Professional Ambitions: Chief of Surgery Position",
    "arc_type": "Episodic Arc",
    "description": "Burke and Derek discuss the Chief of Surgery position, highlighting their professional ambitions.",
    "episodic": true,
    "main_characters": "Burke; Derek",
    "interfering_episode_characters": "None",
    "single_episode_progression_string": "Burke and Derek engage in a discussion about the Chief of Surgery position, indicating their professional aspirations."
  }
]