{
  "scenes": [
    {
      "scene_number": 1,
      "plot_segment": "A voice says, 'Previously on Grey's Anatomy.' A montage of dialogue and narration summarizes the challenges of surgical residency, referencing the pressures, failures, and relationships among the interns and attendings. Meredith and Derek's romantic encounter is referenced, as well as Meredith's status as an intern and Derek as an attending. There are reminders of the hierarchy at the hospital, the tough expectations, and Meredith's relationship to her mother, Ellis Grey. The recap also touches on Meredith visiting her mother, who does not recognize her.",
      "is_recap": true,
      "start_time": "00:00:01,246",
      "end_time": "00:01:15,382",
      "start_seconds": 1.246,
      "end_seconds": 75.382,
      "start_subtitle_index": 0,
      "end_subtitle_index": 28
    },
    {
      "scene_number": 2,
      "plot_segment": "A character reflects through voice-over narration about boundaries and lines in life and work, emphasizing the importance of not getting too close to colleagues. The narration continues as scenes show Meredith interviewing potential roommates. Meredith tells someone she is particular about who lives in her house and rejects a candidate based on their age. Another character, likely Izzie, tries to convince Meredith to let her move in, offering bribes and promising to be a good roommate. Meredith resists, wanting only strangers as roommates.",
      "is_recap": false,
      "start_time": "00:01:15,403",
      "end_time": "00:02:55,377",
      "start_seconds": 75.403,
      "end_seconds": 175.377,
      "start_subtitle_index": 29,
      "end_subtitle_index": 70
    },
    {
      "scene_number": 3,
      "plot_segment": "In a hospital hallway, Dr. Bailey assigns tasks to the interns: George is to run the code team, Meredith takes the trauma pager, Cristina delivers labs, and Izzie is on sutures. Izzie tries to curry favor with Bailey by offering a mocha latte, but Bailey rebuffs her and tells all the interns that their job is to make their resident happy. Bailey makes it clear that no one will perform surgery until she is satisfied with their work.",
      "is_recap": false,
      "start_time": "00:02:55,957",
      "end_time": "00:03:49,069",
      "start_seconds": 175.957,
      "end_seconds": 229.06900000000002,
      "start_subtitle_index": 71,
      "end_subtitle_index": 96
    },
    {
      "scene_number": 4,
      "plot_segment": "Two characters, likely Meredith and Derek, discuss Seattle's ferry boats. One of them, from New York, expresses surprise at the existence of ferry boats and admits to not planning on liking Seattle. The other admits to having a fondness for ferry boats. The conversation shifts as one character tells the other they are not going out with them, referencing their previous romantic encounter. The two banter about boundaries and roles, with one character insisting on drawing a line between them. The scene ends with a humorous exchange about whether the line is imaginary or needs to be drawn with a marker.",
      "is_recap": false,
      "start_time": "00:03:59,205",
      "end_time": "00:05:04,560",
      "start_seconds": 239.20499999999998,
      "end_seconds": 304.56,
      "start_subtitle_index": 97,
      "end_subtitle_index": 123
    },
    {
      "scene_number": 5,
      "plot_segment": "In the emergency department, a staff member asks if someone is the surgeon. The surgeon confirms. They are informed that a 25-year-old female rape victim, Allison, has been brought in with severe trauma. Medical staff discuss her injuries and the fact that she fought back. The rape kit is negative, but it is revealed that Allison bit off her attacker's penis. The medical team reacts with shock and discusses the evidence.",
      "is_recap": false,
      "start_time": "00:05:27,322",
      "end_time": "00:07:20,403",
      "start_seconds": 327.322,
      "end_seconds": 440.403,
      "start_subtitle_index": 124,
      "end_subtitle_index": 165
    },
    {
      "scene_number": 6,
      "plot_segment": "Medical staff discuss Allison's prognosis, noting she will have a long recovery if she survives. Two doctors discuss why one of them moved to Seattle, revealing that the chief of surgery, Richard, recruited him. The conversation is brief and ends with one doctor leaving.",
      "is_recap": false,
      "start_time": "00:07:42,439",
      "end_time": "00:08:19,303",
      "start_seconds": 462.439,
      "end_seconds": 499.303,
      "start_subtitle_index": 166,
      "end_subtitle_index": 176
    },
    {
      "scene_number": 7,
      "plot_segment": "George is briefed on the code team's responsibilities, which involve saving lives. Another intern, possibly Cristina, is frustrated about delivering lab results despite her advanced degrees. Bailey assigns Alex Karev to shadow Cristina for the day. Cristina and Alex exchange mutual dislike, but agree to work together.",
      "is_recap": false,
      "start_time": "00:08:22,327",
      "end_time": "00:09:16,655",
      "start_seconds": 502.327,
      "end_seconds": 556.655,
      "start_subtitle_index": 177,
      "end_subtitle_index": 202
    },
    {
      "scene_number": 8,
      "plot_segment": "George introduces himself as Dr. O'Malley and prepares to run a code on a 57-year-old male patient. Meanwhile, Izzie attempts to communicate with Mrs. Liu, a patient who does not speak English. Izzie tries to find someone who speaks Chinese to help with translation.",
      "is_recap": false,
      "start_time": "00:09:20,821",
      "end_time": "00:10:07,230",
      "start_seconds": 560.821,
      "end_seconds": 607.23,
      "start_subtitle_index": 203,
      "end_subtitle_index": 216
    },
    {
      "scene_number": 9,
      "plot_segment": "Meredith brings a specimen to a staff member for the police. She is told that, due to chain of custody rules, she must keep the severed penis with her until the police arrive. Meredith is uncertain what to do with it, but accepts responsibility.",
      "is_recap": false,
      "start_time": "00:10:16,491",
      "end_time": "00:11:06,808",
      "start_seconds": 616.491,
      "end_seconds": 666.808,
      "start_subtitle_index": 217,
      "end_subtitle_index": 243
    },
    {
      "scene_number": 10,
      "plot_segment": "A doctor informs a patient that she has a rare but minor disorder and will be discharged without surgery. The patient is relieved to learn she is not dying. In another area, a group of interns discuss Meredith carrying the severed penis in a cooler. They joke about the situation and discuss the rape case. One intern, likely Izzie, is affected by the fact that Allison, the rape victim, was wearing the same shoes as her. She feels unsettled and tired.",
      "is_recap": false,
      "start_time": "00:11:10,793",
      "end_time": "00:12:48,831",
      "start_seconds": 670.793,
      "end_seconds": 768.831,
      "start_subtitle_index": 244,
      "end_subtitle_index": 284
    },
    {
      "scene_number": 11,
      "plot_segment": "Two interns, possibly Meredith and Cristina, discuss a secret activity they do together to cope with stress, hinting at something they consider 'sick and twisted.' They debate whether to continue, and one decides to go ahead, inviting the other to join or stay behind. Another intern is called away to respond to a code.",
      "is_recap": false,
      "start_time": "00:12:51,333",
      "end_time": "00:13:55,379",
      "start_seconds": 771.333,
      "end_seconds": 835.379,
      "start_subtitle_index": 285,
      "end_subtitle_index": 299
    },
    {
      "scene_number": 12,
      "plot_segment": "A character enters a room where a baby is present and notes that no tests have been ordered despite the baby having a heart murmur and turning blue. The attending physician tells the intern that the murmur is benign and that the baby is not their patient. The intern questions the attending, who insists the intern leave.",
      "is_recap": false,
      "start_time": "00:14:20,302",
      "end_time": "00:14:59,592",
      "start_seconds": 860.302,
      "end_seconds": 899.592,
      "start_subtitle_index": 300,
      "end_subtitle_index": 314
    },
    {
      "scene_number": 13,
      "plot_segment": "Izzie is asked by another staff member to help communicate with Mrs. Liu, but Izzie explains she cannot speak Chinese and is Korean. The attempt to find a translator is unsuccessful.",
      "is_recap": false,
      "start_time": "00:15:00,134",
      "end_time": "00:15:38,503",
      "start_seconds": 900.134,
      "end_seconds": 938.503,
      "start_subtitle_index": 315,
      "end_subtitle_index": 325
    },
    {
      "scene_number": 14,
      "plot_segment": "Dr. Burke confronts Chief Richard Webber about why Dr. Shepherd was brought to Seattle Grace. Richard says Shepherd is an old student and denies any ulterior motive. Burke is frustrated, feeling his position is threatened. Richard criticizes Burke for only doing the minimum required and challenges him to earn the chief position.",
      "is_recap": false,
      "start_time": "00:15:47,950",
      "end_time": "00:16:15,460",
      "start_seconds": 947.95,
      "end_seconds": 975.46,
      "start_subtitle_index": 326,
      "end_subtitle_index": 340
    },
    {
      "scene_number": 15,
      "plot_segment": "Cristina and Alex compete to deliver lab results quickly, agreeing to split the workload and avoid emotional engagement with patients. In another area, doctors inform a patient that her test results are negative and she will not need an amputation or lose her kidneys. The patient is told she can go home.",
      "is_recap": false,
      "start_time": "00:16:18,460",
      "end_time": "00:17:20,825",
      "start_seconds": 978.46,
      "end_seconds": 1040.825,
      "start_subtitle_index": 341,
      "end_subtitle_index": 370
    },
    {
      "scene_number": 16,
      "plot_segment": "Interns continue to discharge patients, congratulating them on their health. The scene includes light conversation about favorite music groups. In another area, a patient dies and the time of death is called.",
      "is_recap": false,
      "start_time": "00:17:21,205",
      "end_time": "00:18:07,002",
      "start_seconds": 1041.205,
      "end_seconds": 1087.002,
      "start_subtitle_index": 371,
      "end_subtitle_index": 387
    },
    {
      "scene_number": 17,
      "plot_segment": "A staff member instructs someone to call every hospital in the county, expecting the rapist to seek medical attention. Meredith learns that Allison, the rape victim, has no family in Seattle. Another staff member expresses sympathy for Allison's situation.",
      "is_recap": false,
      "start_time": "00:18:18,964",
      "end_time": "00:18:45,394",
      "start_seconds": 1098.964,
      "end_seconds": 1125.394,
      "start_subtitle_index": 388,
      "end_subtitle_index": 396
    },
    {
      "scene_number": 18,
      "plot_segment": "Meredith appears distressed and leaves, saying she has something to do. Another doctor, Dr. Burke, is told by Meredith about a baby in Pediatrics with a possible heart murmur. Burke refuses to check on the baby without a consult from Pediatrics, citing hospital rules.",
      "is_recap": false,
      "start_time": "00:18:52,933",
      "end_time": "00:19:20,460",
      "start_seconds": 1132.933,
      "end_seconds": 1160.46,
      "start_subtitle_index": 397,
      "end_subtitle_index": 411
    },
    {
      "scene_number": 19,
      "plot_segment": "Izzie is recognized by a patient from a magazine photo. She finishes treating the patient and asks them to see the nurse. Izzie then tries to convince another patient, Mrs. Liu, to let her examine her arm. Mrs. Liu is hesitant but eventually agrees.",
      "is_recap": false,
      "start_time": "00:19:23,140",
      "end_time": "00:20:12,974",
      "start_seconds": 1163.14,
      "end_seconds": 1212.974,
      "start_subtitle_index": 412,
      "end_subtitle_index": 428
    },
    {
      "scene_number": 20,
      "plot_segment": "Izzie and another intern, possibly George, hide in a quiet area. Izzie confesses to kissing Derek in the elevator and discusses her bad day. They talk about Meredith carrying the severed penis and Allison wearing the same shoes as Meredith. Both reflect on how strange and unsettling the situation is.",
      "is_recap": false,
      "start_time": "00:20:22,387",
      "end_time": "00:21:04,967",
      "start_seconds": 1222.387,
      "end_seconds": 1264.967,
      "start_subtitle_index": 429,
      "end_subtitle_index": 446
    },
    {
      "scene_number": 21,
      "plot_segment": "Security is called. Medical staff bring in a new patient, identified as the rapist. Meredith is told to call the chief and inform him that the rapist has been caught.",
      "is_recap": false,
      "start_time": "00:21:30,512",
      "end_time": "00:21:48,015",
      "start_seconds": 1290.512,
      "end_seconds": 1308.015,
      "start_subtitle_index": 447,
      "end_subtitle_index": 451
    },
    {
      "scene_number": 22,
      "plot_segment": "Doctors discuss the extent of the rapist's injuries and why his penis cannot be reattached. They explain that the damage is too severe and that he will have permanent consequences. The chief is informed that the rapist came to the hospital for treatment. Dr. Burke confronts Richard about his status at the hospital, and Richard criticizes Burke for not going above and beyond in his work.",
      "is_recap": false,
      "start_time": "00:22:02,575",
      "end_time": "00:23:13,942",
      "start_seconds": 1322.575,
      "end_seconds": 1393.942,
      "start_subtitle_index": 452,
      "end_subtitle_index": 485
    },
    {
      "scene_number": 23,
      "plot_segment": "Izzie is unable to communicate with Mrs. Liu due to the language barrier and has to send her away. The interns gather and express frustration about their lack of experience and the menial nature of their tasks. Meredith complains about having to keep the severed penis overnight due to police delays. Alex makes a joke, but the group is mostly discouraged.",
      "is_recap": false,
      "start_time": "00:23:44,752",
      "end_time": "00:25:11,577",
      "start_seconds": 1424.752,
      "end_seconds": 1511.577,
      "start_subtitle_index": 486,
      "end_subtitle_index": 514
    },
    {
      "scene_number": 24,
      "plot_segment": "Meredith enters the nursery and speaks with the parents of the baby with the heart murmur. She is confronted by the pediatrician, who is upset that Meredith is interfering. Dr. Burke arrives, takes over the case, and orders tests for the baby. He asserts his authority as an attending and reassures the parents.",
      "is_recap": false,
      "start_time": "00:25:36,230",
      "end_time": "00:27:31,692",
      "start_seconds": 1536.23,
      "end_seconds": 1651.692,
      "start_subtitle_index": 515,
      "end_subtitle_index": 565
    },
    {
      "scene_number": 25,
      "plot_segment": "Izzie finds Mrs. Liu outside the hospital and discovers that she is afraid of being arrested for being undocumented. Izzie promises not to report her and offers to treat her wound outside. Izzie cleans and stitches the wound, gives Mrs. Liu her pager number, and asks her to return in five days for a follow-up. Mrs. Liu thanks Izzie, calling her a good person and doctor.",
      "is_recap": false,
      "start_time": "00:27:36,650",
      "end_time": "00:32:36,183",
      "start_seconds": 1656.65,
      "end_seconds": 1956.183,
      "start_subtitle_index": 566,
      "end_subtitle_index": 652
    },
    {
      "scene_number": 26,
      "plot_segment": "Cristina asks Dr. Burke if he thinks she is too confident. He offers her a chance to speak freely for 30 seconds. Cristina tells him he is cocky, arrogant, bossy, pushy, and has a God complex. She continues her critique until interrupted.",
      "is_recap": false,
      "start_time": "00:32:57,123",
      "end_time": "00:33:36,967",
      "start_seconds": 1977.123,
      "end_seconds": 2016.967,
      "start_subtitle_index": 653,
      "end_subtitle_index": 665
    },
    {
      "scene_number": 27,
      "plot_segment": "George confides in Izzie that he lost five patients on the code team and feels like the angel of death. Izzie reassures him that most code patients cannot be revived and that he should not blame himself. George wishes he had known this before.",
      "is_recap": false,
      "start_time": "00:33:39,729",
      "end_time": "00:34:12,371",
      "start_seconds": 2019.729,
      "end_seconds": 2052.371,
      "start_subtitle_index": 666,
      "end_subtitle_index": 675
    },
    {
      "scene_number": 28,
      "plot_segment": "Meredith and George discuss the baby's upcoming heart surgery. Meredith admits she thought she was right about the diagnosis, and George says interns are rarely right. They both admit to feeling terrified all the time as interns.",
      "is_recap": false,
      "start_time": "00:34:24,146",
      "end_time": "00:35:02,307",
      "start_seconds": 2064.146,
      "end_seconds": 2102.307,
      "start_subtitle_index": 676,
      "end_subtitle_index": 687
    },
    {
      "scene_number": 29,
      "plot_segment": "George sits with Allison, the rape victim, who remains unconscious. Meredith joins him. George shares that he has four sisters and would want them by his side if he were in a coma. Meredith reflects on her own mother, Ellis Grey, and her likely reaction. Meredith and Derek discuss their ambiguous relationship, with Derek joking about needing breath mints for future kisses. Meredith reflects on the baby in the nursery and the contrast between innocence and trauma.",
      "is_recap": false,
      "start_time": "00:35:21,447",
      "end_time": "00:36:42,222",
      "start_seconds": 2121.447,
      "end_seconds": 2202.222,
      "start_subtitle_index": 688,
      "end_subtitle_index": 720
    },
    {
      "scene_number": 30,
      "plot_segment": "Medical staff notice Allison's intracranial pressure has doubled and prepare her for emergency surgery. After surgery, a doctor explains that Allison's skull flap had to be left off due to brain swelling. Her prognosis is uncertain, and she may not survive unless she wakes up.",
      "is_recap": false,
      "start_time": "00:36:49,204",
      "end_time": "00:37:40,135",
      "start_seconds": 2209.204,
      "end_seconds": 2260.135,
      "start_subtitle_index": 721,
      "end_subtitle_index": 733
    },
    {
      "scene_number": 31,
      "plot_segment": "Dr. Burke is approached by another doctor about getting a drink, but he declines. The two discuss that Richard promised both of them the chief position. They acknowledge their competition but clarify that they are not enemies.",
      "is_recap": false,
      "start_time": "00:37:40,175",
      "end_time": "00:38:05,786",
      "start_seconds": 2260.175,
      "end_seconds": 2285.786,
      "start_subtitle_index": 734,
      "end_subtitle_index": 742
    },
    {
      "scene_number": 32,
      "plot_segment": "A staff member explains to another how to sign the chain of custody paperwork for the severed penis. The staff member is uncomfortable because they used to change the patient's diapers. The paperwork is completed and the evidence is handed over to the police.",
      "is_recap": false,
      "start_time": "00:38:12,414",
      "end_time": "00:38:38,625",
      "start_seconds": 2292.414,
      "end_seconds": 2318.625,
      "start_subtitle_index": 743,
      "end_subtitle_index": 752
    },
    {
      "scene_number": 33,
      "plot_segment": "In the operating room, Dr. Burke prepares to perform heart surgery on the baby. He tells Meredith to scrub in and promises to let her hold the clamp during the procedure.",
      "is_recap": false,
      "start_time": "00:38:42,166",
      "end_time": "00:39:06,199",
      "start_seconds": 2322.166,
      "end_seconds": 2346.199,
      "start_subtitle_index": 753,
      "end_subtitle_index": 762
    },
    {
      "scene_number": 34,
      "plot_segment": "Medical staff inform the rapist that his bleeding has been stopped and that his penis will be handed over to the police. Another patient is told their tumor is benign and they can go home.",
      "is_recap": false,
      "start_time": "00:39:14,514",
      "end_time": "00:39:37,079",
      "start_seconds": 2354.514,
      "end_seconds": 2377.079,
      "start_subtitle_index": 763,
      "end_subtitle_index": 769
    },
    {
      "scene_number": 35,
      "plot_segment": "A character narrates about boundaries and lines, reflecting on how they can keep people out but also fence oneself in. Meredith tells George and Izzie they can move into her house. They celebrate. Meredith blames the babies for her decision, jokingly. The narration continues, suggesting that life is about crossing lines rather than drawing them.",
      "is_recap": false,
      "start_time": "00:39:40,503",
      "end_time": "00:40:53,855",
      "start_seconds": 2380.503,
      "end_seconds": 2453.855,
      "start_subtitle_index": 770,
      "end_subtitle_index": 785
    },
    {
      "scene_number": 36,
      "plot_segment": "Meredith and Derek meet again. Meredith mentions her fondness for ferry boats. She decides to take the stairs instead of the elevator, referencing their lack of self-control. The narration concludes with the idea that taking risks can lead to spectacular outcomes.",
      "is_recap": false,
      "start_time": "00:40:56,619",
      "end_time": "00:42:08,753",
      "start_seconds": 2456.619,
      "end_seconds": 2528.753,
      "start_subtitle_index": 786,
      "end_subtitle_index": 795
    }
  ]
}