[
  {
    "title": "Meredith’s Struggle for Boundaries: Navigating Professionalism, Trauma, and Personal Space",
    "arc_type": "Soap Arc",
    "description": "Meredith attempts to establish boundaries in her personal and professional life—resisting romantic advances from Derek, grappling with the emotional impact of treating a rape victim who shares her shoes, and struggling to find suitable roommates while maintaining distance from her peers.",
    "main_characters": "Meredith Grey; Derek Shepherd; George O’Malley; Izzie Stevens",
    "interfering_episode_characters": "Cristina Yang; Bailey; Allison (rape victim)",
    "single_episode_progression_string": "Meredith posts a roommate notice but repeatedly rejects George and Izzie as candidates, seeking emotional distance. She tries to draw a line with Derek, but they share a kiss, blurring boundaries. Treating Allison, a rape victim with the same shoes, triggers Meredith’s empathy and trauma, leading her to question her own vulnerability. Ultimately, she relents and invites George and Izzie to move in, signaling a shift toward accepting connection.",
    "thematic_focus": "relationship_development",
    "narrative_scope": "episode",
    "consolidation_notes": ""
  },
  {
    "title": "Cristina and Alex: Reluctant Partners in Medical Hierarchy",
    "arc_type": "Genre-Specific Arc",
    "description": "Cristina is forced to mentor Alex Karev, whom she dislikes, highlighting her frustration with the hospital’s hierarchy and the emotional labor of patient care, especially as she is repeatedly hugged by grateful patients.",
    "main_characters": "Cristina Yang; Alex Karev",
    "interfering_episode_characters": "Bailey; various patients",
    "single_episode_progression_string": "Cristina is assigned Alex as her intern and immediately expresses disdain due to a prior insult. Despite their mutual dislike, they must collaborate to deliver lab results and manage patient interactions. Cristina’s discomfort with emotional displays is tested as she is repeatedly hugged, culminating in her deflecting a hug onto Alex. Their begrudging teamwork and banter set the tone for their evolving dynamic.",
    "thematic_focus": "professional_conflict",
    "narrative_scope": "episode",
    "consolidation_notes": ""
  },
  {
    "title": "George’s Initiation by Fire: The Emotional Toll of Code Team Duty",
    "arc_type": "Genre-Specific Arc",
    "description": "George faces the harsh realities of being on the code team, repeatedly losing patients and struggling with the emotional burden, while seeking independence from his family by wanting to move out.",
    "main_characters": "George O’Malley",
    "interfering_episode_characters": "Cristina Yang; Meredith Grey; Izzie Stevens",
    "single_episode_progression_string": "George expresses his desire to move out from his mother’s care, hinting at wanting to be Meredith’s roommate. Assigned to the code team, he repeatedly attempts to revive patients but is forced to declare multiple deaths, culminating in a sense of defeat and emotional exhaustion. Cristina offers a pragmatic perspective, helping George process the inevitability of loss in medicine.",
    "thematic_focus": "professional_growth",
    "narrative_scope": "episode",
    "consolidation_notes": ""
  },
  {
    "title": "Izzie’s Compassion Beyond Protocol: Treating Undocumented Patients in Secret",
    "arc_type": "Anthology Arc",
    "description": "Izzie is confronted with the ethical and legal challenges of treating undocumented patients, ultimately choosing to help Ms. Lu’s daughter Ahn in secret, risking her job to provide care.",
    "main_characters": "Izzie Stevens; Ms. Lu; Ahn",
    "interfering_episode_characters": "Cristina Yang; Alex Karev",
    "single_episode_progression_string": "Izzie struggles to communicate with Ms. Lu, a Chinese-speaking patient, and discovers her daughter Ahn has a serious injury but is afraid to seek help due to her undocumented status. Izzie secretly treats Ahn outside hospital protocol, gives her personal contact information, and warns her not to tell anyone, highlighting Izzie’s empathy and willingness to bend rules for patient care.",
    "thematic_focus": "ethical_challenges",
    "narrative_scope": "episode",
    "consolidation_notes": ""
  },
  {
    "title": "Burke and Derek: Rivalry for Chief Amidst High-Stakes Cases",
    "arc_type": "Genre-Specific Arc",
    "description": "Burke and Derek’s professional rivalry intensifies as they compete for the Chief of Surgery position, set against the backdrop of complex cases, including the rape victim and a critical infant surgery.",
    "main_characters": "Preston Burke; Derek Shepherd; Richard Webber",
    "interfering_episode_characters": "Bailey; Meredith Grey",
    "single_episode_progression_string": "Burke questions Richard about Derek’s recruitment, feeling threatened in his pursuit of Chief. Their rivalry is underscored by their handling of high-profile cases—Burke’s leadership in the infant’s surgery and Derek’s care for Allison. Burke ultimately asserts their competition, refusing Derek’s offer for camaraderie.",
    "thematic_focus": "professional_conflict",
    "narrative_scope": "episode",
    "consolidation_notes": ""
  },
  {
    "title": "Meredith’s Advocacy for Vulnerable Patients: Challenging Authority in Pediatrics",
    "arc_type": "Anthology Arc",
    "description": "Meredith risks professional repercussions by advocating for a baby she believes is in danger, challenging the pediatric team’s assessment and ultimately prompting Burke to intervene.",
    "main_characters": "Meredith Grey; Preston Burke",
    "interfering_episode_characters": "Pediatrics intern; Dr. Kay; Mr. and Mrs. Johnson",
    "single_episode_progression_string": "Meredith notices a baby turning blue and, despite being told by the pediatric intern that the condition is benign, voices her concerns to the parents. This leads to conflict with the pediatric team, but Burke supports Meredith’s instincts, takes over the case, and allows her to assist in surgery, validating her advocacy.",
    "thematic_focus": "ethical_challenges",
    "narrative_scope": "episode",
    "consolidation_notes": ""
  }
]