[
  {
    "title": "Meredith and Derek's Complicated Relationship",
    "arc_type": "Soap Arc",
    "description": "Meredith and Derek's relationship begins with a one-night stand and evolves amidst professional challenges and personal revelations.",
    "episodic": false,
    "main_characters": "Meredith Grey; Derek Shepherd",
    "interfering_episode_characters": "Addison Shepherd",
    "single_episode_progression_string": "Meredith reveals her mother's Alzheimer's to Derek, adding complexity to their relationship. Addison confronts Meredith about Derek, highlighting the complexities of their relationship."
  },
  {
    "title": "George's Professional Embarrassment and Growth",
    "arc_type": "Genre-Specific Arc",
    "description": "George O'Malley faces professional challenges and personal growth as he navigates his internship.",
    "episodic": false,
    "main_characters": "George O'Malley",
    "interfering_episode_characters": "Olivia Harper; Alex Karev",
    "single_episode_progression_string": "George discovers he has syphilis, leading to embarrassment and tension with Olivia. He confronts Alex, believing he contracted it from him. Despite the personal setback, George continues to work on cases, showing resilience."
  },
  {
    "title": "Cristina's Pregnancy and Abortion Decision",
    "arc_type": "Soap Arc",
    "description": "Cristina grapples with an unexpected pregnancy and her decision to have an abortion, affecting her relationship with Burke.",
    "episodic": false,
    "main_characters": "Cristina Yang",
    "interfering_episode_characters": "Preston Burke",
    "single_episode_progression_string": "Cristina considers telling Burke about her pregnancy but decides against it. She schedules an abortion and avoids discussing it with Burke, highlighting her internal conflict."
  },
  {
    "title": "The Chief's Secret Health Issue",
    "arc_type": "Genre-Specific Arc",
    "description": "The Chief struggles with a secret health issue that affects his ability to perform surgeries.",
    "episodic": false,
    "main_characters": "Richard Webber; Derek Shepherd",
    "interfering_episode_characters": "Miranda Bailey",
    "single_episode_progression_string": "The Chief's vision problems become apparent during surgery, prompting Derek to conduct secret tests. They discover a tumor on his optic nerve, leading to a covert operation to address the issue."
  },
  {
    "title": "Intern Dynamics at Seattle Grace",
    "arc_type": "Genre-Specific Arc",
    "description": "The interns at Seattle Grace Hospital form friendships and rivalries as they navigate the challenges of their medical training.",
    "episodic": false,
    "main_characters": "Meredith Grey; Cristina Yang; Izzie Stevens; George O'Malley; Alex Karev",
    "interfering_episode_characters": "Miranda Bailey; Richard Webber",
    "single_episode_progression_string": "The interns deal with various personal and professional challenges. Izzie teases George about his syphilis, and Cristina and Izzie perform an unauthorized autopsy. The interns' interactions highlight their evolving dynamics and the pressures of their training."
  },
  {
    "title": "Medical Case: Mr. Franklin's Mysterious Condition",
    "arc_type": "Episodic Arc",
    "description": "The medical team investigates Mr. Franklin's mysterious abdominal condition, leading to unexpected complications.",
    "episodic": true,
    "main_characters": "Cristina Yang; Izzie Stevens",
    "interfering_episode_characters": "Miranda Bailey; Mr. Franklin; Alice Franklin",
    "single_episode_progression_string": "Cristina and Izzie examine Mr. Franklin's large abdomen and later perform an unauthorized autopsy after his death. They discover hemochromatosis as the cause, providing closure to the family despite initial resistance."
  }
]