[
  {
    "title": "Meredith and Derek's Complicated Romance",
    "arc_type": "Soap Arc",
    "description": "Meredith and Derek's relationship begins with a one-night stand, complicated by Derek being her boss. Their romance faces challenges, including workplace gossip and Meredith's struggle to keep it professional.",
    "episodic": false,
    "main_characters": "Meredith Grey; Derek Shepherd",
    "interfering_episode_characters": "Addison Shepherd",
    "single_episode_progression_string": "Meredith reveals her mother's Alzheimer's to Derek, adding depth to their relationship. The arrival of Addison Shepherd, Derek's wife, complicates their romance further."
  },
  {
    "title": "Intern Dynamics and Rivalries",
    "arc_type": "Genre-Specific Arc",
    "description": "The new interns at Seattle Grace Hospital navigate their roles, forming alliances and rivalries as they begin their medical careers.",
    "episodic": false,
    "main_characters": "George O'Malley; Isobel Stevens; Cristina Yang; Alex Karev",
    "interfering_episode_characters": "Olivia; Bailey",
    "single_episode_progression_string": "Tensions rise between George and Alex due to the syphilis diagnosis and Olivia's past relationship with Alex, showcasing the rivalries and dynamics among the interns. Izzie and Cristina collaborate on an unauthorized autopsy, showing their willingness to break rules for answers."
  },
  {
    "title": "Meredith's Legacy and Family Ties",
    "arc_type": "Soap Arc",
    "description": "Meredith grapples with her mother's legacy as a renowned surgeon and her own path in medicine, while dealing with her mother's Alzheimer's.",
    "episodic": false,
    "main_characters": "Meredith Grey",
    "interfering_episode_characters": "Derek Shepherd; Ms. Henry",
    "single_episode_progression_string": "Meredith struggles with her mother's Alzheimer's, breaking down and revealing the truth to Derek. She also receives a call from her mother's nurse, highlighting her ongoing family responsibilities."
  },
  {
    "title": "George's Personal Growth and Challenges",
    "arc_type": "Genre-Specific Arc",
    "description": "George navigates personal and professional challenges, including his interactions with patients and colleagues, as he grows more confident in his role.",
    "episodic": false,
    "main_characters": "George O'Malley",
    "interfering_episode_characters": "Olivia; Alex Karev; Isobel Stevens",
    "single_episode_progression_string": "George faces personal challenges with his syphilis diagnosis and the confrontation with Alex, highlighting his ongoing personal growth and struggles. He confronts Olivia about their relationship and punches Alex, showing his struggle with confidence and personal relationships."
  },
  {
    "title": "Cristina's Professional Ambitions",
    "arc_type": "Genre-Specific Arc",
    "description": "Cristina Yang navigates her professional ambitions and challenges, often clashing with her superiors and colleagues.",
    "episodic": false,
    "main_characters": "Cristina Yang",
    "interfering_episode_characters": "Isobel Stevens; Preston Burke",
    "single_episode_progression_string": "Cristina contemplates her pregnancy and an upcoming abortion, avoiding telling Burke, which ties into her personal and professional ambitions and challenges. She is involved in an unauthorized autopsy with Izzie, demonstrating her ambition and willingness to push boundaries."
  },
  {
    "title": "Medical Case: Franklin's Mysterious Death",
    "arc_type": "Episodic Arc",
    "description": "Cristina and Izzie investigate the cause of Mr. Franklin's death, leading to an unauthorized autopsy to uncover the truth.",
    "episodic": true,
    "main_characters": "Cristina Yang; Isobel Stevens",
    "interfering_episode_characters": "Bailey; Mr. Franklin; Alice Franklin",
    "single_episode_progression_string": "Cristina and Izzie examine Mr. Franklin, who has a large abdomen. After his death, they perform an unauthorized autopsy, discovering he died from hemochromatosis, not heavy drinking, and inform his family."
  },
  {
    "title": "Chief's Health Crisis",
    "arc_type": "Genre-Specific Arc",
    "description": "The Chief faces a personal health crisis, dealing with vision problems that could impact his career.",
    "episodic": false,
    "main_characters": "Chief Richard Webber",
    "interfering_episode_characters": "Derek Shepherd; Miranda Bailey",
    "single_episode_progression_string": "The Chief struggles with blurry vision during surgery, leading to a secret MRI. Derek discovers a tumor on the Chief's optic nerve, planning a secret surgery to address it."
  }
]