[
  {
    "title": "Meredith and Derek's Complex Relationship",
    "arc_type": "Soap Arc",
    "description": "Meredith Grey and Derek Shepherd navigate their intricate personal and professional relationship, which begins with a one-night stand and evolves amidst hospital challenges and personal revelations, including the arrival of Derek's estranged wife, Addison.",
    "main_characters": "Meredith Grey; Derek Shepherd",
    "interfering_episode_characters": "George O'Malley; Izzie Stevens",
    "single_episode_progression_string": "George and Izzie see Derek leaving Meredith's house. Izzie confronts Meredith about her relationship with Derek. Derek admits his feelings about Meredith to George."
  },
  {
    "title": "George's Journey of Self-Discovery and Confidence",
    "arc_type": "Soap Arc",
    "description": "George O'Malley explores his identity and builds self-confidence as he navigates misunderstandings about his sexuality, unrequited feelings for Meredith, and forms meaningful connections with patients and colleagues.",
    "main_characters": "George O'Malley",
    "interfering_episode_characters": "Derek Shepherd; Dr. Taylor",
    "single_episode_progression_string": "George sees Derek leaving Meredith's house and feels jealous. George suspects Dr. Taylor of drinking on the job. George confronts Dr. Taylor in front of Derek. George is removed from the surgery."
  },
  {
    "title": "Izzie's Professional Jealousy and Advocacy",
    "arc_type": "Soap Arc",
    "description": "Izzie Stevens navigates professional jealousy towards Meredith due to perceived favoritism in surgical opportunities, while demonstrating her dedication to patient care and her colleagues.",
    "main_characters": "Izzie Stevens",
    "interfering_episode_characters": "Meredith Grey; Derek Shepherd",
    "single_episode_progression_string": "Izzie sees Derek leaving Meredith's house. She believes Meredith gets better surgeries because of Derek. Izzie assists a man who swallowed keys. Izzie confronts Meredith about Derek. Izzie's anger fades when she realizes Meredith loves Derek."
  },
  {
    "title": "Cristina's Ambition and Personal Challenges",
    "arc_type": "Soap Arc",
    "description": "Cristina Yang's relentless ambition in her surgical career is juxtaposed with personal challenges, such as a potential pregnancy, which complicates her professional aspirations and emotional detachment. Her struggle to balance success with empathy is a recurring theme.",
    "main_characters": "Cristina Yang",
    "interfering_episode_characters": "Dr. Burke",
    "single_episode_progression_string": "Cristina feels nauseous and blames Dr. Burke. Cristina suspects her flu symptoms might be something else. Cristina takes two pregnancy tests. Cristina is unhappy with the results."
  },
  {
    "title": "Alex's Professional Growth and Personal Connections",
    "arc_type": "Genre-Specific Arc",
    "description": "Alex Karev navigates his professional growth amidst challenging cases and forms personal connections with patients, reflecting his competitive drive and the impact of personal experiences on his medical career.",
    "main_characters": "Alex Karev",
    "interfering_episode_characters": "Gunshot Victim; Dr. Burke",
    "single_episode_progression_string": "Alex notices a gunshot victim in the lobby. Alex questions why the gunshot victim isn't in the emergency room. Alex connects with the gunshot victim over their shared wrestling background. The gunshot victim's condition worsens due to a tattoo infection. The gunshot victim dies."
  },
  {
    "title": "Navigating Hierarchical Challenges at Seattle Grace",
    "arc_type": "Genre-Specific Arc",
    "description": "The interns and residents at Seattle Grace Hospital face hierarchical challenges, including dealing with superiors' decisions and peer competition, as they strive to establish themselves in the medical field.",
    "main_characters": "George; Izzie; Derek",
    "interfering_episode_characters": "Meredith; Dr. Taylor; Cristina",
    "single_episode_progression_string": "George and Izzie see Derek leaving Meredith's house. George smells bourbon on Dr. Taylor during a surgery. George confronts Dr. Taylor in front of Derek. Derek supports Dr. Taylor, leading to George's removal from the surgery. Cristina replaces George in the surgery. Derek later apologizes to George and admits his feelings for Meredith."
  },
  {
    "title": "Medical Case: The Unauthorized Gastric Bypass",
    "arc_type": "Anthology Arc",
    "description": "Meredith and Bailey handle a case involving a teenager who underwent an unauthorized gastric bypass in Mexico. The surgery was poorly executed, leading to severe complications that require corrective measures, ultimately resulting in lifelong nutritional challenges for the patient.",
    "main_characters": "Meredith Grey; Miranda Bailey",
    "interfering_episode_characters": "None",
    "single_episode_progression_string": "Meredith and Bailey assess the teenager's condition. They prepare for surgery to reverse the bypass. The procedure fails due to complications. The patient's bowel bursts during surgery. The teenager faces lifelong nutritional challenges."
  },
  {
    "title": "Medical Case: The Swallowed Keys",
    "arc_type": "Anthology Arc",
    "description": "Izzie deals with a series of unusual medical cases, each presenting unique challenges and requiring creative solutions.",
    "main_characters": "Izzie",
    "interfering_episode_characters": "None",
    "single_episode_progression_string": "Izzie assists a man who swallowed his girlfriend's keys during a breakup. She retrieves the keys safely."
  },
  {
    "title": "Medical Case: The Toddler's Hemispherectomy",
    "arc_type": "Anthology Arc",
    "description": "Derek and George work on a challenging case involving a toddler with severe tremors. Derek decides on a hemispherectomy to save the child's life, but complications arise with the anesthesiologist, impacting the surgery.",
    "main_characters": "Derek; George",
    "interfering_episode_characters": "Cristina; Dr. Taylor",
    "single_episode_progression_string": "George joins Derek on a case involving a toddler with severe tremors. Derek discovers the toddler's brain tissue is dying rapidly. Derek decides a hemispherectomy is necessary. George smells bourbon on Dr. Taylor, the anesthesiologist. George confronts Dr. Taylor in front of Derek. Derek supports Dr. Taylor, leading to George's removal from the surgery. Cristina replaces George in the surgery. During the hemispherectomy, the toddler begins to wake up. Dr. Taylor is found asleep. Derek removes Dr. Taylor from the surgery."
  },
  {
    "title": "Medical Case: The Tattoo Gunshot Victim",
    "arc_type": "Anthology Arc",
    "description": "Alex encounters a gunshot victim who believes scars enhance his tattoos. The stress from the wound worsens a tattoo infection, leading to the patient's death.",
    "main_characters": "Alex",
    "interfering_episode_characters": "Burke; Gunshot Victim",
    "single_episode_progression_string": "Alex notices a gunshot victim in the lobby. The victim explains he was shot by a friend to enhance his tattoos. The stress from the wound exacerbates a tattoo infection. The infection spreads, and the patient dies."
  }
]