{
  "scenes": [
    {
      "scene_number": 1,
      "plot_segment": "A voice announces, 'Previously on Grey's Anatomy.' Scenes are shown in which a character discusses having feelings for a roommate but being unable to confess. Another character suggests asking the roommate out. Someone questions another about being shallow and callous. A character declines an invitation for drinks, saying they are seeing someone. Another advises, 'Save yourself the misery, man. She's off the market.' There is debate about whether someone is truly unavailable. A voice warns that the longer a 'fling' continues, the more favors one intern receives, and that if others find out, there will be consequences. A supervisor threatens that if Meredith Grey is favored, she will be banned from the operating room for a month. Scenes show tension about relationships and favoritism among interns and attendings.",
      "is_recap": true,
      "start_time": "00:00:01,145",
      "end_time": "00:00:47,807",
      "start_seconds": 1.145,
      "end_seconds": 47.807,
      "start_subtitle_index": 0,
      "end_subtitle_index": 17
    },
    {
      "scene_number": 2,
      "plot_segment": "Meredith Grey narrates about the exhaustion of being an intern and how the job and other factors keep them up all night. In the early morning, Meredith is urged to get up and asks about the time. She tells someone they need to leave before her roommates see them. Another character suggests letting 'him' sleep, but Meredith insists he must go. Meredith is asked if she got any sleep. In another room, two characters discuss the noise from Meredith's room, speculating about who the man was and joking about jealousy. Meredith joins her roommates, who tease her about her sex life and the loudness of her activities. Meredith insists there is nothing to tell. The roommates joke about needing to go to a hotel for sleep. Meredith worries about her roommates discovering she is involved with her boss, and does not want them to think she is getting special treatment.",
      "is_recap": false,
      "start_time": "00:00:52,411",
      "end_time": "00:03:54,038",
      "start_seconds": 52.411,
      "end_seconds": 234.038,
      "start_subtitle_index": 18,
      "end_subtitle_index": 101
    },
    {
      "scene_number": 3,
      "plot_segment": "At the hospital, Dr. Bailey assigns O'Malley, Yang, and Karev to the clinic, and tells O'Malley that patients are waiting. Bailey instructs Meredith and Izzie to accompany her, with Izzie assigned to Bailey for the day. Bailey greets Dr. Shepherd. Bailey notes Meredith's late night and warns her to hope caffeine kicks in. Bailey gives Meredith a list of tasks, including a consult in the pit for a girl with fever and abdominal pain, medication for Nicholas, and IV for Mr. Mowers. Bailey quizzes Meredith on the room numbers and asks why she is still standing there. Bailey observes Meredith looks more like herself than usual and asks what's wrong. Meredith denies any problem.",
      "is_recap": false,
      "start_time": "00:03:57,580",
      "end_time": "00:04:54,608",
      "start_seconds": 237.57999999999998,
      "end_seconds": 294.608,
      "start_subtitle_index": 102,
      "end_subtitle_index": 121
    },
    {
      "scene_number": 4,
      "plot_segment": "A woman urgently seeks help, saying her boyfriend swallowed her keys because he did not want her to leave. Meredith is told to locate the keys. The boyfriend admits he swallowed them intentionally. Meredith examines a patient who recently returned from Mexico and has been weak and lost weight. The patient's parent says she passed out in the shower. Meredith asks about the timing of the trip and is told it was a couple weeks ago. The patient insists she is fine and only has a fever, requesting antibiotics and to be sent home. Meredith explains she must do an exam before releasing her.",
      "is_recap": false,
      "start_time": "00:04:54,889",
      "end_time": "00:06:14,949",
      "start_seconds": 294.889,
      "end_seconds": 374.949,
      "start_subtitle_index": 122,
      "end_subtitle_index": 151
    },
    {
      "scene_number": 5,
      "plot_segment": "Meredith asks for privacy to examine the patient, and the parents leave. Meanwhile, Digby Owens arrives, bleeding from a gunshot wound. Meredith notes the wound and suggests moving him to the pit. Digby explains his friend shot him as a favor, and he likes the scars. He says the shooting was intentional and part of his commitment to body art.",
      "is_recap": false,
      "start_time": "00:06:14,970",
      "end_time": "00:06:47,497",
      "start_seconds": 374.97,
      "end_seconds": 407.497,
      "start_subtitle_index": 152,
      "end_subtitle_index": 175
    },
    {
      "scene_number": 6,
      "plot_segment": "Digby discusses his tattoos and ethos about pain and commitment, referencing his wrestling background at Iowa State. Another character jokes about men in tights and mentions a flu going around the hospital. Meredith examines a patient, asking her to lift her shirt. Meredith discovers recent surgical scars and asks the patient not to tell her parents. Meredith deduces the patient had surgery in Mexico to hide it from her parents and asks what procedure was done.",
      "is_recap": false,
      "start_time": "00:07:17,684",
      "end_time": "00:09:06,091",
      "start_seconds": 437.684,
      "end_seconds": 546.091,
      "start_subtitle_index": 176,
      "end_subtitle_index": 210
    },
    {
      "scene_number": 7,
      "plot_segment": "A group discusses a young girl, Jamie, who has been experiencing foot twitching and had a CT scan showing a brain abnormality. Her parents explain the worsening symptoms and their efforts to get proper care. Meredith reassures them and says she will bring in Dr. Shepherd, the brain specialist. The parents ask if Dr. Shepherd is good, and Meredith affirms his skills.",
      "is_recap": false,
      "start_time": "00:09:13,767",
      "end_time": "00:10:00,902",
      "start_seconds": 553.767,
      "end_seconds": 600.902,
      "start_subtitle_index": 211,
      "end_subtitle_index": 231
    },
    {
      "scene_number": 8,
      "plot_segment": "In the clinic, the woman whose boyfriend swallowed her keys explains his behavior. Meredith is told to perform a bronchoscopy and is encouraged to do it alone. Meredith expresses gratitude for the confidence shown in her skills. Bailey asks Meredith about her pit patient, who is febrile and has peritoneal signs. Cristina Yang, who has the flu, says she is heading back to the clinic. Meredith suspects the patient had illegal surgery in Mexico, noting laparoscopic scars and unawareness by the parents. Bailey instructs Meredith to order a CT and handle other tasks. Cristina and another intern discuss the flu and the need for rest.",
      "is_recap": false,
      "start_time": "00:10:03,464",
      "end_time": "00:11:43,870",
      "start_seconds": 603.464,
      "end_seconds": 703.87,
      "start_subtitle_index": 232,
      "end_subtitle_index": 282
    },
    {
      "scene_number": 9,
      "plot_segment": "George O'Malley asks if anyone has seen Dr. Shepherd. Another intern jokes about Meredith being close to Shepherd. Cristina warns George that the program will determine their careers and that recommendations from attendings like Shepherd are crucial. The group discusses the risks of interns sleeping with attendings and debates responsibility and power dynamics. There is concern about Meredith's relationship with Shepherd and its impact on her career.",
      "is_recap": false,
      "start_time": "00:11:44,410",
      "end_time": "00:12:07,971",
      "start_seconds": 704.41,
      "end_seconds": 727.971,
      "start_subtitle_index": 283,
      "end_subtitle_index": 295
    },
    {
      "scene_number": 10,
      "plot_segment": "A staff member delivers Jamie's CT scans to a doctor. Another character comments on the smell of bourbon and notes that Dr. Taylor, the anesthesiologist, is the best on staff. They joke about worrying only if he is too drunk to do his crossword puzzle.",
      "is_recap": false,
      "start_time": "00:12:27,307",
      "end_time": "00:12:55,490",
      "start_seconds": 747.307,
      "end_seconds": 775.49,
      "start_subtitle_index": 296,
      "end_subtitle_index": 307
    },
    {
      "scene_number": 11,
      "plot_segment": "Dr. Shepherd is informed that Jamie Hayes has been admitted with continuous seizure activity in her left foot and balance issues. Meredith explains the parents have traveled far for help. Shepherd requests new scans, as the old ones are three months old. Meredith agrees to order them.",
      "is_recap": false,
      "start_time": "00:12:58,711",
      "end_time": "00:13:22,139",
      "start_seconds": 778.711,
      "end_seconds": 802.139,
      "start_subtitle_index": 308,
      "end_subtitle_index": 322
    },
    {
      "scene_number": 12,
      "plot_segment": "A doctor examines Digby Owens and notes a bullet from a previous gunshot. The team discusses Digby's ethos of pain and recognize him as the tattooed masochist who has been shot before. They joke about his stupidity and prepare to inform him about his treatment for the current injury.",
      "is_recap": false,
      "start_time": "00:13:24,241",
      "end_time": "00:13:53,177",
      "start_seconds": 804.241,
      "end_seconds": 833.177,
      "start_subtitle_index": 323,
      "end_subtitle_index": 337
    },
    {
      "scene_number": 13,
      "plot_segment": "Bailey reviews Claire Rice's abdominal CTs and asks if the girl is fat. Meredith says she is a normal college kid. Bailey identifies a stapled stomach, indicating a gastric bypass, and explains the procedure is usually for obese patients. Claire's mother expresses concern, and Bailey warns that Claire will face lifelong malnutrition unless the surgery is reversed. The mother insists on surgery. Claire's mother describes buying new jeans for Claire and her academic achievements. Bailey explains complications from the bypass, including abscess and bowel swelling, and says recovery is uncertain. The mother asks the doctors to do whatever is necessary.",
      "is_recap": false,
      "start_time": "00:13:53,597",
      "end_time": "00:15:21,813",
      "start_seconds": 833.597,
      "end_seconds": 921.813,
      "start_subtitle_index": 338,
      "end_subtitle_index": 368
    },
    {
      "scene_number": 14,
      "plot_segment": "A doctor interacts with Jamie, calling her a princess and explaining medical procedures in child-friendly terms. The team prepares Jamie for MRI. Her parents worry about the cost of surgery, but the doctor reassures them not to worry. Jamie is diagnosed with focal left-side seizure, and diazepam is administered. The team prepares Jamie for MRI, using playful language to comfort her.",
      "is_recap": false,
      "start_time": "00:15:24,950",
      "end_time": "00:16:36,509",
      "start_seconds": 924.95,
      "end_seconds": 996.509,
      "start_subtitle_index": 369,
      "end_subtitle_index": 408
    },
    {
      "scene_number": 15,
      "plot_segment": "A patient, JP, is told he will be under conscious sedation for a procedure. He expresses frustration about his situation and argues with his partner Athena about past romantic gestures and manipulative behavior. Athena accuses JP of being passive-aggressive and needy. Their argument escalates, and a staff member asks Athena to leave to keep JP calm. During the procedure, JP's keys move farther down his digestive tract, causing concern. Athena is asked to leave the room.",
      "is_recap": false,
      "start_time": "00:16:38,111",
      "end_time": "00:17:28,511",
      "start_seconds": 998.111,
      "end_seconds": 1048.511,
      "start_subtitle_index": 409,
      "end_subtitle_index": 431
    },
    {
      "scene_number": 16,
      "plot_segment": "Digby Owens is visited by a doctor who jokes about his risky hobby of getting shot. Digby is running a fever due to stress from the gunshot. The doctor explains the bullet fractured a rib and caused a hemopneumothorax. Digby jokes about pain and wrestling. The team prepares to insert a chest tube to treat Digby's collapsed lung. Digby asks to watch the procedure.",
      "is_recap": false,
      "start_time": "00:17:30,971",
      "end_time": "00:18:50,278",
      "start_seconds": 1050.971,
      "end_seconds": 1130.278,
      "start_subtitle_index": 432,
      "end_subtitle_index": 459
    },
    {
      "scene_number": 17,
      "plot_segment": "Claire's parents confront her about her decision to have surgery in Mexico. Claire explains she tried healthy weight loss methods but they did not work for her. She says college is stressful and she wanted to focus on her studies. Her mother accuses her of taking shortcuts. The doctors recommend reversing the bypass, but Claire refuses, saying she would rather be thin. The doctors explain the choice is not hers due to medical complications.",
      "is_recap": false,
      "start_time": "00:18:50,298",
      "end_time": "00:20:23,708",
      "start_seconds": 1130.298,
      "end_seconds": 1223.708,
      "start_subtitle_index": 460,
      "end_subtitle_index": 492
    },
    {
      "scene_number": 18,
      "plot_segment": "Dr. Shepherd explains to Jamie's parents that she has Rasmussen's encephalitis, with part of her brain dead or dying. The condition has worsened since her last scans. The only treatment is to remove the diseased portion of her brain—half her brain. Shepherd explains that Jamie's age makes the surgery possible, as her brain can compensate. The parents are told the risks and potential for a relatively normal life if successful. Shepherd asks O'Malley if he wants to scrub in on the hemispherectomy, and O'Malley agrees.",
      "is_recap": false,
      "start_time": "00:20:37,761",
      "end_time": "00:22:02,577",
      "start_seconds": 1237.761,
      "end_seconds": 1322.577,
      "start_subtitle_index": 493,
      "end_subtitle_index": 521
    },
    {
      "scene_number": 19,
      "plot_segment": "O'Malley excitedly tells the other interns he will scrub in on a hemispherectomy with Dr. Shepherd. The group discusses the surgery and jokes about Dr. Shepherd and Meredith. Cristina claims to know everything about Meredith and Shepherd's relationship. The interns debate responsibility and professionalism, and joke about sex and coping mechanisms. George asks about Dr. Taylor's drinking, and Cristina says whatever gets you through the day. George wonders if he should report Taylor's drinking but is warned it is a 'can of worms.'",
      "is_recap": false,
      "start_time": "00:22:12,868",
      "end_time": "00:23:41,365",
      "start_seconds": 1332.868,
      "end_seconds": 1421.365,
      "start_subtitle_index": 522,
      "end_subtitle_index": 566
    },
    {
      "scene_number": 20,
      "plot_segment": "Digby Owens is told his new scar will be impressive. He discusses his hobbies and feels dizzy from blood loss. Digby encourages a doctor to make time for wrestling. The team continues treating Digby. In surgery, the doctors work on Claire Rice, freeing her bowel from adhesions caused by an abscess. Bailey instructs Meredith to pick up extra clinic duties due to Cristina's flu. Meredith apologizes for an inappropriate comment. Bailey warns Meredith about inappropriate behavior.",
      "is_recap": false,
      "start_time": "00:23:47,992",
      "end_time": "00:25:14,134",
      "start_seconds": 1427.992,
      "end_seconds": 1514.134,
      "start_subtitle_index": 567,
      "end_subtitle_index": 601
    },
    {
      "scene_number": 21,
      "plot_segment": "Bailey confronts Meredith about her relationship with Shepherd, saying half the hospital knows her business and that the flu is not the only virus spreading. Meredith says she made a choice and will live with the consequences. Bailey says she will have many hoops for Meredith to jump through. Meredith insists she gets her work done, even if not Bailey's way.",
      "is_recap": false,
      "start_time": "00:25:14,494",
      "end_time": "00:25:34,883",
      "start_seconds": 1514.494,
      "end_seconds": 1534.883,
      "start_subtitle_index": 602,
      "end_subtitle_index": 610
    },
    {
      "scene_number": 22,
      "plot_segment": "In surgery, Dr. Gray is instructed to repair an organ after draining it. Meredith expresses appreciation for the chance to scrub in. Someone brings Dr. Taylor a triple espresso and crossword puzzle. Taylor jokes about the importance of coffee in medicine. Jamie is prepared for anesthesia, and someone comments on a smell of alcohol. Meredith asks Dr. Taylor if he has been drinking. Taylor is offended and denies it. George is told he is out of line and removed from the operating room.",
      "is_recap": false,
      "start_time": "00:25:40,414",
      "end_time": "00:27:36,365",
      "start_seconds": 1540.414,
      "end_seconds": 1656.365,
      "start_subtitle_index": 611,
      "end_subtitle_index": 655
    },
    {
      "scene_number": 23,
      "plot_segment": "Athena and JP continue arguing about their relationship, discussing issues of control, jealousy, and unhealthy dynamics. Athena accuses JP of smothering her and says she cannot respect him. A staff member asks Athena to leave. During JP's procedure, the keys move farther down, causing a medical emergency. Athena panics, and the staff works to stabilize JP. The keys are successfully retrieved, and JP is told he will be fine. Athena is advised to leave for everyone's sake.",
      "is_recap": false,
      "start_time": "00:27:40,327",
      "end_time": "00:29:32,397",
      "start_seconds": 1660.327,
      "end_seconds": 1772.397,
      "start_subtitle_index": 656,
      "end_subtitle_index": 696
    },
    {
      "scene_number": 24,
      "plot_segment": "Meredith requests a shower after a messy surgery. Bailey instructs Meredith to inform Claire's parents about her condition before showering, calling it a 'hoop.' Meredith is allowed to shower first. Meredith jokes about smelling like karma, and her roommate comments on something vile in her hair. They discuss Meredith's luck in getting the best surgeries and the resulting unpleasantness. Meredith is called to assist Dr. Shepherd in surgery. Cristina insists she is healthy enough to go, but Bailey selects Meredith. Cristina accuses Meredith of getting special treatment due to her relationship with Shepherd.",
      "is_recap": false,
      "start_time": "00:29:32,837",
      "end_time": "00:31:18,523",
      "start_seconds": 1772.837,
      "end_seconds": 1878.523,
      "start_subtitle_index": 697,
      "end_subtitle_index": 736
    },
    {
      "scene_number": 25,
      "plot_segment": "Digby's post-op bloodwork shows a severe spike in white blood cell count, indicating infection. The team investigates possible sources, and Digby reveals a new tattoo on his calf. The tattoo is found to be infected, and the infection is worsened by the gunshot wound. Digby is sent to ICU for antibiotics.",
      "is_recap": false,
      "start_time": "00:31:20,846",
      "end_time": "00:33:48,865",
      "start_seconds": 1880.846,
      "end_seconds": 2028.865,
      "start_subtitle_index": 737,
      "end_subtitle_index": 782
    },
    {
      "scene_number": 26,
      "plot_segment": "In Jamie's hemispherectomy surgery, Dr. Shepherd and Dr. Yang discuss the procedure, including coagulating and dividing branches of the anterior cerebral artery. Dr. Taylor's anesthesia is noted to be light, and Jamie begins to wake up. Taylor is found asleep and is awakened. Shepherd orders Taylor to leave and calls for another anesthesiologist. Taylor apologizes and leaves the operating room.",
      "is_recap": false,
      "start_time": "00:33:57,703",
      "end_time": "00:35:01,208",
      "start_seconds": 2037.703,
      "end_seconds": 2101.208,
      "start_subtitle_index": 783,
      "end_subtitle_index": 808
    },
    {
      "scene_number": 27,
      "plot_segment": "Digby Owens goes into multisystem organ failure due to overwhelming sepsis. The team attempts to stabilize him with medication and defibrillation, but his condition deteriorates. The staff works to resuscitate him.",
      "is_recap": false,
      "start_time": "00:35:09,034",
      "end_time": "00:35:33,135",
      "start_seconds": 2109.034,
      "end_seconds": 2133.135,
      "start_subtitle_index": 809,
      "end_subtitle_index": 821
    },
    {
      "scene_number": 28,
      "plot_segment": "The surgical team completes Jamie's hemispherectomy, packing the cavity to prevent hemorrhaging. Dr. Yang explains that cerebrospinal fluid will eventually fill the cavity. Shepherd praises the team and allows two interns to close up. The team reflects on the experience, feeling tired but exhilarated by the surgery.",
      "is_recap": false,
      "start_time": "00:35:40,625",
      "end_time": "00:36:32,788",
      "start_seconds": 2140.625,
      "end_seconds": 2192.788,
      "start_subtitle_index": 822,
      "end_subtitle_index": 836
    },
    {
      "scene_number": 29,
      "plot_segment": "George apologizes for questioning Dr. Taylor about drinking, and Taylor admits he was out of line. Taylor says someone should have taken responsibility, and it should have been the surgeon. Taylor tells George he did the right thing, code or no code.",
      "is_recap": false,
      "start_time": "00:36:36,025",
      "end_time": "00:36:58,606",
      "start_seconds": 2196.025,
      "end_seconds": 2218.606,
      "start_subtitle_index": 837,
      "end_subtitle_index": 850
    },
    {
      "scene_number": 30,
      "plot_segment": "Dr. Shepherd and another character discuss Meredith, with Shepherd insisting he does not favor her and that she is 'pretty great.' They prepare to inform Jamie's parents about her recovery. Meredith tells Claire Rice she will not get fat, and social services will contact her parents to help. Meredith reflects that life is not supposed to be this hard.",
      "is_recap": false,
      "start_time": "00:37:08,695",
      "end_time": "00:38:06,514",
      "start_seconds": 2228.695,
      "end_seconds": 2286.514,
      "start_subtitle_index": 851,
      "end_subtitle_index": 869
    },
    {
      "scene_number": 31,
      "plot_segment": "A character notes the time of death for a patient. Another reflects on meeting someone from back home. The narration suggests that people out to get you do not know you are here, so there is no need to worry.",
      "is_recap": false,
      "start_time": "00:38:06,936",
      "end_time": "00:38:31,166",
      "start_seconds": 2286.936,
      "end_seconds": 2311.166,
      "start_subtitle_index": 870,
      "end_subtitle_index": 875
    },
    {
      "scene_number": 32,
      "plot_segment": "Late at night, Meredith and Izzie talk in the kitchen. Izzie offers cake and says it is full of rage and hostility. Izzie confronts Meredith about her relationship with Shepherd, comparing their backgrounds and experiences. Izzie accuses Meredith of throwing away her respect for a few good surgeries. Meredith insists it is not about surgeries or getting ahead. Izzie realizes Meredith is falling for Shepherd, which Meredith denies. Izzie teases Meredith about being mushy and asks for details about the sex. Meredith jokes about hating Izzie and her cake.",
      "is_recap": false,
      "start_time": "00:38:35,516",
      "end_time": "00:40:48,280",
      "start_seconds": 2315.516,
      "end_seconds": 2448.28,
      "start_subtitle_index": 876,
      "end_subtitle_index": 920
    },
    {
      "scene_number": 33,
      "plot_segment": "Meredith reflects on pain and whether people are wired to seek it. Cristina is mentioned. Meredith suggests that without pain, maybe they would not feel real. Meredith and another character consider sleeping. Meredith recalls the saying, 'Why do I keep hitting myself with a hammer?' and answers, 'because it feels so good when I stop.'",
      "is_recap": false,
      "start_time": "00:40:49,380",
      "end_time": "00:42:00,264",
      "start_seconds": 2449.38,
      "end_seconds": 2520.264,
      "start_subtitle_index": 921,
      "end_subtitle_index": 935
    }
  ]
}