[
  {
    "title": "Meredith and Derek's Complex Relationship",
    "arc_type": "Soap Arc",
    "description": "Meredith Grey and Derek Shepherd navigate their intricate personal and professional relationship, which begins with a one-night stand and evolves amidst hospital challenges and personal revelations, including the arrival of Derek's estranged wife, Addison.",
    "main_characters": "Meredith Grey; Derek Shepherd",
    "interfering_episode_characters": "Zona Cruz; Jorge Cruz",
    "single_episode_progression_string": "Derek flirts with Meredith, wanting to take her to breakfast. Meredith is annoyed by Derek's advances. Derek reminds Meredith that Jorge and Zona's surgery decision is theirs to make."
  },
  {
    "title": "Izzie Stevens' Fight for Respect and Ethical Challenges",
    "arc_type": "Soap Arc",
    "description": "Izzie Stevens battles stereotypes and seeks respect from her colleagues while facing ethical dilemmas in patient care, particularly in advocating for her patients' well-being.",
    "main_characters": "Izzie Stevens",
    "interfering_episode_characters": "George O'Malley; Alex Karev; Mr. Humphrey; Dr. Harry Victor",
    "single_episode_progression_string": "Izzie walks around in her underwear, making George uncomfortable. Mr. Humphrey refuses Izzie's help for his prostate cancer biopsy. Izzie realizes Mr. Humphrey saw her photoshoot. Izzie confronts Alex about exposing her modeling past. Izzie talks to Mr. Humphrey about his embarrassment. Izzie advises Dr. Victor not to cut the nerves during surgery."
  },
  {
    "title": "Meredith Grey's Legacy and Personal Struggles",
    "arc_type": "Soap Arc",
    "description": "Meredith Grey navigates the challenges of her medical career while dealing with the shadow of her mother, Ellis Grey, a legendary surgeon, and the emotional impact of Ellis's Alzheimer's disease.",
    "main_characters": "Meredith Grey",
    "interfering_episode_characters": "Liz Fallon; Richard Webber; Derek Shepherd",
    "single_episode_progression_string": "Meredith learns Liz Fallon, her mother's former scrub nurse, is admitted to the hospital. Liz remembers Ellis but not Meredith, deepening Meredith's emotional struggle. Meredith visits Liz, and they discuss Ellis. Liz's death further impacts Meredith as she reflects on her mother's legacy."
  },
  {
    "title": "Interns' Bond and Support Network",
    "arc_type": "Soap Arc",
    "description": "Meredith, Cristina, George, and Izzie form a strong support system, navigating the challenges of their surgical internships together, developing deep friendships, and supporting each other through personal and professional trials.",
    "main_characters": "Meredith; Cristina; George; Izzie",
    "interfering_episode_characters": "Alex; Derek; Bailey",
    "single_episode_progression_string": "George expresses discomfort about Izzie's behavior, but Meredith and Izzie dismiss his concerns. George shares his morning frustrations with Izzie and Meredith. Izzie and Meredith are angry with George for not buying tampons. Izzie confronts Alex about mocking her modeling past. Izzie supports Mr. Humphrey against Dr. Victor's aggressive approach."
  },
  {
    "title": "Cristina Yang's Ambition and Emotional Detachment",
    "arc_type": "Genre-Specific Arc",
    "description": "Cristina Yang's relentless ambition in her surgical career often leads to emotional detachment from patients, as she struggles to balance her drive for success with the compassionate aspects of patient care.",
    "main_characters": "Cristina Yang",
    "interfering_episode_characters": "Liz Fallon; Preston Burke",
    "single_episode_progression_string": "Cristina is assigned to Liz Fallon, a terminal patient. Liz teases Cristina about trying to impress Burke. Cristina confronts Burke about sending her on pointless tests. Burke reveals Liz is terminal and admitted to die at Seattle Grace."
  },
  {
    "title": "Bailey's Mentorship, Leadership, and Empathy",
    "arc_type": "Genre-Specific Arc",
    "description": "Miranda Bailey, known for her tough but fair approach, mentors the new interns, guiding them through their first year with high standards, discipline, and empathy. Her leadership shapes their development as future surgeons, balancing rigorous training with understanding and support.",
    "main_characters": "Miranda Bailey",
    "interfering_episode_characters": "Izzie Stevens; Dr. Harry Victor",
    "single_episode_progression_string": "Bailey scolds Izzie for not handling Mr. Humphrey's case properly. Bailey supports Izzie's suggestion to Dr. Victor about preserving Mr. Humphrey's nerves."
  },
  {
    "title": "Navigating Power Dynamics at Seattle Grace",
    "arc_type": "Genre-Specific Arc",
    "description": "The interns and residents at Seattle Grace Hospital navigate complex power dynamics, dealing with attendings' expectations, peer competition, and the hierarchical structure of the hospital.",
    "main_characters": "George; Cristina; Izzie; Meredith",
    "interfering_episode_characters": "Burke; Alex; Liz Fallon; Bailey; Derek",
    "single_episode_progression_string": "George expresses discomfort about Izzie's behavior, but his concerns are dismissed. Cristina is assigned to Liz Fallon and feels pressure to impress Burke. Izzie faces challenges with a patient who refuses her help due to her modeling past. Meredith struggles with her mother's memory issues and the presence of Liz Fallon. Izzie confronts Alex about exposing her modeling photos. Cristina learns Liz is terminal and was admitted to die at Seattle Grace."
  },
  {
    "title": "Alex's Competitive Drive and Professional Growth",
    "arc_type": "Genre-Specific Arc",
    "description": "Alex Karev's competitive nature often leads him to clash with fellow interns and patients as he seeks to establish his reputation and advance his career in the demanding environment of surgical training.",
    "main_characters": "Alex Karev",
    "interfering_episode_characters": "Izzie Stevens; Derek Shepherd",
    "single_episode_progression_string": "Alex prints large photos of Izzie's modeling past and displays them in the locker room. Izzie confronts Alex about the photos, asserting her accomplishments. Alex assists Derek with a complex trauma case involving a patient with nails in his head."
  }
]