[
  {
    "title": "George's Struggle with Personal Boundaries in the House",
    "arc_type": "Soap Arc",
    "description": "George grapples with discomfort over Izzie's lack of modesty at home, leading to ongoing tension and comedic conflict with his roommates, especially as his complaints are dismissed.",
    "main_characters": "George O'Malley; Izzie Stevens; Meredith Grey",
    "interfering_episode_characters": "None",
    "single_episode_progression_string": "George is visibly uncomfortable when Izzie walks around in her underwear; he repeatedly complains to Meredith and Izzie, who laugh off his concerns. The conflict escalates when George refuses to buy tampons for the women, further highlighting his struggle to adapt to the household's dynamics.",
    "thematic_focus": "personal_boundaries; roommate_conflict",
    "narrative_scope": "episode",
    "consolidation_notes": ""
  },
  {
    "title": "Izzie Stevens Confronts Sexism and Professional Respect",
    "arc_type": "Genre-Specific Arc",
    "description": "Izzie faces challenges to her professional credibility due to her past as a model, confronting both a patient's discomfort and a colleague's mockery, and ultimately asserts her competence and demands respect.",
    "main_characters": "Izzie Stevens",
    "interfering_episode_characters": "Alex Karev; Mr. Humphrey; Dr. Bailey; Dr. Victor",
    "single_episode_progression_string": "Izzie is rejected by Mr. Humphrey, who is embarrassed after seeing her modeling photos; Alex humiliates her by posting the photos around the hospital. Izzie confronts both men, defends her qualifications, and advocates for her patient’s sexual health, earning support from Bailey.",
    "thematic_focus": "professional_respect; sexism; self-advocacy",
    "narrative_scope": "episode",
    "consolidation_notes": ""
  },
  {
    "title": "Meredith's Emotional Distance from Her Mother and Search for Connection",
    "arc_type": "Soap Arc",
    "description": "Meredith struggles with her mother's Alzheimer's, feeling hurt when Ellis remembers her old colleague Liz but not her own daughter, and seeks solace in connecting with Liz before her death.",
    "main_characters": "Meredith Grey; Ellis Grey; Liz Fallon",
    "interfering_episode_characters": "Richard Webber",
    "single_episode_progression_string": "Meredith is upset after Ellis recognizes Liz but not her; she spends time with Liz, discussing Ellis and the past, and is present when Liz dies, deepening her sense of loss and isolation.",
    "thematic_focus": "family_disconnection; grief; legacy",
    "narrative_scope": "episode",
    "consolidation_notes": ""
  },
  {
    "title": "Cristina Yang’s Professional Challenge with Burke and Terminal Care",
    "arc_type": "Genre-Specific Arc",
    "description": "Cristina is assigned to care for Liz Fallon under Burke’s supervision, navigating the emotional and ethical complexities of treating a terminally ill, respected colleague, and questioning her mentor’s motives.",
    "main_characters": "Cristina Yang; Preston Burke; Liz Fallon",
    "interfering_episode_characters": "None",
    "single_episode_progression_string": "Cristina is teased by Liz for trying to impress Burke; she confronts Burke about unnecessary tests and learns Liz is terminally ill and chose to die at Seattle Grace, prompting Cristina to reflect on end-of-life care and her own ambitions.",
    "thematic_focus": "mentor_relationships; terminal_care; professional_identity",
    "narrative_scope": "episode",
    "consolidation_notes": ""
  },
  {
    "title": "Ethical Dilemmas in High-Risk Surgery: Jorge Cruz’s Case",
    "arc_type": "Anthology Arc",
    "description": "The team faces a life-or-death decision when Jorge Cruz is admitted with multiple nails in his head, forcing his wife Zona to choose between a risky surgery and quality of life, while Meredith questions the ethics of prolonging suffering.",
    "main_characters": "Meredith Grey; Derek Shepherd; Alex Karev; Jorge Cruz; Zona Cruz",
    "interfering_episode_characters": "George O'Malley",
    "single_episode_progression_string": "Derek, Meredith, and Alex treat Jorge Cruz; Zona must decide on a dangerous surgery. Meredith challenges Zona’s choice, questioning whether more years are worth the risk, but Derek reminds her the decision is not hers. Zona chooses surgery, prioritizing time with her husband.",
    "thematic_focus": "ethical_challenges; patient_autonomy; risk_vs_quality_of_life",
    "narrative_scope": "episode",
    "consolidation_notes": ""
  }
]