[
  {
    "title": "Meredith and Derek's Complicated Relationship",
    "arc_type": "Soap Arc",
    "description": "The evolving romantic and professional dynamics between Meredith and Derek as they navigate their feelings and responsibilities at Seattle Grace Hospital.",
    "episodic": false,
    "characters": "Meredith; Derek",
    "single_episode_progression_string": "Derek attempts to flirt with Meredith and take her out for breakfast, but she is annoyed by his advances, highlighting the tension in their relationship."
  },
  {
    "title": "Cristina Yang's Ambition and Challenges",
    "arc_type": "Soap Arc",
    "description": "Cristina Yang's journey as she balances her ambition and competitiveness with the challenges of being a surgical intern.",
    "episodic": false,
    "characters": "Cristina; Liz; Burke",
    "single_episode_progression_string": "Cristina is mocked by Liz for trying to impress Preston Burke, showcasing her ambition and the challenges she faces in her pursuit of recognition."
  },
  {
    "title": "George O'Malley's Insecurities and Self-Doubt",
    "arc_type": "Soap Arc",
    "description": "George O'Malley faces insecurities about his abilities as a surgeon and his place among his peers.",
    "episodic": false,
    "characters": "George; Izzie; Meredith",
    "single_episode_progression_string": "George expresses embarrassment over Izzie's behavior and continues to worry about his standing among his peers, reflecting his ongoing self-doubt."
  },
  {
    "title": "Izzie Stevens' Professional Development",
    "arc_type": "Soap Arc",
    "description": "Izzie Stevens faces personal challenges while striving to establish herself as a competent surgical intern.",
    "episodic": false,
    "characters": "Izzie; Mr. Humphrey; Dr. Victor",
    "single_episode_progression_string": "Izzie confronts Mr. Humphrey about his refusal for a biopsy and defends her achievements against Alex, demonstrating her growth and determination to prove herself."
  },
  {
    "title": "The Weight of Family Legacy on Meredith Grey",
    "arc_type": "Soap Arc",
    "description": "Meredith grapples with the legacy of her mother, renowned surgeon Ellis Grey, and how it affects her identity and career.",
    "episodic": false,
    "characters": "Meredith; Ellis; Liz",
    "single_episode_progression_string": "Meredith reminisces about her mother, Ellis Grey, while interacting with Liz, emphasizing the impact of her mother's legacy on her life and career."
  },
  {
    "title": "Medical Case: Terminal Condition of Liz Fallon",
    "arc_type": "Episodic Arc",
    "description": "The challenges faced by the surgical team as they deal with the terminal condition of veteran nurse Liz Fallon.",
    "episodic": true,
    "characters": "Liz; Cristina; Izzie; Meredith; Derek",
    "single_episode_progression_string": "The episode centers around Liz's terminal diagnosis, her interactions with Cristina, and her eventual death after signing a do-not-resuscitate order, impacting the team emotionally."
  },
  {
    "title": "Medical Case: Trauma from a Nail Gun Accident",
    "arc_type": "Episodic Arc",
    "description": "The team at Seattle Grace deals with a traumatic case involving a man who has sustained severe injuries from a nail gun accident.",
    "episodic": true,
    "characters": "Derek; Meredith; Alex; Jorge; Zona",
    "single_episode_progression_string": "Derek, Alex, and Meredith work on Jorge Cruz, who has sixteen nails embedded in his head, while Zona must decide on the risky surgery, showcasing the medical challenges faced by the team."
  },
  {
    "title": "Medical Case: Prostate Cancer and Patient Refusal",
    "arc_type": "Episodic Arc",
    "description": "Izzie navigates the complexities of treating a patient with prostate cancer who refuses necessary procedures.",
    "episodic": true,
    "characters": "Izzie; Mr. Humphrey; Bailey",
    "single_episode_progression_string": "Izzie struggles to convince Mr. Humphrey to undergo a biopsy, leading to a confrontation with Bailey and a deeper understanding of patient autonomy."
  }
]