[
  {
    "title": "Meredith and Derek's Complicated Relationship",
    "arc_type": "Soap Arc",
    "description": "Meredith and Derek's relationship begins with a one-night stand and evolves amidst professional challenges and personal revelations.",
    "episodic": false,
    "main_characters": "Meredith Grey; Derek Shepherd",
    "interfering_episode_characters": "Zona Cruz",
    "single_episode_progression_string": "Derek flirts with Meredith, which annoys her, highlighting the ongoing tension and complexity in their relationship. Later, Derek pulls Meredith aside to remind her that the decision about Jorge's surgery was up to the patient and his wife."
  },
  {
    "title": "Meredith's Struggle with Her Mother's Alzheimer's",
    "arc_type": "Soap Arc",
    "description": "Meredith grapples with her mother's Alzheimer's diagnosis while trying to establish herself as a competent intern.",
    "episodic": false,
    "main_characters": "Meredith Grey",
    "interfering_episode_characters": "Ellis Grey; Liz Fallon",
    "single_episode_progression_string": "Meredith visits her mother and feels upset because Ellis remembers Liz, her scrub nurse, but not Meredith. Liz's presence and subsequent death highlight Meredith's ongoing struggle with her mother's condition."
  },
  {
    "title": "Intern Dynamics at Seattle Grace",
    "arc_type": "Genre-Specific Arc",
    "description": "The interns at Seattle Grace Hospital form friendships and rivalries as they navigate the challenges of their medical training.",
    "episodic": false,
    "main_characters": "Izzie Stevens; Meredith Grey; George O'Malley",
    "interfering_episode_characters": "Alex Karev",
    "single_episode_progression_string": "George expresses frustration about Izzie walking around in her underwear. Izzie and Meredith dismiss his concerns. Izzie and Meredith are later angry with George for not buying tampons. Izzie confronts Alex for mocking her modeling past."
  },
  {
    "title": "Cristina's Competitive Nature",
    "arc_type": "Genre-Specific Arc",
    "description": "Cristina Yang's ambition and competitive drive often put her at odds with her peers, particularly Meredith.",
    "episodic": false,
    "main_characters": "Cristina Yang",
    "interfering_episode_characters": "Preston Burke; Liz Fallon",
    "single_episode_progression_string": "Cristina is assigned to Liz Fallon and tries to impress Burke. She confronts Burke about sending her to do pointless tests on Liz, only to learn Liz is terminal."
  },
  {
    "title": "Medical Case: Jorge Cruz's Nail Gun Injury",
    "arc_type": "Episodic Arc",
    "description": "A patient, Jorge Cruz, is admitted with sixteen nails in his head after a nail gun accident, requiring a risky surgery.",
    "episodic": true,
    "main_characters": "Jorge Cruz; Zona Cruz",
    "interfering_episode_characters": "Derek Shepherd; Meredith Grey; Alex Karev",
    "single_episode_progression_string": "Derek's patient, Jorge Cruz, has sixteen nails in his head from a nail gun accident. His wife, Zona, must decide on a risky surgery. Meredith tries to convince Zona to reconsider, but Zona insists on proceeding."
  },
  {
    "title": "Medical Case: Mr. Humphrey's Prostate Cancer",
    "arc_type": "Episodic Arc",
    "description": "Izzie's patient, Mr. Humphrey, refuses her help for his prostate cancer biopsy, leading to a confrontation about his treatment options.",
    "episodic": true,
    "main_characters": "Izzie Stevens; Mr. Humphrey",
    "interfering_episode_characters": "Miranda Bailey; Dr. Harry Victor",
    "single_episode_progression_string": "Mr. Humphrey refuses Izzie's help due to embarrassment over her modeling past. Izzie confronts him, and he explains his embarrassment. Izzie advises Dr. Victor not to cut the nerves, and Bailey supports her."
  }
]