[
  {
    "title": "Meredith and Derek's Complicated Romance",
    "arc_type": "Soap Arc",
    "description": "Meredith and Derek's relationship begins with a one-night stand, complicated by Derek being her boss. Their romance faces challenges, including workplace gossip and Meredith's struggle to keep it professional.",
    "episodic": false,
    "main_characters": "Meredith Grey; Derek Shepherd",
    "interfering_episode_characters": "George O'Malley; Isobel Stevens",
    "single_episode_progression_string": "Meredith questions Derek about why they always stay at her place, leading to a discussion about their relationship. She decides to withhold sex until she knows him better, prompting Derek to share more about himself by the episode's end."
  },
  {
    "title": "Intern Dynamics and Rivalries",
    "arc_type": "Genre-Specific Arc",
    "description": "The new interns at Seattle Grace Hospital navigate their roles, forming alliances and rivalries as they begin their medical careers.",
    "episodic": false,
    "main_characters": "George O'Malley; Alex Karev; Cristina Yang; Isobel Stevens",
    "interfering_episode_characters": "Meredith Grey; Derek Shepherd",
    "single_episode_progression_string": "George and Alex have a tense interaction during an intubation, highlighting their rivalry. Cristina asks George to cover for her, showing the dynamics of favors among interns. Izzie and Cristina discuss personal matters, revealing their evolving relationships."
  },
  {
    "title": "Cristina's Professional Ambitions",
    "arc_type": "Genre-Specific Arc",
    "description": "Cristina Yang navigates her professional ambitions and challenges, often clashing with her superiors and colleagues.",
    "episodic": false,
    "main_characters": "Cristina Yang",
    "interfering_episode_characters": "Bailey; George O'Malley; Mr. Duff",
    "single_episode_progression_string": "Cristina is determined to have a procedure done before her ENT rotation, showing her focus on career advancement. She clashes with a psych resident over a patient's diagnosis and is assigned a challenging case involving a pregnant cancer patient."
  },
  {
    "title": "Medical Case: Psychic Patient with Seizures",
    "arc_type": "Episodic Arc",
    "description": "A patient claims to have psychic abilities, leading to a medical investigation to determine the cause of his seizures.",
    "episodic": true,
    "main_characters": "Cristina Yang; Meredith Grey; Mr. Duff",
    "interfering_episode_characters": "Isobel Stevens; Miranda Bailey",
    "single_episode_progression_string": "Cristina and Meredith handle a patient, Mr. Duff, who claims to be psychic. They discover he has epilepsy and an arteriovenous malformation, leading to surgery to prevent further complications."
  },
  {
    "title": "Medical Case: Devo's Heart Valve Dilemma",
    "arc_type": "Episodic Arc",
    "description": "A young patient, Devo, faces a life-threatening condition requiring a heart valve replacement, complicated by her religious beliefs.",
    "episodic": true,
    "main_characters": "Alex Karev; Preston Burke; Devo Friedman",
    "interfering_episode_characters": "Devo Friedman's Parents",
    "single_episode_progression_string": "Devo needs a heart valve replacement but refuses a pig valve due to religious reasons. Alex finds an alternative bovine valve solution, and Burke performs the surgery with remote guidance."
  },
  {
    "title": "Medical Case: Zoey's Cancer and Pregnancy",
    "arc_type": "Episodic Arc",
    "description": "A pregnant patient, Zoey, must decide between cancer treatment and her pregnancy, facing a life-altering decision.",
    "episodic": true,
    "main_characters": "Cristina Yang; Miranda Bailey; Zoey Glass",
    "interfering_episode_characters": "Zoey Glass's Husband",
    "single_episode_progression_string": "Cristina and Bailey handle Zoey's case, where she must choose between cancer treatment and her pregnancy. Zoey decides to keep the baby, despite the risks, highlighting the emotional and ethical challenges."
  }
]