[
  {
    "title": "George O'Malley's Evolution from Insecurity to Competence",
    "arc_type": "Soap Arc",
    "description": "George's journey from self-doubt and professional insecurity to gaining confidence, skill, and acceptance among his colleagues and superiors.",
    "main_characters": "Alex Karev; Izzie Stevens; Cristina Yang; Meredith Grey; George O'Malley",
    "interfering_episode_characters": "Mr. Walker; Alex Karev; Devo/Esther Friedman; Izzie Stevens; Nurse Olivia Harper; Mr. Duff; Preston Burke; Cristina Yang; Zoey Glass; Nurse Harper; Meredith Grey; Miranda Bailey; Derek Shepherd",
    "single_episode_progression_string": "George tells Izzie her cupcakes are good enough for Martha Stewart. George suggests Izzie call her mother for help with her baking. George is distracted by Derek and Meredith and talks about changing his appearance. George agrees to cover Cristina's shift on the 16th without knowing the reason. George struggles and fails to intubate a patient, requiring Burke to step in. Alex teases George about his lack of confidence with women. Cristina encourages George to talk to Nurse Harper. George successfully intubates a patient in front of Nurse Harper and Burke. Nurse Harper praises George for his performance. Alex gives George a condom after his success with Nurse Harper. Izzie repeatedly bakes cupcakes, striving for perfection. George fails to intubate a patient but later successfully intubates another under supervision. Cristina requests a shift change to accommodate a personal medical procedure. Alex researches and proposes a bovine valve transplant for Devo and presents it to Burke. Cristina is assigned to perform a dilation and curettage for the first time. Izzie receives a warning from Bailey about becoming too emotionally involved with patients. Meredith questions the ethics of Derek's surgical decision. The interns share information and support each other during their shifts. Cristina asks George to cover her shift to accommodate a personal medical procedure. Bailey assigns Cristina to assist with a breast cancer case after Cristina negotiates to avoid Mr. Duff's case. Izzie attempts to prepare Mr. Duff for surgery, but Bailey instructs her to wait for surgeon authorization. Alex identifies the bovine valve option for Devo and presents it to Burke without prior approval. Burke removes Alex from Devo's case for overstepping, but later reinstates him to help obtain the bovine valve and a rabbi. George successfully intubates a patient in front of Nurse Harper and Burke and receives praise."
  },
  {
    "title": "Intern Adaptation to Medical Training Demands",
    "arc_type": "Soap Arc",
    "description": "The comprehensive challenges faced by surgical interns as they adapt to the emotional, professional, and personal demands of medical training.",
    "main_characters": "Alex Karev; Izzie Stevens; Cristina Yang; Meredith Grey; George O'Malley",
    "interfering_episode_characters": "Burke; Devo/Esther; Mr. Walker; Devo/Esther Friedman; Mr. Duff; Preston Burke; Nurse Harper; Zoey Glass; Izzie's Mother (mentioned); Miranda Bailey; Mrs. Glass; Derek Shepherd",
    "single_episode_progression_string": "Izzie obsesses over her cupcakes and refuses to call her mother for help. George fails to intubate a patient and is corrected by Burke, then later successfully intubates another patient and gains confidence. Cristina tries to schedule a medical procedure for herself and asks George to cover her shift. Cristina delivers difficult news to Zoey about her cancer and pregnancy, prepares her for an abortion, and then faces Zoey's decision to keep the baby. Meredith questions the ethics of Derek's decision to operate on Mr. Walker and worries about making the wrong call. Izzie becomes emotionally involved with Mr. Duff and is confronted by Bailey about her boundaries. Alex connects with Devo/Esther over her faith, advocates for a different surgical option, and is reprimanded by Burke for overstepping. The interns gather at the end of the day and share their emotional burdens and small victories. Derek stays at Meredith's house for a week, blurring lines between work and personal space. Meredith questions Derek about their relationship and expresses discomfort with their lack of separation between work and home. Cristina tries to rearrange her schedule for a medical procedure and asks George to cover her shift. Cristina negotiates with Bailey to avoid working with a patient, agreeing to extra paperwork. Izzie obsesses over her cupcakes and refuses to call her mother, showing strain in her personal connections. George seeks advice about his appearance and romantic prospects while distracted by work. The interns discuss covering shifts and managing personal needs amid work demands. Izzie repeatedly bakes cupcakes, striving for perfection. George fails to intubate a patient but later successfully intubates another under supervision. Cristina requests a shift change to accommodate a personal medical procedure. Alex researches and proposes a bovine valve transplant for Devo and presents it to Burke. Cristina is assigned to perform a dilation and curettage for the first time. Izzie receives a warning from Bailey about becoming too emotionally involved with patients. Meredith questions the ethics of Derek's surgical decision. The interns share information and support each other during their shifts."
  },
  {
    "title": "Seattle Grace Hospital Hierarchy and Training Culture",
    "arc_type": "Genre-Specific Arc",
    "description": "The complex institutional dynamics, power structures, and teaching relationships that shape the professional environment at Seattle Grace Hospital.",
    "main_characters": "Richard Webber; Alex Karev; Miranda Bailey; Izzie Stevens; Preston Burke; Cristina Yang; Meredith Grey; George O'Malley",
    "interfering_episode_characters": "Alex Karev; Devo/Esther Friedman; Izzie Stevens; Mr. Duff; George O'Malley; Preston Burke; Cristina Yang; Nurse Harper; Zoey Glass; Hospital Psych Resident; Meredith Grey; Miranda Bailey; Hospital Administration Staff; Derek Shepherd",
    "single_episode_progression_string": "Izzie receives criticism from Bailey for being too emotionally involved with patients. Cristina asks George to cover her shift and refuses to explain her reasons. Bailey assigns Cristina extra paperwork in exchange for reassigning her from a case. Alex suggests a bovine valve transplant to Devo's family without consulting Burke. Burke removes Alex from Devo's case for overstepping. Burke later asks Alex to help with the bovine valve transplant and to find a rabbi for Devo. George fails an intubation in front of Burke but later successfully intubates a patient under Nurse Harper's supervision while Burke observes. The residents joke about Meredith's influence over Derek's surgical decisions, referencing hierarchy and decision-making. Bailey assigns Cristina extra paperwork in exchange for a case reassignment. Bailey questions Izzie's emotional involvement with patients and critiques her approach. Burke removes Alex from Devo's case for not consulting him before suggesting a new treatment. Burke later asks Alex for help with the bovine valve and includes him in the surgery. Burke and Cristina discuss the challenges of finding solutions and the burden of responsibility. Bailey supervises Cristina on a sensitive case and pushes her to perform a difficult procedure. Burke observes George's successful intubation and silently acknowledges his progress. Cristina is told there are no openings for her requested procedure until the 16th and must negotiate scheduling around her rotation. The psych resident refuses to take back Mr. Duff until he is medically cleared, citing hospital policy. Bailey leverages paperwork duties in exchange for Cristina switching patients. Burke removes Alex from Devo's case for bypassing the chain of command and discussing treatment options with the family before consulting him. Burke asks Alex to help secure a bovine valve and a rabbi, adapting within policy constraints. Bailey requires proper consent forms for Mr. Duff's surgery. Zoey Glass's case involves legal and ethical hospital protocols regarding pregnancy and cancer treatment, including psychiatric evaluation requests and consent for abortion procedures. Burke consults a remote expert via video call for the bovine valve transplant, adapting to institutional limitations."
  },
  {
    "title": "Medical Case: Devo/Esther Friedman's Valve Replacement",
    "arc_type": "Anthology Arc",
    "description": "A 17-year-old girl, Devo (Esther), is hospitalized with excessive bleeding and a heart murmur. Diagnosed with Von Willebrand's disease, she requires a heart valve replacement. Her religious beliefs prevent her from accepting a pig valve, prompting the surgical team to search for an alternative. The team ultimately performs a bovine valve transplant with the involvement of a rabbi and a specialist.",
    "main_characters": "Devo/Esther Friedman; Burke; Alex Karev",
    "interfering_episode_characters": "Devo's parents; Rabbi; Bovine valve specialist; Izzie Stevens",
    "single_episode_progression_string": "Devo is admitted for excessive bleeding and diagnosed with Von Willebrand's disease and a heart murmur. Burke and Alex inform Devo and her parents that she needs a valve replacement and suggest a pig valve. Devo refuses the pig valve for religious reasons. Devo asks Alex to find another option. Alex researches and discovers a bovine valve alternative. Alex tells Devo's family about the bovine valve in front of Burke. Burke removes Alex from the case for not consulting him. Burke later asks Alex how to obtain a bovine valve and requests a rabbi to bless the procedure. A specialist assists via video call during surgery. Burke performs the bovine valve transplant with the rabbi's blessing."
  },
  {
    "title": "Medical Case: Mr. Duff the Psychic's Seizures",
    "arc_type": "Anthology Arc",
    "description": "Mr. Duff, a patient committed for claiming to talk to the dead, is found to have seizures caused by an arteriovenous malformation in his brain. The case explores whether his visions are medical or supernatural, culminating in surgery to treat his condition and leaving ambiguity about the source of his abilities.",
    "main_characters": "Mr. Duff; Meredith Grey; Cristina Yang; Izzie Stevens",
    "interfering_episode_characters": "Miranda Bailey; George O'Malley; Psychiatric Resident",
    "single_episode_progression_string": "Mr. Duff is admitted after claiming to talk to the dead and having seizures. Cristina and Meredith begin a neurological workup. Mr. Duff predicts a death on the fourth floor, which coincides with a code blue. Cristina diagnoses epilepsy and orders an MRI. Izzie and Bailey review his scans and find an arteriovenous malformation. Izzie explains the need for surgery and obtains Mr. Duff's consent. Mr. Duff expresses fear that surgery will take away his visions. After surgery is planned, Mr. Duff tells Izzie the secret ingredient for her cupcakes, suggesting his visions persist."
  },
  {
    "title": "Medical Case: Mr. Walker's Sudden Paralysis",
    "arc_type": "Anthology Arc",
    "description": "Mr. Walker arrives at the hospital with sudden paralysis after a climbing accident. Derek and Meredith investigate the cause, debating between psychological and physical origins. The team races to diagnose and treat Mr. Walker, culminating in high-stakes surgery to restore his mobility.",
    "main_characters": "Derek Shepherd; Meredith Grey; Mr. Walker",
    "interfering_episode_characters": "Mrs. Walker; Nurse; Mr. Duff",
    "single_episode_progression_string": "Mr. Walker presents with sudden paralysis after a climbing fall. Derek examines Mr. Walker and orders an MRI. Meredith and Derek debate whether the cause is psychological or physical. Mr. Walker loses movement in his hands. Derek suspects a spinal clot and prepares for emergency surgery. Meredith questions the necessity of the surgery. Derek and Meredith operate and locate the clot in Mr. Walker's spine. Mr. Walker regains movement in his hand and thanks Meredith."
  },
  {
    "title": "Medical Case: Zoey Glass's Breast Cancer During Pregnancy",
    "arc_type": "Anthology Arc",
    "description": "Zoey Glass is diagnosed with breast cancer while pregnant. She must choose between starting treatment that would end her pregnancy or delaying treatment and risking her own life. Cristina and Bailey guide her through the medical and ethical complexities of her decision.",
    "main_characters": "Zoey Glass; Cristina Yang; Miranda Bailey",
    "interfering_episode_characters": "Zoey's husband; Psychiatric Resident",
    "single_episode_progression_string": "Cristina and Bailey inform Zoey of her breast cancer diagnosis during pregnancy. Zoey wants to delay treatment until after her pregnancy. Cristina explains that delaying treatment will endanger her life and that none of the treatments will allow the baby to survive. Zoey and her husband decide not to have an abortion. Cristina tries to persuade Zoey to reconsider and requests a psychiatric evaluation, which Zoey declines. Zoey tells Cristina she and her husband have decided the baby can live many years with the father and accepts the risks. Cristina delivers Zoey's discharge papers."
  },
  {
    "title": "Medical Case: Mrs. Glass's Lump Removal",
    "arc_type": "Anthology Arc",
    "description": "Bailey and Izzie perform a minor surgical procedure to remove a lump from Mrs. Glass. The case is used to explore Izzie's emotional reactions to patients and her skepticism about a psychic patient in the hospital, with Bailey questioning Izzie's agitation and emotional involvement.",
    "main_characters": "Izzie Stevens; Miranda Bailey",
    "interfering_episode_characters": "Mrs. Glass",
    "single_episode_progression_string": "Bailey and Izzie perform lump removal surgery on Mrs. Glass. Mrs. Glass discusses the psychic patient during the procedure. Izzie expresses skepticism about the psychic and claims she can predict the future better. Bailey questions Izzie's agitation and emotional involvement. Izzie denies being bothered. Bailey completes the surgery and explains the next steps to Mrs. Glass."
  },
  {
    "title": "Meredith Grey and Derek Shepherd's Secret Relationship",
    "arc_type": "Soap Arc",
    "description": "Meredith Grey and Derek Shepherd's relationship begins with an unexpected one-night stand, only for Meredith to discover Derek is her attending at Seattle Grace Hospital. Their mutual attraction and growing feelings are complicated by the need for secrecy, workplace ethics, and the later revelation of Derek's marriage to Addison. The arc follows their evolving dynamic as they navigate professional boundaries, secrecy, and the fallout from Addison's arrival.",
    "main_characters": "Meredith Grey; Derek Shepherd",
    "interfering_episode_characters": "George O'Malley; Izzie Stevens; Cristina Yang",
    "single_episode_progression_string": "Derek gets ready in Meredith's bedroom. Meredith asks Derek why they always sleep at her place and questions if he has his own place. Meredith expresses frustration about not knowing Derek well. Meredith tells Derek she will not have sex with him until she knows him better. Derek says learning about each other is the fun part of a relationship. Derek tells Meredith he thinks their relationship is serious. Meredith asks Derek to prove it. Derek takes Meredith to his trailer and shares personal details about himself."
  },
  {
    "title": "Intern Friendships and Rivalries: Meredith, Cristina, Izzie, George, and Alex",
    "arc_type": "Soap Arc",
    "description": "A group of surgical interns—Meredith, Cristina, Izzie, George, and Alex—navigate the pressures of their first year, forming bonds and rivalries as they compete for surgeries, support each other through personal and professional challenges, and gradually evolve from strangers into a close-knit team.",
    "main_characters": "Meredith Grey; Cristina Yang; Izzie Stevens; George O'Malley; Alex Karev",
    "interfering_episode_characters": "Derek Shepherd; Miranda Bailey; Preston Burke; Nurse Olivia Harper; Devo/Esther Friedman; Zoey Glass; Mr. Duff",
    "single_episode_progression_string": "Izzie bakes cupcakes and asks George for feedback. George reassures Izzie about her baking. Cristina asks George to cover her shift and refuses to explain. The interns discuss the psychic patient together. Cristina encourages George to approach Nurse Harper. George successfully intubates a patient with Nurse Harper. Alex and Izzie joke about Derek's breakfast habits. Alex helps Devo/Esther with her valve dilemma. George assists Alex by finding a bovine valve solution. The interns gather in the corridor and joke about surgeries. Izzie calls her mother after encouragement."
  },
  {
    "title": "Cristina Yang's Relentless Surgical Ambition",
    "arc_type": "Soap Arc",
    "description": "Cristina Yang's fierce drive to excel in surgery pushes her to prioritize her career above all else. Throughout the season, she aggressively seeks out surgical opportunities, navigates complex cases, and often clashes with colleagues and patients as she strives to prove herself as the most capable and dedicated resident.",
    "main_characters": "Cristina Yang",
    "interfering_episode_characters": "George O'Malley; Miranda Bailey; Zoey Glass; Burke; Psych Resident",
    "single_episode_progression_string": "Cristina requests an early procedure appointment to fit her surgical rotation. Cristina challenges the psych resident about a patient’s need for surgery. Cristina asks George to cover her shift on the 16th without explanation. Cristina is assigned to a breast cancer case with Bailey and must perform a dilation and curettage. Cristina bluntly presents Zoey Glass with her medical options and pushes for treatment. Cristina tries to persuade Zoey to choose cancer treatment over pregnancy. Cristina requests a psychiatric evaluation for Zoey after she refuses abortion. Cristina sits alone, reflecting on her inability to change Zoey's decision. Burke confides in Cristina about his lack of experience with a bovine valve transplant; Cristina points out his problem has a solution."
  },
  {
    "title": "Izzie Stevens' Fight for Professional Respect",
    "arc_type": "Soap Arc",
    "description": "Izzie Stevens faces skepticism from colleagues due to her modeling background and works to earn professional respect. Over time, she proves her medical competence, stands up for her patients, and becomes a valued member of the intern group.",
    "main_characters": "Izzie Stevens",
    "interfering_episode_characters": "George O'Malley; Miranda Bailey; Mr. Duff",
    "single_episode_progression_string": "Izzie bakes cupcakes and is frustrated by her inability to perfect the recipe. George reassures Izzie about her baking. Izzie refuses to call her mother for help. Izzie assists Bailey in surgery and asserts her opinions about the psychic patient. Bailey questions Izzie's emotional involvement with patients. Izzie identifies the arteriovenous malformation in Mr. Duff's scan and advocates for surgery. Bailey tells Izzie to wait for surgical authorization. Izzie obtains Mr. Duff's consent for surgery and explains the medical cause of his visions. Mr. Duff surprises Izzie by knowing personal details. After surgery, Mr. Duff gives Izzie the missing cupcake ingredient. Izzie calls her mother."
  },
  {
    "title": "Alex Karev's Struggle for Acceptance Among the Interns",
    "arc_type": "Soap Arc",
    "description": "Alex Karev's arrogance and dismissive attitude initially isolate him from the other interns. Over the season, he faces setbacks and learns to value collaboration, gradually earning acceptance and trust within the group.",
    "main_characters": "Alex Karev",
    "interfering_episode_characters": "Burke; George O'Malley; Devo (Esther) Friedman; Devo's parents",
    "single_episode_progression_string": "Alex jokes with Devo about her name and background. Alex assists Burke with Devo's case and suggests alternative diagnoses. Alex bonds with Devo over faith and searches for a solution that respects her beliefs. Alex discovers the option of a bovine valve for Devo and shares it with George. Alex tells Devo's family about the bovine valve without consulting Burke. Burke removes Alex from the case for overstepping. Burke later asks Alex to help secure a bovine valve and find a rabbi, acknowledging his contribution."
  },
  {
    "title": "Miranda Bailey's Tough Love Mentorship",
    "arc_type": "Soap Arc",
    "description": "Miranda Bailey, a demanding and principled surgical resident, establishes her reputation as a strict mentor while guiding new interns through the challenges of surgical training. The arc explores how Bailey balances discipline and support, shaping the interns into capable doctors through high expectations, direct feedback, and difficult assignments.",
    "main_characters": "Miranda Bailey",
    "interfering_episode_characters": "Izzie Stevens; Cristina Yang; Zoey Glass; Mr. Duff",
    "single_episode_progression_string": "Bailey supervises Izzie during surgery and questions her emotional involvement with patients. Bailey negotiates with Cristina, reassigning her from Mr. Duff in exchange for post-op paperwork. Bailey assigns Cristina to assist with Zoey Glass, a pregnant breast cancer patient. Bailey instructs Cristina to perform a dilation and curettage. Bailey discusses Zoey Glass's case with Cristina and challenges her to handle the emotional complexity."
  },
  {
    "title": "Romantic Relationships and Personal Entanglements Among Interns",
    "arc_type": "Soap Arc",
    "description": "The interns' romantic and sexual relationships become increasingly complicated as they navigate secret affairs, shifting loyalties, and the demands of their medical careers. Meredith and Derek's relationship faces challenges as Meredith seeks more openness, Cristina and Burke's connection is tested by personal struggles, and the group's friendships are strained by these evolving dynamics.",
    "main_characters": "Meredith Grey; Derek Shepherd",
    "interfering_episode_characters": "George O'Malley; Izzie Stevens; Cristina Yang",
    "single_episode_progression_string": "Derek finishes getting ready in Meredith's bedroom. Meredith questions why Derek always stays at her place and asks about his home. Derek avoids answering and goes to the kitchen. Meredith tells Derek she will not have sex with him until she knows him better. Derek says learning about each other is the fun part of a relationship. Derek tells Meredith he thinks their relationship is serious. Meredith asks Derek to prove it. Derek takes Meredith to his trailer and shares personal details about himself."
  },
  {
    "title": "Secrets, Confessions, and the Consequences of Honesty",
    "arc_type": "Soap Arc",
    "description": "Throughout the season, characters grapple with whether to reveal or conceal mistakes, secrets, and feelings, facing the repercussions of honesty or secrecy. The arc examines how confessions can endanger careers and relationships but also enable growth, trust, and accountability.",
    "main_characters": "Meredith Grey; Derek Shepherd; Cristina Yang; Izzie Stevens; Alex Karev",
    "interfering_episode_characters": "George O'Malley; Miranda Bailey; Mr. Duff; Zoey Glass; Devo/Esther; Burke",
    "single_episode_progression_string": "Izzie refuses to call her mother for the cupcake recipe. Meredith confronts Derek about not knowing personal details and demands more honesty. Cristina asks George to cover her shift without giving a reason. Mr. Duff reveals Cristina's pregnancy. Cristina tries to persuade Zoey to choose treatment, but Zoey confides her decision to keep the baby. Izzie denies emotional involvement with patients when Bailey questions her. Alex tells Devo's family about the bovine valve option without consulting Burke. Izzie calls her mother after Mr. Duff reveals her secret ingredient."
  },
  {
    "title": "Professional Ethics and Accountability in Medicine",
    "arc_type": "Genre-Specific Arc",
    "description": "The staff at Seattle Grace face ongoing ethical challenges involving medical errors, patient advocacy, and professional accountability. The arc explores the tension between self-preservation and transparency, as doctors navigate reporting mistakes, confronting past errors, and upholding patient trust.",
    "main_characters": "Burke; Alex; George; Bailey; Cristina; Meredith",
    "interfering_episode_characters": "Izzie; Devo/Esther; Mr. Walker; Zoey Glass; Mr. Duff; Derek",
    "single_episode_progression_string": "George intubates a patient incorrectly and Burke intervenes to correct the error. Burke observes George successfully intubate another patient. Alex suggests a bovine valve for Devo without consulting Burke, leading Burke to remove Alex from the case. Bailey warns Izzie about becoming too emotionally involved with patients. Cristina questions the necessity of surgery for Mr. Duff and requests psychiatric evaluation for Zoey. Meredith challenges Derek's decision to operate on Mr. Walker without full certainty."
  },
  {
    "title": "Balancing Patient Advocacy with Personal Bias",
    "arc_type": "Genre-Specific Arc",
    "description": "Doctors at Seattle Grace navigate the challenge of providing compassionate, equitable care to all patients, even when personal biases, frustrations, or cultural differences arise. This arc explores how physicians confront their own prejudices and assumptions, learning to advocate for patients' needs and beliefs while maintaining professional boundaries.",
    "main_characters": "Alex Karev; Derek Shepherd; George O'Malley",
    "interfering_episode_characters": "Devo (Esther) Friedman; Burke; Meredith Grey; Devo's parents; Mr. Walker; Nurse Harper",
    "single_episode_progression_string": "Alex jokes about Devo's religious appearance and questions her faith. Alex learns about Devo's Orthodox Jewish beliefs and her refusal of a pig valve. Alex researches and proposes a bovine valve alternative for Devo. Burke removes Alex from the case for not consulting him but later asks Alex to secure the bovine valve and a rabbi for Devo. Derek reassures Mr. Walker that his symptoms are real despite inconclusive tests. Derek advocates for surgery for Mr. Walker based on clinical instinct. Meredith questions Derek's decision, raising concerns about bias and unnecessary intervention. George struggles with intubation but succeeds on a second attempt and gains respect from Nurse Harper and Burke."
  },
  {
    "title": "Cristina Yang's Unplanned Pregnancy and Its Impact",
    "arc_type": "Soap Arc",
    "description": "Cristina Yang faces an unplanned pregnancy that threatens her surgical ambitions and complicates her relationship with Preston Burke. The arc follows her as she confronts the emotional and professional consequences, interacts with colleagues who become entangled in her secret, and navigates difficult choices about her future.",
    "main_characters": "Cristina Yang; Preston Burke",
    "interfering_episode_characters": "George O'Malley; Miranda Bailey; Mr. Duff; Zoey Glass",
    "single_episode_progression_string": "Cristina schedules a termination but cannot get an appointment before her ENT rotation. Cristina refuses to discuss options with the clinic staff. Cristina asks George to cover her shift on the 16th without explanation. Mr. Duff guesses Cristina is pregnant. Cristina asks Bailey not to assign her to Mr. Duff in exchange for doing paperwork. Bailey assigns Cristina to assist with a pregnant cancer patient. Cristina tries to persuade Zoey Glass to terminate her pregnancy. Cristina is affected by Zoey's decision to keep the baby. Burke finds Cristina alone and admits his own professional uncertainty. Cristina remains silent about her pregnancy."
  }
]