[
  {
    "title": "Meredith and Derek's Relationship: From Secrecy to Emotional Intimacy",
    "arc_type": "Soap Arc",
    "description": "Meredith and Derek's relationship evolves from a passionate, secret affair to a deeper, more emotionally intimate connection. The arc follows Meredith's insistence on knowing Derek beyond their physical relationship and Derek's gradual willingness to share his personal life, testing their trust and vulnerability.",
    "main_characters": "Meredith Grey; Derek Shepherd",
    "interfering_episode_characters": "George O'Malley; Izzie Stevens; Cristina Yang",
    "single_episode_progression_string": "Meredith challenges Derek about the lack of openness in their relationship, refusing to continue their physical intimacy until she learns more about him. Derek initially resists but ultimately opens up, inviting Meredith into his personal space and sharing more about himself, signaling a shift toward greater vulnerability and seriousness.",
    "thematic_focus": "",
    "narrative_scope": "episode",
    "consolidation_notes": "No merging required; this arc is distinct as the sole ongoing romantic relationship arc between Meredith and Derek."
  },
  {
    "title": "Cristina Yang's Struggle with Vulnerability and Unplanned Pregnancy",
    "arc_type": "Soap Arc",
    "description": "Cristina, fiercely independent and career-driven, faces an unplanned pregnancy that challenges her emotionally and professionally. The arc traces her efforts to manage the situation privately, her reluctance to seek support, and the impact on her relationships and surgical ambitions, exploring themes of control, vulnerability, and the tension between personal life and career.",
    "main_characters": "Cristina Yang",
    "interfering_episode_characters": "George O'Malley; Miranda Bailey; Preston Burke; Zoey Glass (patient)",
    "single_episode_progression_string": "Cristina takes concrete steps to schedule a termination while keeping her pregnancy secret, seeks shift coverage, and avoids emotional discussion. Her internal conflict is deepened by treating a patient facing a similar dilemma, highlighting Cristina's struggle to maintain control and privacy.",
    "thematic_focus": "",
    "narrative_scope": "episode",
    "consolidation_notes": "No merging required; this is a focused character development arc unique to Cristina."
  },
  {
    "title": "The Interns' Journey Toward Professional Competence and Confidence",
    "arc_type": "Genre-Specific Arc",
    "description": "The surgical interns navigate the pressures of their demanding training, striving to build competence, confidence, and professional identity. This arc follows their successes, failures, and mutual support as they face medical, ethical, and interpersonal challenges in the hospital.",
    "main_characters": "George O'Malley; Izzie Stevens; Cristina Yang; Alex Karev; Meredith Grey",
    "interfering_episode_characters": "Miranda Bailey; Preston Burke; Derek Shepherd",
    "single_episode_progression_string": "George overcomes his anxiety to successfully intubate a patient, Izzie grapples with emotional involvement in patient care, Alex takes initiative (and faces consequences) in advocating for a patient, and Cristina negotiates shift coverage, each facing moments that test and develop their professional skills and confidence.",
    "thematic_focus": "",
    "narrative_scope": "episode",
    "consolidation_notes": "No merging required; this arc specifically tracks the interns' collective professional growth."
  },
  {
    "title": "Faith, Ethics, and Personal Beliefs in Medical Decision-Making",
    "arc_type": "Anthology Arc",
    "description": "Recurring conflicts between personal/religious beliefs and medical recommendations challenge both patients and doctors. This arc examines how faith, cultural values, and ethical dilemmas influence treatment choices and the hospital staff's ability to provide care.",
    "main_characters": "Alex Karev; Preston Burke; Cristina Yang; Zoey Glass (patient); Devo/Esther (patient)",
    "interfering_episode_characters": "Izzie Stevens; Miranda Bailey",
    "single_episode_progression_string": "Devo refuses a pig valve due to religious beliefs, prompting a search for alternatives, while Zoey Glass struggles to balance her desire for motherhood with cancer treatment. The doctors must navigate these ethical complexities, reflecting ongoing tensions between medical practice and personal values.",
    "thematic_focus": "",
    "narrative_scope": "episode",
    "consolidation_notes": "No merging required; this anthology arc is specific to recurring faith/ethics dilemmas in patient care."
  }
]