[
  {
    "title": "Meredith and Derek's Complicated Relationship",
    "arc_type": "Soap Arc",
    "description": "Meredith and Derek's relationship begins with a one-night stand and evolves amidst professional challenges and personal revelations.",
    "episodic": false,
    "main_characters": "Meredith; Derek",
    "interfering_episode_characters": "George",
    "single_episode_progression_string": "Meredith questions Derek about why they always stay at her place, leading to a discussion about their relationship. She feels she doesn't know him well and decides to withhold sex until she knows more about him. Derek suggests that discovering things about each other is the fun part of a relationship. By the end of the episode, Derek takes Meredith to his trailer and shares more about himself."
  },
  {
    "title": "Intern Dynamics at Seattle Grace",
    "arc_type": "Genre-Specific Arc",
    "description": "The interns at Seattle Grace Hospital form friendships and rivalries as they navigate the challenges of their medical training.",
    "episodic": false,
    "main_characters": "Izzie; George; Cristina; Alex",
    "interfering_episode_characters": "Burke; Bailey",
    "single_episode_progression_string": "Izzie struggles with her cupcakes and refuses to call her mother for help. George helps Cristina by agreeing to cover for her on the 16th. Alex challenges Burke about the bovine valve transplant, leading to tension. The interns discuss hospital food and joke about Meredith's influence on Derek's surgery decision."
  },
  {
    "title": "Cristina's Competitive Nature and Potential Pregnancy",
    "arc_type": "Soap Arc",
    "description": "Cristina Yang's ambition and competitive drive often put her at odds with her peers, particularly Meredith, while she also faces personal challenges with a potential pregnancy.",
    "episodic": false,
    "main_characters": "Cristina",
    "interfering_episode_characters": "George; Mr. Duff",
    "single_episode_progression_string": "Cristina is seen in a doctor's office scheduling a termination. She feels nauseous and asks George to cover for her on the 16th. Mr. Duff realizes Cristina is pregnant, and she later handles a case involving a pregnant breast cancer patient, reflecting on her own situation."
  },
  {
    "title": "George's Professional Embarrassment and Growth",
    "arc_type": "Genre-Specific Arc",
    "description": "George O'Malley faces professional challenges and personal growth as he navigates his internship.",
    "episodic": false,
    "main_characters": "George",
    "interfering_episode_characters": "Alex; Burke; Nurse Harper",
    "single_episode_progression_string": "George struggles with intubating a patient but later successfully performs the procedure with Nurse Harper's help. He is praised for his improvement, showing growth in his medical skills."
  },
  {
    "title": "Izzie's Personal Growth",
    "arc_type": "Soap Arc",
    "description": "Izzie navigates her relationship with Hank and her commitment to her career, facing personal and professional challenges.",
    "episodic": false,
    "main_characters": "Izzie",
    "interfering_episode_characters": "Mr. Duff; Bailey",
    "single_episode_progression_string": "Izzie is frustrated with her cupcakes and refuses to call her mother for help. She is emotionally involved with Mr. Duff's case and is surprised when he knows personal details about her. By the end of the episode, she calls her mom, showing personal growth."
  },
  {
    "title": "Medical Case: Mr. Duff's Psychic Seizures",
    "arc_type": "Episodic Arc",
    "description": "Mr. Duff claims to have psychic visions linked to his seizures, leading to a medical investigation.",
    "episodic": true,
    "main_characters": "Mr. Duff; Izzie",
    "interfering_episode_characters": "Cristina; Meredith; Bailey",
    "single_episode_progression_string": "Mr. Duff claims to talk to dead people and predicts a death on the 4th floor. Cristina and Meredith perform tests and discover he has epilepsy. An MRI reveals an arteriovenous malformation, and Izzie prepares him for surgery. Mr. Duff is worried about losing his visions, but agrees to the procedure."
  },
  {
    "title": "Medical Case: Devo's Heart Valve Dilemma",
    "arc_type": "Episodic Arc",
    "description": "Devo, a patient with Von Willebrand's disease, faces a dilemma over a heart valve replacement due to religious beliefs.",
    "episodic": true,
    "main_characters": "Devo; Alex; Burke",
    "interfering_episode_characters": "Devo's Parents",
    "single_episode_progression_string": "Devo needs a valve replacement but refuses a pig valve due to religious beliefs. Alex suggests a bovine valve, and Burke agrees to perform the surgery with a rabbi's blessing. The operation is guided by a doctor skilled in bovine transplants."
  },
  {
    "title": "Medical Case: Zoey Glass's Cancer and Pregnancy",
    "arc_type": "Episodic Arc",
    "description": "Zoey Glass faces a difficult decision between cancer treatment and her pregnancy.",
    "episodic": true,
    "main_characters": "Zoey Glass; Cristina",
    "interfering_episode_characters": "Bailey",
    "single_episode_progression_string": "Cristina informs Zoey that her pregnancy hormones are speeding up her cancer. Zoey decides against an abortion despite the risks. Cristina struggles with Zoey's decision, reflecting on her own situation."
  }
]